{
  "batch_id": "meeting_085",
  "doc_type": "meeting",
  "documents": [
    {
      "title": "Nikita Gorshkov - Appt Booking (Gabriel Gregório (Senior Product Analyst)) - 2025/12/18 15:29 CET - Notes by Gemini",
      "doc_id": "1ruiVNPGRySWPNP73Nr2oQRcWUpQBVEuywNgWEHAvBAc",
      "link": "https://docs.google.com/document/d/1ruiVNPGRySWPNP73Nr2oQRcWUpQBVEuywNgWEHAvBAc/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 18, 2025\n\nNikita Gorshkov - Appt Booking (Gabriel Gregório (Senior Product Analyst))\n\nInvited Nikita Gorshkov gabrielgregorio10@gmail.com\n\nAttachments Nikita Gorshkov - Appt Booking (Gabriel Gregório (Senior Product Analyst)) \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nGabriel Gregório shared their prior work in data visualization for a wellness company, explaining how they shifted to providing data insights, such as localized user activity metrics around gyms, which significantly enhanced the sales team's negotiation capabilities. Addressing Nikita Gorshkov's query about shortening time to market and running parallel experiments, Gabriel Gregório suggested incorporating faster research methods like social media surveys or third-party small-group testing alongside traditional A/B testing, citing an example of using two-way messaging for payment reminders at a bank. Gabriel Gregório also offered region-specific qualitative methods for Brazil, like in-app surveys with discounts, and quantitative methods, such as engaging campaigns or competitions to gather measurable data on potential new users and order frequency, while Nikita Gorshkov clarified that their company is globally hiring for an analytics role and has not yet expanded to Brazil due to requirements around \"meat culture,\" pricing, and infrastructure, though the market is considered interesting.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Data Visualization and Insights in the Wellness Sector Gabriel Gregório discussed their prior work in data visualization for a wellness company, noting that their job became more focused on analyzing and providing insights rather than just sending pre-order information. A significant data point provided was related to user activity around gyms, which included details about subscribers within a certain radius, other types of gyms nearby, and the number of new users resulting from subscription changes, which the company lacked before. This data, visualized in a quick-reference dashboard, enabled the sales team to negotiate with clients more effectively and demonstrate the product's value by offering precise user activity metrics down to the neighborhood level, leading to a new approach for sellers (00:01:49).\n\n* Strategies for Shortening Time to Market Nikita Gorshkov asked Gabriel Gregório about methods to shorten the time to market and enable multiple experiments in parallel, especially when standard A/B testing takes significant time (00:04:44). Gabriel Gregório suggested using alternative, faster research methods alongside A/B testing, such as social media surveys or engaging a third-party company for fast research with a small group to quickly validate an idea and then compare the results with the A/B test (00:06:10). Gabriel Gregório provided an example from their experience working in a bank, where they implemented two-way messaging to measure the impact of payment reminders more quickly than waiting for changes to a website (00:07:27).\n\n* Qualitative and Quantitative Validation Methods Gabriel Gregório offered qualitative and quantitative methods to shorten the time to results, focusing on what works well in Brazil. Qualitative suggestions included offering discounts or pop-ups within the app for answering surveys or giving ratings, noting that Brazilians are accustomed to responding to in-app interactions and social media engagement (00:09:45). For quantitative validation, especially when traffic is limited, Gabriel Gregório suggested focusing on measurable goals like potential new users or order frequency and running campaign\n\n\n\nrozen and food for yes for who who knows I like talk to friends and sell. So we have a lot of very small business in in uh country cities in Brazil who already do what Hello Fresh do but yeah as I told you uh may probably this this small business charge a little less than maybe Hello Food will charge.\n\nNikita Gorshkov: No, but I'm talking specifically about uh good shop HelloFresh again mainly about the price point. So at which point does it become profitable for us? Um so this is why we didn't go into Brazil but generally like as a as a place as a market like it would be at some point interesting.\n\nGabriel Gregório: No, I so I just told you Brazilian have the some Brazilian have had to b like five meals,\n\nNikita Gorshkov: Oh,\n\nGabriel Gregório: seven meals and frozen and every day they just h could eating and eat because it's faster and healthy than the industrial one and they don't have time during the week. like in the Sunday they prepare all the the foods or order all the foods and storage or and bring of the for the the work or each in her house.\n\n \n\n \n\n00:17:55\n\n \n\nNikita Gorshkov: huh.\n\nGabriel Gregório: So yeah, it's very common in Brazil but it's nice and it's a premium users because people normally who has a little more money do that.\n\nNikita Gorshkov: Exactly. It's that you always pay for the convenience,\n\nGabriel Gregório: Yes, because is this ones is who go to the gym so need to eat f have.\n\nNikita Gorshkov: right?\n\nGabriel Gregório: So people who go to the jeans have more money normally have more and focus more in in healthy foods. So yes normally it's the same group who who frozen food has more money to buy other things. So yeah I think we have the pro but yeah I'm not try to sell you all come to Brazil just to tell you how works\n\nNikita Gorshkov: No. Fair. Fair enough.\n\nGabriel Gregório: here.\n\nNikita Gorshkov: Fair enough. I mean, we should cool. All\n\nGabriel Gregório: Yeah, I think I understand the what you looking for for a professional.\n\nNikita Gorshkov: right.\n\nGabriel Gregório: I I like the the the model business. I I search for the company. So yeah, I hope you choose me for be your partners in the close future. Oh, today thank you. Oh, okay. Okay. Okay. Thank you.\n\n \n\n \n\nTranscription ended after 00:19:20\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-19-.md",
      "source_date": "2025-12-19",
      "doc_type": "meeting",
      "matched_topics": [],
      "matched_people": [
        "nikita"
      ],
      "filter_score": 1
    },
    {
      "title": "AI Bytes Assemble - 2025/12/18 12:55 CET - Notes by Gemini",
      "doc_id": "1MKFySkvuZIVilf9aAtVTXG6KDoabcm-aoYAPzIc9UDE",
      "link": "https://docs.google.com/document/d/1MKFySkvuZIVilf9aAtVTXG6KDoabcm-aoYAPzIc9UDE/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 18, 2025\n\nAI Bytes Assemble\n\nInvited Nikita Gorshkov Pepijn Senders Adam Ghanem Meggie Bouchard Mario Konschake Luiz Cavalcanti Sergei Kuzmenko Lobo Olsson Ebrahim Kargar Leo Lee Priscila Koeck Machado Lacey Nagel\n\nAttachments AI Bytes Assemble Notes - AI Bytes Assemble \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nThe participants, including Adam Ghanem, someone in BER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4), Pepijn Senders, Lobo Olsson, and Mario Konschake (mentioned in collaboration), discussed aligning on expectations, group boundaries, and the core focus of integrating GenAI into the end-to-end software development lifecycle, specifically for acceleration and platform team initiatives like React Native migration and accessibility efforts. Someone in BER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4) and Pepijn Senders agreed that the immediate focus should be on small, high-value automatable pieces, particularly improving the design system check to ensure Figma files are \"Zestifiable,\" and packaging solutions for the handover stage within Spec Machine. The participants also aligned on conducting a pilot with customer-facing teams, treating the onboarding process as a scientific experiment, and agreed on the necessity of sitting together to review the list of teams and defined quality parameters.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Meeting Location and Initial Check-in Adam Ghanem confirmed the location of the meeting, which is upstairs in a dimsum location (00:00:00), and briefly discussed his health and preference for sitting in a corner. Someone in BER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4) checked on Adam Ghanem's health before he came (00:00:00). Adam Ghanem confirmed they were not sick and would see them in two minutes (00:00:00).\n\n* Vacation and Availability Someone in BER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4) stated they would be on break the following week, using unused vacation days, and would be available but not actively working. They mentioned potentially handing over tasks to Kudlo (00:00:00). Someone in BER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4) advised against being available during vacation, emphasizing the importance of turning off Slack and other work communication because the company will survive (00:00:29).\n\n* Health and Social Distancing Someone in BER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4) mentioned feeling under the weather and practicing social distancing, comparing the feeling to the COVID-19 pandemic, especially due to the large number of people in the office for an all-hands meeting (00:01:31). They also shared that they were relieved to avoid catching a stomach flu from their child, who was sick for five days, which was the reason for their absence the previous week (00:02:09).\n\n* Starting the Discussion and Group Alignment Someone in BER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4) moved the conversation towards the core topics, which centered on gaining alignment regarding expectations, defining a good starting point, and establishing next steps for the group, particularly on how to stay connected despite being across different alliances. They aimed to clarify the collective goals to ensure efficient time use and alignment on group boundaries (00:03:47).\n\n* GenAI Involvement in Development Lifecycle and Team Projects Someone in BER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4) emphasized that the group's main focus is the end-to-end golden platinum software development lifecycle (SDLC), but GenA\n\n\n\nere and saying like AI I don't know if we should do that.\n\n \n\n \n\n01:00:34\n\n \n\nBER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4): Yeah, but he's also so\n\nPepijn Senders: I can tell you exactly what Assaf thinks about this because he told me a couple times. I'll tell you what thinks about this because he told me a couple times.\n\nBER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4): what?\n\nPepijn Senders: I told him it's not compatible with German workforce, especially one that's supported by a works council. Like you're not gonna make it.\n\nBER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4): Yeah. Yeah. But you're I'm right. Right. So it's not we don't need to sell we don't need to sell AI adoption to to Olga or Assaf or what I've seen previously and I'm not see like where like so I've seen other companies that go through like their AI pilots their AI transformations I have like several friends that I talked to to try to understand like what did they eventually start doing so that we just start from there so that we don't figure it out from doing it and every other like person that made an initial approach where they hoped that adoption will um lead us to value.\n\n \n\n \n\n01:01:33\n\n \n\nBER - P89-L4-Dim Sum (Berlin Campus - Prinzenstraße, L4): Uh they either ended up where the pilot got shut down completely or they actually created more tech debt and more quality issues uh popped up. So what I'm trying to do really is like find like I'm not saying like we should go either extreme this way or extreme that way. I believe we have to have spec machine and all the foundational layers on the ground like everyone needs to have it because this will create the best flying wheel of we'll ever see and I'm with you 100% on that but one thing I'm worried about also that this could bankrupt us like imagine if I give an engine where people can operate agents in parallel and lo a day% I think what we're missing here is it up your average right now target goal for uh AI adoption and quality having that we need to define for Mario but for quality should be already using the parameters we need to define parameters what we define as quality that we need to define how so this we can get uh but next\n\n \n\n \n\nTranscription ended after 01:03:23\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-19-.md",
      "source_date": "2025-12-19",
      "doc_type": "meeting",
      "matched_topics": [],
      "matched_people": [
        "nikita"
      ],
      "filter_score": 1
    }
  ],
  "doc_count": 2,
  "total_chars": 12008
}