{
  "batch_id": "strategy_067",
  "doc_type": "strategy",
  "documents": [
    {
      "title": "2026 HFG Domain Objectives | Marketing",
      "doc_id": "1Hh4xda8MmkEO5qT39sjxtBnqKgJxDDH5TdvT_gVd-9s",
      "link": "https://docs.google.com/document/d/1Hh4xda8MmkEO5qT39sjxtBnqKgJxDDH5TdvT_gVd-9s/edit?usp=drivesdk",
      "content": "﻿Domain Objectives\n\nThis document summarizes the 2026 Objectives for the domain and answers FAQs. Working Group/PoCs: Patrick StalJal TummalaSebastian StarkeBjörn HeckelEvan WeintraubIshita Mehta\n\n________________\n\n\n\n\n\nDomain Objectives\n\nOur marketing strategy for 2026 fully aligns with The Refresh ambition: to reignite brand relevance for HelloFresh and Factor, build sustainable, profitable (re-)acquisition and retention growth levers, invest in lasting customer relationships and unlock efficiency. Our primary areas of focus proposed for 2026 are described below by priority. \n\nTL;DR Priorities\n\nWhat is in the more extensive write-up below is correct and captures the more detailed sketches of our plans for 2026. But within that, there are 4 key priorities that we will deliver with higher urgency than any of the other parts. These are as follows:\n\n\n\n\n\nDomain Objective 1 : Step-change our performance marketing engine’s performance, rebuild our Paid Social muscle, (including dedicated creative production capabilities and fresh global talent), optimize spend and reduce D in (CAC + D)\n\nObjective Owner:  Aifric CampbellJessica Blum\n\nInvestment Type: Existing    |  HFG Top 5 Strategy Impact:  5. Efficiency Program/Cost to Serve \n\nMeasure of success: \n\nSuccess will be measured by progress against the following objectives/KPIs:\n\n* Shift to incremental measurement ecosystem\n\n* Automate >80% of bid decisioning on programmatic channels (Search, Display, PS)\n\n* # of Settled Conversions (target tbd in BP)\n\nPaid Social (Rebuild, and focus on accelerating underleveraged formats: whitelisting, video, reach, tiktok, etc.)\n\n* % of Paid spend on Paid social\n\n* Paid Social # of Settled Conversions (target tbd in BP)\n\n* Brand mentions on social (as halo from paid activities)\n\nDiscount spend reduction:\n\n* > 50% of discount spend in targeted / personalized discounts\n\n* Rapid, low-cost discount (elasticity) testing methods in use across all markets\n\n* Reduction of discount per settled conversion by XX EUR p.scvr\n\n\n\nDomain Objective 2 : Commit at least 1/3 of global marketing spend to Brand (Demand Generating) channels, and 50% of that Brand spend to ‘innovative’ brand activation tactics\n\nObjective Owner:  Anna Koklanakis\n\nInvestment Type: Existing    |  HFG Top 5 Strategy Impact:  3. Brand Reignition \n\nMeasure of success: \n\nSuccess will be measured by progress against the following objectives/KPIs:\n\n   * % of spend in Demand Generating channels (target = 33%, from a 2025 total of 21% globally)\n\n   * 4 Global A+ celebrity partnerships activated (and grow share of total marketing spend on local influencer content)\n\n   * 4 Global sponsorship deals activated\n\n   * 4 Global 3rd party partners for surprising brand integrations (i.e. AirBNB product boxes, Ikea kitchen partnership, special edition Crocs, Spotify playlists executed\n\n   * >4 cookware partnerships in NA (e.g. Zwilling, Misen, Caraway, Nutribullet, NINJA and 2 partnerships for Factor (e.g. Oura, lululemon, Hoku, etc)) executed\n\nDomain Objective 3 : Re-set the velocity with which we are accelerating our Organic growth ecosystem\n\nObjective Owner:  Aifric Campbell Jal Tummala\n\nInvestment Type: Existing    |  HFG Top 5 Strategy Impact:  5. Efficiency Program/Cost to Serve \n\nMeasure of success: \n\nSuccess will be measured by progress against the following objectives/KPIs:\n\n   * Remove voucher attribution anchor (allow audiences to convert full-price)\n\n   * Accelerate SEO and GEO progress (impressions, % settled CVRs)\n\n   * Build a pro-active community engagement muscle (digital, in-app w/ project 5M, physical) and amplify the impact of our community on our growth loops\n\nDomain Objective 4 : Build an iCLV driving customer communications (CRM) engine\n\nObjective Owner:  Marie SeegerJashil Kim\n\nInvestment Type: Existing    |  HFG Top 5 Strategy Impact:  5. Efficiency Program/Cost to Serve \n\nMeasure of success: Success will be measured by progress against the following objectives/KPIs:\n\n   * Build one team to look after iCLV comms\n\n   * Create local CRM comms service layer\n\n   * Launch and optimize send decisioning with iCLV optimization function\n\n   * Deliver on existing (actives) roadmap, and fill roadmap for iCLV impact once team is settled\n\n   * XXX iCLV delivered in 2026 (tbd in BP process)\n\nFrequently Asked Questions : \n\n\n\n\n\n   1. Where are the opportunities for GenAI applications in your domain?\n\nAutomated Business Insights & Decision Velocity: Expanding GenAI-driven reporting pilots across all channels and geographies to reduce manual monitoring and accelerate decision-making. This includes automating campaign diagnostics, creating narrative-ready insights, empowering teams with AI-driven alarming thresholds, and integrating conversational analytics tools for self-service analysis. Cross-market benchmarking to flag under/overperformance and recommend reallocations. Forecasting copilots for scenario planning (e.g., “What if we cut Google spend in DE by 10%?”). Social listening + web scraping to surface real-time cultural trends, competitive moves, and creative inspiration.\n\nPersonalized Customer Journeys at Scale: Scaling AI/ML to deliver one-to-one personalization across acquisition, retention, and reactivation. This covers dynamic content generation, tone and imagery adjustments, predictive send-time/channel optimization, and preference-based menu recommendations (e.g., best sellers, “new this week,” friend-ordered items). Predictive churn signals that flag at-risk customers earlier and trigger targeted journeys. Journey stitching across CRM + Paid to avoid siloed follow-ups.\n\nHyperlocal personalization (e.g., recipes, offers, or local partner content by market). Conversational commerce (chatbots in app/WhatsApp) that upsell, cross-sell, or resolve objections in real-time.\n\nExperimentation & Testing Efficiency: Using GenAI to design experiments, automate QA, flag contamination, and accelerate rollout of learnings across channels (e.g., nested tests, synthetic controls, and always-on incrementality testing).\n\nWorkflow Automation – Automating repetitive tasks across Growth, CRM, and Paid (e.g., campaign QA, translations, reporting, landing page updates, and capacity planning), freeing talent to focus on strategic initiatives.\n\nCreative Development Acceleration: Streamlining ideation, storyboarding, and asset variation through GenAI while ensuring speed, authenticity, and brand consistency. Applications include subject line/content variants, localizations, and high-volume content for influencers, partnerships, and SEO. Social listening, web scraping for rapid creative development ideation, reduction in briefing timelines. Using Influencer briefs auto-generated from past campaign performance. Build High-volume creative variation for TikTok, Meta, partnerships, and SEO. Co-branded partner assets drafted instantly, reducing bottlenecks in B2B/Retail Media campaigns.\n\n\n\n\n\n   2. What are you doing to improve the customer experience? \n\nRebalancing Growth Drivers: Transitioning from discount-led acquisition/reactivation to product innovation and quality-led storytelling. This means embedding food quality, menu expansion, and differentiated product experiences (e.g., new SKUs, cross-brand bundles) directly into CRM, referrals, and paid channels, giving customers stronger reasons to choose our brands.\n\nElevating Creative & Advertising: Driving relevance and engagement by embedding continuous creative testing, insight loops, and format innovation into how we advertise. Examples include partnership ads (Meta/TikTok), gamified referral mechanics, and integrated product-led narratives across influencers and affiliates.\n\nPersonalized Journeys Across Channels: Building seamless, cross-channel experiences that combine app, CRM, and paid touchpoints into one tailored journey. This includes integrating referrals into loyalty, embedding reactivation offers into app/product flows, and using AI to dynamically steer messaging mix.\n\n\n\n\n\n   3. What are the known risks or obstacles to achieving these objectives?\n\nMeasurement of Brand Investments: MMMs and geo-tests do not capture long-term brand equity effects. We are building new frameworks to link brand KPIs (awareness, consideration) to financial metrics (CVA, CLV), but interim decisions will require conviction-based brand investments.\n\nData Quality & Fragmentation: Privacy regulation, lack of a unified source of truth, and fragmented data-sharing reduce the accuracy of DDA, mROI, and AI models. Dependencies on third-party platforms/vendors (e.g., Haus, Iterable, CDPs) create scalability and compliance risks.\n\nOperational & Tech Dependencies: Marketing execution remains constrained by inconsistent campaign setup (e.g., CRM tooling, discount recommender rollout, Iterable migration), limiting speed to market and scalability of AI-driven personalization.\n\nCompetitive Landscape: Rivals with aggressive performance spend and diversified models (e.g., Hungryroot, Blue Apron) threaten share. Our hedge is focusing on customer centricity, innovating where product and offer differentiation directly meet unmet customer needs.\n\nDigital Content Evolution: Rising consumer expectations and app fatigue increase pressure to deliver daily value beyond transactions. Scaling GenAI content generation and optimizing in-app experiences are critical hedges.\n\nReliance on Pay-for-Play Channels: Continued dependence on Meta/Google poses risk as LLM-driven search/visibility shifts accelerate. Mitigation requires diversification via SEO optimization, partnership ads, affiliate content, and testing new platforms (Pinterest, TikTok, WhatsApp, etc.).\n\n\n\n\n\n   4. What objectives would MDs and other key stakeholders be most disappointed to have left out for 2026? \n\nAdvanced Forecasting: While forward-looking forecasting of demand, CAC, and retention would improve resource allocation and give earlier visibility into marketing ROI, building these capabilities requires significant modeling and alignment effort across Finance, Data, and Marketing. Given our current focus on settled conversion measurement and efficiency automation, advanced forecasting will remain deprioritized in 2026, with only incremental improvements to existing planning and monitoring tools.\n\nPortfolio-Level Optimization: Most of our steering still occurs at brand/channel level. A portfolio-aware approach to MMM and budget allocation (to capture cannibalization and halo effects across brands) could materially increase total HFG value, but may slip due to complexity.\n\nProduct Monetization Expansion: Alternative monetization models such as one-time ordering, non-subscription pathways, or flexible cadences have potential to attract new segments and reduce barriers to trial. We will test one-time ordering in a limited capacity in Q4 2025. Properly scaling and supporting these models requires product, operations, and go-to-market coordination beyond our current scope. In 2026, focus will remain on strengthening the subscription-led model, making it more engaging and re-engaging through improved brand experiences and app journeys.\n\nReactivations & Smaller Brands: The bulk of innovation focuses on large markets and leading brands. Smaller markets and brands risk being deprioritized for personalization, loyalty, and discount optimization, leaving value on the table.\n\n\n\n\n\n\n\n\n\nAppendix\n\nAppendix - Inspiration for 1 YP \n\n\n\n\n\nFocus Area (tied to objective 1): [Efficiency] Unlock efficiency by optimizing spend (CAC + D), step changing our organic growth volumes, and reinvesting savings into brand strength\n\nMeasure of success: Increase CCVA (conversions CVA) to $350MM, a 10% increase from 2025 baseline (to be reviewed with BP)\n\nObjective Owner:  Marcus von Franck\n\nInvestment Type: Existing    |   HFG Top 5 Strategy Impact:  5. Efficiency Program/Cost to Serve \n\n\n\n\n\nDescription: While we’ve made progress, the bulk of our marketing investments including discounts and media spend, remain manually managed. This leads to slow feedback loops, exposure to errors, and overspending on activations that never become lasting customers. By embedding AI-led optimization and channel management and shifting focus toward higher-quality, retained customers, we will drive a step-change in marketing efficiency. Our goal is to deliver 25% more settled conversions (total, not proportional) at similar spend levels. This will free up resources to reinvest in brand building and create a more sustainable growth engine. We’ll achieve this by doing the following differently:\n\n1. Transform the Growth Engine: Creative, Funnel & Performance Optimization \n\n   * Stepchange creative execution by building rapid customer-centric feedback loops with creative teams and using Gen AI to quickly produce content that resonates with customers, proving our products’ value in their lives while moving beyond purely transactional messaging\n\n   * Automate performance marketing by shifting spend decisions (how much, when, where) to AI-led systems, with >80% of Google and paid social spend globally steered towards incremental settled conversions\n\n   * Improve the conversion funnel by tailoring end-to-end experiences to different audiences, boosting CVRs and enabling higher CAC targets with more qualified traffic\n\n   * Embed settled conversions as the core optimization metric for CVA growth, with playbooks to prioritize high-quality customers over discount seekers (60%+ churn by box 3 today).\n\n   * Expand organic growth via SEO and GEO to rank top for food inspiration (including in LLMs), driving organic traffic and lowering reliance on paid ads in blended CAC\n\n   * Measure and optimize for the incremental value of each campaign, using experimentation to validate results and refine measurement models. Measurement will also evolve to invest based on marginal value of advertising, focusing on the incremental return of each additional dollar spent\n\n   * Double down on cultural halo performance channels (Influencers, Whitelisting, TikTok, Meta) that efficiently engage new audiences and place us at the center of culture. Be first to test new up and coming channels\n\n2. Shape a Smarter Discount & Offer Strategy\n\n   * Personalize discounting by deploying targeted offers (50% of spend) that move away from one-size-fits-all, campaign-level approaches\n\n   * Diversify third-party offers (e.g., Caraway) to deliver customer value while reducing discount reliance.\n\n   * Develop rapid, low-cost testing methods (on-site, synthetic audiences) to trial offers, discount structures, and messaging without disrupting paid media efficiency\n\n\n\n\n\nFocus Area (tied to objective 2) : [Consumer-Focused] Reignite cultural relevance of our brands, with a bold shift in brand marketing approach\n\nMeasure of success: Brand Buzz, TOMA/Awareness (TOMA for HF, Awareness for F_ and startup markets)\n\nObjective Owner:  Patrick Stal\n\nInvestment Type: Existing    |  HFG Top 5 Strategy Impact:  3. Brand Reignition \n\n\n\n\n\nDescription: HFG’s marketing has leaned too heavily on lower funnel channels and discount mechanics, eroding brand equity and long-term value. Despite spending €2.5bn on media and discounts over the past year, our brands lack relevance, distinction and a differentiated brand image. Brand investments have been sporadic, shallow, and cut too quickly in pursuit of short-term results, limiting innovation in awareness-building channels. In 2026, we will reignite appetite for our brands by showing up in disruptive and unexpected ways and leveraging the equity of culinary expertise, hype-worthy food content and highly engaged foodie fan communities. We will stretch beyond ‘pay for play’ to build conversation, earn our role in media and culture and deepen community engagement. Finally, we will allocate the investment and measurement resources to create space for innovation and feedback loops on what sticks. We will do the following differently:\n\n1. Move from transactional communication to emotionally resonant, insight driven storytelling and messaging \n\n   * Sharpen articulation of (global) value propositions, messaging houses and (global & regional) superiority claims\n\n   * Drumbeat product marketing comms that meet key customer needs through customer experience upgrades, product novelty, and FOMO via exclusive chef partnerships (e.g., restaurant recipe collaborations)\n\n   * Establish cross-channel media planning as a standard practice to tailor messages across the customer journey — from emotional benefits to highly persuasive conversion drivers\n\n   * Anchor our global brands in clear creative platforms to enable bold execution and distinctive, ownable  yet diversified content and activations locally\n\n   * Shift from discount reliance to persuasive superiority claims and value-add incentives (e.g. Ltd Edition Le Creuset cookware, subscriber-only events, health claims, community exclusive experiences)\n\n2. Commit at least 20% of paid marketing investment in total Brand demand generation \n\n   * Invest strategically across Portfolio with deeper commitments in some markets - guided by brand maturity and competitive context, and flexing above 20% where appropriate\n\n   * Ring-fence half of this investment into disruptive, experimental and non-traditional channels to create brand demand generation activities (examples in point 3 below)\n\n3.  Radically diversify our ‘Brand’ channel mix beyond traditional high reach channels and content formats\n\n   * Integrate our brands into entertainment properties and high reach video channels (e.g. Masterchef sponsorship & feature, ‘I’m a Celebrity’, owned culinary formats, sport, athlete and nutritionist sponsorships for Factor)\n\n   * Bring to life sensory-rich experiential activations via local food festival and cultural events calendar (e.g. HF chefs at Taste Festivals, Factor sampling at sporting events, retail popups, airport arrival retail, etc.)\n\n   * Bring reach and appeal for our target audience via celebrity ambassador programmes featuring aspirational sports, chefs, lifestyle, or cultural figures (at least 2 A+ listers per brand (HF/F) in NA  and 2 in INTL)\n\n   * Leverage 3rd party partners for surprising brand integrations that build earned media (i.e. AirBNB product boxes, Ikea kitchen partnership, special edition Crocs, Spotify culinary playlists, at least 4 cookware partnerships in NA (e.g. Zwilling, Misen, Caraway, Nutribullet, NINJA and 2 partnerships for Factor (e.g. Oura, lululemon, Hoku, etc))\n\n   * At least 4 major multi-year sponsorships across global markets that strengthen our brands’ distinct propositions and build high physical visibility with our target communities (eg. venues, teams, events, competitions, festivals etc.)\n\n   * Engage super fan communities for storytelling and advocacy by helping them identify, connect, celebrate, and advocate as part of the brand community - online and offline\n\n4. Establish a clear Brand Measurement Model \n\n   * Quantify the most efficient way to build our brand with our audiences through a clear model that tracks efficiency of dollars spent on a single, comparable input metric (CPM, cost per impression).\n\n   * Optimise the marketing mix by leveraging Ad Tech to deliver a brand MMM that measures channel contribution to brand metrics and commercial outcomes, covering 75% of brand investment by end of 2026.\n\n   * Strengthen Brand Equity by dynamically deploying investments toward proven drivers of equity and growth.\n\n\n\n\n\nFocus Area (tied to objective 2) : [Infrastructure] Build Muscle for Telling Brand Story and Change Consumer Value Perception\n\nMeasure of success: Grow XX% in total raw consideration, as a measure of the total# of brand considerers we have gained\n\nObjective Owner: Patrick Stal\n\nInvestment Type: Existing    |   HFG Top 5 Strategy Impact:  3. Brand Reignition\n\n\n\n\n\nDescription: Despite Customer Centricity being one of HFG’s DNA values, we are not truly a customer-centric business today. We have cost-engineered products at the customer’s expense, built digital experiences around our own capabilities rather than their desires, and drifted away from the places where they naturally congregate, online and offline. To reignite the role our brands play in culture and improve how audiences perceive us, we must start with them. We must embed the customer into every decision we take. In marketing, this means embedding customer insights into every step of how we plan, create, and deliver experiences. In 2026, we will do the following differently:\n\n1. Institutionalize Customer-Centric Planning\n\n   * Embed customer insights into planning and execution, replacing inside-out thinking with an outside-in perspective. The planning cycle will start with a ‘customer brief’ to ensure all functions are building from a common set of insights. We will end it with a ‘knowledge agenda’ identifying the knowledge gaps and research roadmap to address those gaps.\n\n   * Strengthen Customer Insights’ partnership with IXI research team as a global knowledge base (e.g. Slack ‘knowledge bot’ adoption expansion, synthetic audience democratization, ‘open to all’ focus groups across markets)\n\n   * Dedicated time in every SMT summit to bring the ‘customer’ into the conversation (led by GCI & IXI Research)\n\n   * Establish a rapid 24-hour insight cycle to ensure reputational priorities guide creative, messaging, and portfolio choices \n\n2. Define & Drive Perception Shifts Across the Experience\n\n   * Anchor each brand in 1–2 clear messaging pillars (e.g., sustainable choice, fun discovery, trusted health companion) and ensure our external tone of voice reflects how customers actually talk about food - eliminating jargon in favor of cultural relevance (e.g., training AI copy and QA tools to flag and remove jargon)\n\n   * Map the current brand experience and escalate fixes cross-functionally identifying low points versus desired standards, with SMT commitment to prioritize resolution\n\n   * Reinforce brand experience beyond campaigns embedding it into product design, packaging, customer service, and the unboxing experience - making non-functional aspects of the brand come alive at every touchpoint\n\n3. Build a Modern Content Engine\n\n   * Automate transactional asset production (currently 80% of what we produce) and reallocate talent to create bold, platform-native stories that spark conversation and connection \n\n   * Transform recipe experience from instructions into cultural currency, reimagined through short-form video, creator partnerships, guided cook-along tooling, and interactive formats making them the emotional anchor of our brand. \n\n   * Build a global world-class paid social content-feedback-content engine by building on Xpod, fueling an ambition to deploy >20% of our paid spend into social\n\n   * Build conviction in brand narratives and social-first creativity, training teams and automating rapid test-and-scale loops so our stories evolve at the speed of culture\n\n4. Meet our brand target communities where they are\n\n   * Actively listen to and take part in brand conversation ensuring we are listening and observing hyper local food trends, key categories of interest and cultural nuance per market to feel the pulse of conversation happening around our brands\n\n   * Authentically contribute to our target audience’s online/offline communities and the passion points with which we want our brands to be associated (culinary and health) to meet them where they already are (TikTok, Instagram, Reddit, streaming platforms, audio apps, AI assistants, and dating platforms and IRL) and taking part in the conversations they care about\n\n   * Master Paid Social to become the channel to test fast and scale the best performing content, native formats and messaging that most effectively engages our target customers  \n\n   * Build nimble, experimental creative muscles tailored to the speed of social, while embedding cultural cues into the entire HelloFresh journey from sign-up to retention so food is experienced not just as utility, but as inspiration, creativity, and connection\n\n\n\n\n\nFocus Area (tied to objective 4) : [Consumer-Focused] Build Lasting Customer Relationships Beyond the Box\n\nMeasure of success: Increase TCVA contribution of CRM channels by 20% (to be reviewed with BP) YoY while keeping opt-out rates stable or lower YoY\n\nObjective Owner:  Jal TummalaJashil KimMarie Seeger\n\nInvestment Type: Existing    |   HFG Top 5 Strategy Impact:  4. App Experience\n\n\n\n\n\nDescription: In line with our goal of transforming the HelloFresh app into a daily food companion, our growth depends on building lasting relationships with our entire user base, from prospects to our most loyal customers. Historically, our user base marketing has been entirely transactional. We rely on discount-heavy pushes to convert leads and re-engage lapsed users, while limiting communication with active subscribers to managing their next box. In 2026, we will shift to a content-led strategy that reinforces the value we provide customers across their end-to-end food journey, not just when they order from one of our brands. This will transform our user experience into a new driver of our sustainable growth engine. \n\n   * Transform CRM communication channels into a source of daily value for customers, showcasing content and tools that help them with their daily food needs\n\n   * Excite lapsed customers with content by giving them a reason to stay engaged through value-focussed, personalized content coming from both local and global sources\n\n   * Improve the effectiveness of referral communications, powered by AI and ML, to encourage our most engaged customers to share content and refer friends - building on existing and finding new growth loops \n\n   * Expand the breadth of channels we use to communicate with leads, customers and formers adapting our experience to new messaging platforms (E.g. SMS, RCS, Whatsapp, etc.)\n\n\n\n\n\nFocus Area : [Infrastructure] Modernize our marketing operating model and talent  \n\n\n\n\n\nMeasure of success: Over 75% of Marketing team members are at the medium level of the AI \n\nObjective Owner: Patrick Stal\n\nInvestment Type: Existing    |   HFG Top 5 Strategy Impact:  5. Efficiency Program/Cost to Serve\n\nDescription: Generative AI is redefining how campaigns are created, optimized, and scaled. This is an opportunity to build leaner, faster, and more provocative machines than the one we operate. Our ambition is that in 2026, HelloFresh should start to  operate as an advanced and provocative marketing organization: a GenAI-first machine powered by bold, world-class talent. Our teams will spend less time managing tasks and more time shaping culture, driving creativity, and building lasting brand relevance. We will achieve this by doing the following differently :\n\n1. Automate the Marketing Backbone (also covered in DO 4) : \n\n   * Hardwire automation across campaign management, reporting, and diagnostics to collapse cycle times from wks to hrs. \n\n   * Automate intelligence to reallocate spend in real time across channels, audiences, and creative, while \n\n   * Personalize engines  that dynamically adapt offers and journeys at scale\n\n   * Stronger foundational forecasting models and automate >50% of the current marketing budget process - freeing up hundreds of hours of capacity for more value-add tasks\n\n2. Redesign the Marketing Operating Model\n\n   * Shift from manual execution to automation-led orchestration, with a central control tower overseeing guardrails and agile pods combining media, data, and creative in continuous test-and-learn cycles\n\n   * Daily and Weekly tracking meetings will be fed by AI and ML engines, and will be decision meetings rather than reporting mechanisms (recommendations being automated)\n\n   * Playbook documentation will be standardized, archived in a crawlable manner for our AI enabled Marketing skill base\n\n   * Best practices will be shared more pro-actively, and our tools will help us identify where learnings from one market could lift another in the portfolio\n\n   * Shift human focus from repetitive tasks to brand building, provocative storytelling, and cultural engagement\n\n3. Industrialize Creative Production (also covered in DOs 1 and 2)\n\n   * Transform creative into a high-velocity system, where automation and AI accelerate asset generation, adaptation, and testing across formats.\n\n   * Support storyboarding, copy design, and creative variation through GenAI, while strict guardrails ensure efficiency enhances, rather than dilutes, brand integrity and cultural resonance\n\n4. Rewire Talent & Capabilities\n\n   * Provide learning opportunity to receive basic AI training all marketing talent \n\n   * Map Talent on AI proficiency model per function, and AI proficiency will be a core aspect of JDs, competency maps, performance reviews and career progression\n\n   * Reshape team to thrive in an automation-first world by adding new muscles : automation specialists, creative technologists and data engineers while ensuring existing talent becomes fluent in AI-enabled tools\n\n\n============================================================\n## EMAIL CONTENTS\n============================================================\n\n----------------------------------------\n### EMAIL: Re: Interest in Candidates from Analysis 12/3\nID: 19aef144ff4021fd\nFrom: Nikita Gorshkov <nikita.gorshkov@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Invitation: Influencer Market Place Updates and Direction @ Fri Dec 12, 2025 4pm - 4:30pm (CET) (Nikita Gorshkov)\nID: 19aef1168c243404\nFrom: Marc <marc.mellone@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Notes: “Sameer:Nikita 1:1” Dec 5, 2025\nID: 19aef106eee63b22\nFrom: Gemini <gemini-notes@google.com>\n----------------------------------------\n\nNotes from “Sameer:Nikita 1:1”\n\n\n\nThese notes have been sent to invited guests in your organization.\n\n\n\nOpen meeting notes\n\n\n\nThe content was auto-generated on December 5, 2025, 4:08 PM CET and may  \n\ncontain errors.\n\n\n\n\n\nSummary\n\n\n\nSameer Doda confirmed that the overall work volume is manageable, with  \n\nAllison assisting on the platform and Good Chop Shopify projects, though  \n\nSameer Doda and Nikita Gorshkov noted that program revivals are unlikely  \n\ndue to a lack of resources, a point Sameer Doda, David, and Nikita Gorshkov  \n\ndiscussed with Marina regarding unfunded work. Sameer Doda detailed their  \n\ninvolvement in the complex Good Chop Shopify project, the DACH Juices  \n\nsupport project for Nordic markets that requires a technical solution, and  \n\nthe Influencer Marketplace, which needs an MVP path forward due to varied  \n\nstakeholder views and already has design progress with Shay; Sameer Doda  \n\nand Nikita Gorshkov agreed on a simple one-time purchase customer journey  \n\nfor the MVP, but Sameer Doda raised concerns about limitations with  \n\napplying vouchers and selling add-ons, which Nikita Gorshkov suggested  \n\ndiscussing with Jama, and both acknowledged a need for more frontend  \n\ndevelopment resources. Sameer Doda needs to coordinate with Jama for the  \n\nroadmap review meeting and discussed the \"Seamless Pricing Upgrade\"  \n\ninitiative, which Nikita Gorshkov suggested de-prioritizing, while they  \n\nalso agreed to maintain two different views of the roadmap and implement an  \n\nintake process with Ian as the tactical point of contact.\n\n\n\n\n\nSuggested next steps\n\n\n\n\n\nSameer Doda will set up a session next week with the physical product team  \n\nfor HelloFresh Canada to align on the Q1 target date for the influencer  \n\nmarketplace.\n\n\n\nSameer Doda will go through the answers received from Viola regarding the  \n\nduck juices support and create a requirements document, including an  \n\nestimate for when the work will be picked up in Q1.\n\n\n\nSameer Doda will set up a session next week with Nikita Gorshkov and Shay  \n\nto (1) review the basic customer journey for the onetime purchase flow and  \n\nthe low fidelity designs for the influencer marketplace, and (2) work with  \n\nShay to iron out changes needed on the low fidelity designs so Shay can  \n\ncontinue working on the high fidelity designs.\n\n\n\nSameer Doda and Nikita Gorshkov will connect with Jamba on Monday to  \n\ndiscuss the roadmap review meeting with stakeholders and determine the  \n\ninvitees.\n\n\n\n\n\nMeeting records Document Notes by Gemini\n\n\n\n\n\nWas this email useful?\n\nNot Useful Email Useful Email\n\n\n\n\n\nGoogle LLC, 1600 Ampitheatre Parkway, Mountain View, CA 94043, USA\n\n\n\nYou have received this email because meeting artifacts were initiated in  \n\nGoogle Meet.\n\n\n\n\n\n\n\n\n----------------------------------------\n### EMAIL: Re: Interest in Candidates from Analysis 12/3\nID: 19aef0e1307e06a0\nFrom: Gugu Nyoni <gugu@globaltalent.co>\n----------------------------------------\n\n[No readable text content found]\n\n\n============================================================\nEND OF RAW DATA\n============================================================\n\nInstructions for Claude Code:\nSynthesize the above into AI_Guidance/Core_Context/YYYY-MM-DD-context.md\nIMPORTANT: STRICTLY IGNORE any content, meeting notes, decisions, or updates dated before 2025-06-08 (6 months ago).\nExtract: Key decisions, action items, blockers, metrics, important dates (only recent).\nFormat: NGO-style bullets, structured sections\n============================================================\n## JIRA UPDATES (-12h)\n============================================================\n\n[TPT-2425] [GD] AQA | Fix deactivation settings test (Status: Backlog, Priority: Normal)\n[PA-25116] Priority 3 (With Elysium): Recipe rating_Origin data  (Status: In Progress, Priority: Normal)\n[PA-25532] Recipe rating nudge - add WL and failure reasons to dashboard (Status: In Progress, Priority: High)\n[PA-25524] ABBA Dashboard - Add new metrics (Status: In Progress, Priority: Urgent)\n[RTEVMS-2312] [OTP] Get and show active customer orders history with OTP (Status: In Progress, Priority: Normal)\n[PA-25541] [VMS] Email Conversion Uptick | W48 Deep Dive (Status: In Progress, Priority: Normal)\n[RTEVMS-2245] Internal Service Error when placing order (Status: Backlog, Priority: Normal)\n[RTEVMS-2351] [OTP] New cart creation after initial OTP cart creation (Status: Backlog, Priority: Normal)\n[RTEVMS-2291] [OTP] Remove otp product cart on logout (Status: In Progress, Priority: Normal)\n[PA-25461] [VMS] Cancellation Dashboard | Add Reasons (Status: Backlog, Priority: Normal)",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-03.md",
      "source_date": "2025-12-05",
      "doc_type": "strategy",
      "matched_topics": [
        "good chop",
        "tpt",
        "vms",
        "otp",
        "one-time purchase"
      ],
      "matched_people": [
        "jama",
        "sameer",
        "allison",
        "nikita"
      ],
      "filter_score": 9
    },
    {
      "title": "DRAFT [HelloTech Launch Announcement] - Factor Form Shopify Storefront is LIVE in the US!",
      "doc_id": "14YPFN46bPMpwHgTqjZ9dQ4NDtdN_CD-p0gMamXF_mX4",
      "link": "https://docs.google.com/document/d/14YPFN46bPMpwHgTqjZ9dQ4NDtdN_CD-p0gMamXF_mX4/edit?usp=drivesdk",
      "content": "﻿DRAFT [HelloTech Launch Announcement] - Factor Form Shopify Storefront is LIVE in the US!\n\n\n\n\n\nHi Everyone,\n\nSuper excited to share that we’ve officially launched the Factor Form Shopify Storefront in the US! 💪✔️\n\nThis launch is a milestone for the Factor Form team and for our 2026 growth strategy. It marks the successful debut of an alternative and flexible shopping experience for net new Factor customers. \n\nDate of launch: December 18, 2025\n\nMarkets: Factor Form, US\n\n\n\nWhat is being launched? What problems are we addressing?\n\n* A new dedicated Shopify storefront at https://www.factorform.com\n\n* This store offers the complete Form product line: Daily Greens, Hydration Boost, Whey Protein, and bundles featuring these products\n\nToday, Factor meal subscribers convert to Form at a higher rate than net-new customers. The current purchasing experience offers limited flexibility into the type and quantity of orders customers can place, which may be a barrier for net-new shoppers (vs Factor meal subscribers). To improve CR and AOV for this audience, the new Shopify storefront introduces:\n\n* Flexible purchasing options: Customers can choose between or order both one-time purchases and subscriptions products.. \n\n* Simplified user experience: A streamlined Shopify checkout (including ShopPay) and an intuitive customer portal for subscription, one-time order, and account management.\n\nWhy is this important?\n\n* Provides customers with increased purchasing flexibility, supporting both one-time orders and subscriptions. \n\n* Customers can easily make subsequent purchases and seamlessly add new products to their order, even after their initial transaction.\n\n* Enables internal teams to rapidly test and launch experience improvements, new products, and PLP/PDP updates in a no-code environment.\n\n* Provides greater ownership over brand storytelling, bundling, and lifecycle strategy—reinforcing our value proposition as a food-first wellness system.\n\nWhat does the experience look like?\n\n  \n\n  \n\n  \n\n\n\n  \n\n  \n\n  \n\n\n\n\n\n\n\nPlease feel free to explore the full experience on your own – https://www.factorform.com\n\nWhat's next?\n\n* Campaign Launch: Official marketing campaigns are scheduled to go live on December 26, 2025, driving targeted traffic to the new experience.\n\n* Performance Monitoring: Over the next six months, we will closely track CVR, product uptake, AOV, and customer journey analytics to measure the impact of the dedicated store.\n\n* Empowering the Team: Implementing improvements to make the Shopify store even more easier to manage without technical support\n\n* Building Authority: Enabling ‘science’ landing pages provide customers with the \"why\" behind Factor Form products.\n\n\n\nA Huge Thank You\n\nPlease join me in celebrating this major achievement! The launch would not have been possible without the support of our core and cross-functional teams. 🔥🏋️‍♀️\n\n \n\n   * Factor Form Team: @Laura Loughran @Shindy Lu @Amy Cheong @Sandhya Reddy @Tyler Epidy @Tess Cavalieri @Kiran Kanthavar \n\n   * Factor Form Squad: @Hamed Karimian @Michael James Clarke\n\n   * Market Innovation Squad: @Elena Pavlova @Ameek Singh @Wanderley Teixeira @Sameer Doda\n\n   * Analytics and Data: @Simon Perez @Jason Studstill @Varsha Lalwani @Alicja Marzena Fijalkowska\n\n   * Legal: @Thomas Cohn @Jessica Haymond\n\n   * Revenue & Marketing Accounting / Global Payments / Tax Teams: @Lauren Maki @Kaitlyn Campuzano @Devanshi Vakil @James Cuglietto @Rachael Vuong \n\n   * Product and Engineering Leadership - New Ventures Tribe: @Daniel Arias @Nikita Gorshkov @Jama Musse",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-23-.md",
      "source_date": "2025-12-23",
      "doc_type": "strategy",
      "matched_topics": [
        "new ventures",
        "factor form",
        "market innovation",
        "one-time purchase"
      ],
      "matched_people": [
        "jama",
        "hamed",
        "sameer",
        "daniel",
        "nikita"
      ],
      "filter_score": 9
    },
    {
      "title": "DRAFT [HelloTech Launch Announcement] - Factor Form Shopify Storefront is LIVE in the US!",
      "doc_id": "14YPFN46bPMpwHgTqjZ9dQ4NDtdN_CD-p0gMamXF_mX4",
      "link": "https://docs.google.com/document/d/14YPFN46bPMpwHgTqjZ9dQ4NDtdN_CD-p0gMamXF_mX4/edit?usp=drivesdk",
      "content": "﻿DRAFT [HelloTech Launch Announcement] - Factor Form Shopify Storefront is LIVE in the US!\n\n\n\n\n\nHi Everyone,\n\nSuper excited to share that we’ve officially launched the Factor Form Shopify Storefront in the US! 💪✔️\n\nThis launch is a milestone for the Factor Form team and for our 2026 growth strategy. It marks the successful debut of an alternative and flexible shopping experience for net new Factor customers. \n\nDate of launch: December 18, 2025\n\nMarkets: Factor Form, US\n\n\n\nWhat is being launched? What problems are we addressing?\n\n* A new dedicated Shopify storefront at https://www.factorform.com\n\n* This store offers the complete Form product line: Daily Greens, Hydration Boost, Whey Protein, and bundles featuring these products\n\nToday, Factor meal subscribers convert to Form at a higher rate than net-new customers. The current purchasing experience offers limited flexibility into the type and quantity of orders customers can place, which may be a barrier for net-new shoppers (vs Factor meal subscribers). To improve CR and AOV for this audience, the new Shopify storefront introduces:\n\n* Flexible purchasing options: Customers can choose between or order both one-time purchases and subscriptions products.. \n\n* Simplified user experience: A streamlined Shopify checkout (including ShopPay) and an intuitive customer portal for subscription, one-time order, and account management.\n\nWhy is this important?\n\n* Provides customers with increased purchasing flexibility, supporting both one-time orders and subscriptions. \n\n* Customers can easily make subsequent purchases and seamlessly add new products to their order, even after their initial transaction.\n\n* Enables internal teams to rapidly test and launch experience improvements, new products, and PLP/PDP updates in a no-code environment.\n\n* Provides greater ownership over brand storytelling, bundling, and lifecycle strategy—reinforcing our value proposition as a food-first wellness system.\n\nWhat does the experience look like?\n\n  \n\n  \n\n  \n\n\n\n  \n\n  \n\n  \n\n\n\n\n\n\n\nPlease feel free to explore the full experience on your own – https://www.factorform.com\n\nWhat's next?\n\n* Campaign Launch: Official marketing campaigns are scheduled to go live on December 26, 2025, driving targeted traffic to the new experience.\n\n* Performance Monitoring: Over the next six months, we will closely track CVR, product uptake, AOV, and customer journey analytics to measure the impact of the dedicated store.\n\n* Empowering the Team: Implementing improvements to make the Shopify store even more easier to manage without technical support\n\n* Building Authority: Enabling ‘science’ landing pages provide customers with the \"why\" behind Factor Form products.\n\n\n\nA Huge Thank You\n\nPlease join me in celebrating this major achievement! The launch would not have been possible without the support of our core and cross-functional teams. 🔥🏋️‍♀️\n\n \n\n   * Factor Form Team: @Laura Loughran @Shindy Lu @Amy Cheong @Sandhya Reddy @Tyler Epidy @Tess Cavalieri @Kiran Kanthavar \n\n   * Factor Form Squad: @Hamed Karimian @Michael James Clarke\n\n   * Market Innovation Squad: @Elena Pavlova @Ameek Singh @Wanderley Teixeira @Sameer Doda\n\n   * Analytics and Data: @Simon Perez @Jason Studstill @Varsha Lalwani @Alicja Marzena Fijalkowska\n\n   * Legal: @Thomas Cohn @Jessica Haymond\n\n   * Revenue & Marketing Accounting / Global Payments / Tax Teams: @Lauren Maki @Kaitlyn Campuzano @Devanshi Vakil @James Cuglietto @Rachael Vuong \n\n   * Product and Engineering Leadership - New Ventures Tribe: @Daniel Arias @Nikita Gorshkov @Jama Musse",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-23-01.md",
      "source_date": "2025-12-23",
      "doc_type": "strategy",
      "matched_topics": [
        "new ventures",
        "factor form",
        "market innovation",
        "one-time purchase"
      ],
      "matched_people": [
        "jama",
        "hamed",
        "sameer",
        "daniel",
        "nikita"
      ],
      "filter_score": 9
    },
    {
      "title": "Closing Email: 2026",
      "doc_id": "1kxsg7pU-b0dlz29yBMhCmeIolkioaHR-OSpFqLgu9O4",
      "link": "https://docs.google.com/document/d/1kxsg7pU-b0dlz29yBMhCmeIolkioaHR-OSpFqLgu9O4/edit?usp=drivesdk",
      "content": "﻿Dear Team, \n\n\n\n\n\nClosing out 2025, one has to reflect back and, in doing so, agre that we’re closing 2025 in style! This has been a banging year with us delivering bigger and more impactful things faster than ever before, with many of you working directly on Factor Programs, ABBA, Cross-Selling, Mealkit Handovers, Accessibility Improvements and Occasion Boxes for HelloFresh; while driving our brands to new heights and expanding the TAM (wink!) for The Pets Table, Good Chop and Factor Form! While this year had some hiccups along the way (Wallet migration - looking at you!) and turbulence and transition - your ability to dive into any topic, your readiness to help your colleagues and friends out day and night; your empathy and support allowed you to weather the stormy waters and have some fun while doing it. You lot are absolute legends! \n\n\n\nGoing into 2026 we have a strong Yearly Plan, we have cool projects and we have the right ambition for next year to be a pivotal for HelloFresh Group and, we have the right team in place to get all of it done. With our new team structure, bringing greater focus on our brands, clearer reporting and stakeholder lines and greater freedom to make design, experience, product and engineering decisions we are certain that we will rock it in the coming year and we’re set to deliver some huge wins already in the first weeks of January. \n\n\n\nGet some days of rest, recharge, enjoy the winter weather (as much as possible) and connect with your family, friends and loved ones. I wish you all a brilliant coming new year where your ambitions are always matched by your successes and some luck along the way. \n\n\n\n\n\nHappy New Year and HUGE Thank you - we would be nowhere without each and every one of you!\n\n\n\nDaniel & Nikita",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-30-01.md",
      "source_date": "2025-12-30",
      "doc_type": "strategy",
      "matched_topics": [
        "good chop",
        "the pets table",
        "pets table",
        "factor form",
        "cross-selling",
        "occasion boxes",
        "occasion box"
      ],
      "matched_people": [
        "daniel",
        "nikita"
      ],
      "filter_score": 9
    },
    {
      "title": "Consumer Mega-Alliance: Q1 2026 Planning",
      "doc_id": "1OehkiNalXtJOayotT5_HGmEP2vYbPmJSGkGdN48lWBU",
      "link": "https://docs.google.com/document/d/1OehkiNalXtJOayotT5_HGmEP2vYbPmJSGkGdN48lWBU/edit?usp=drivesdk",
      "content": "﻿Process & Timeline\n\nProcess\n\n* Usual\n\n   1. Meta backlog (MBL) released\n\n   2. Mega-alliance creates quarterly plan, swarms on MBL items\n\n   3. SMT signs off\n\n* Q1 2026\n\n   1. Mega-alliance creates bottom-up quarterly plan\n\n   2. MBL released\n\n   3. Mega-alliance adjusts quarterly plan based on MBL\n\nTimeline\n\n* Dec 3, 2025: Draft bottom-up tribe quarterly plans ready for review\n\n* Dec 4, 2025: Half-day planning workshop with tribe leads\n\n* Dec 8, 2025: Bottom-up Q1 quarterly plan ready for review\n\n* Dec 9, 2025: Bottom-up Q1 quarterly plan shared with Assaf (5pm)\n\nFormat\n\nOutput\n\n2026 Yearly Plan - Consumer Mega-Alliance (Final) - Q1\n\n* Please fill in Table 6 for your squads\n\n* Each cell in the table should contain one deliverable - pick the squad’s highest-priority deliverable for that month, don’t aggregate multiple deliverables\n\n* To make the roadmap scannable, give each deliverable a short, descriptive name and highlight it in bold. You can optionally add a short description too, but keep it to 6 lines or less\n\nInternal Working File\n\nConsumer Mega-Alliance Roadmap\n\nEventually, we’ll find a way to generate this automatically. For now, let’s update the file manually\n\n\n\n\n\nInstructions\n\n* Initiative: \n\n   * Should represent a deliverable - don’t include discovery work\n\n   * Should be human understandable - avoid domain jargon and acronyms; ask yourself whether a busy member of the SMT could understand what it means\n\n   * Each squad should have at least 1 deliverable per month\n\n* Description: \n\n   * formulate it as a product hypothesis (“we believe that by doing x, y will happen”), to make the connection with your squad KPI clear\n\n* Product spec: \n\n   * Eventually, this should be a link to the product spec \n\n      * Details: AI-Native Product Development Handbook\n\n   * For now, it can be any doc that provides product context (WBD, PRD, etc.)\n\n* Tribe priority\n\n   * Use this column to indicate the consolidated stack-rank of your tribe’s initiatives \n\n* Capacity planning\n\n   * We need to have confidence that we can deliver the initiatives in the roadmap\n\n   * We can approach this as a bottom-up or top-down exercise - see below\n\n   * In either case, we want to timebox the planning to max. 2 weeks\n\n\n\n\n\nDiscussion Questions\n\n* How should we communicate the stack-rank in the roadmap?\n\n   * Start with prioritized backlog\n\n   * Convert to roadmap, which considers urgency and other factors\n\n   * Add tribe-level priority column\n\n* How do we want to handle capacity planning?\n\n   * Bottom-up: define scope, estimate effort, draw the line\n\n   * Top-down: draw the line, allocate capacity, define scope (during the quarter)\n\nAppendix: Existing Planning Docs\n\nPlease add links to any existing artefacts your squads are using to plan and visualise their roadmaps to the table below. We’ll consider them while creating the standardized template.\n\nTribe\n\n\tSquad\n\n\tPlan\n\n\tEngagement\n\n\tInspire\n\n\tIgnite Engagement – The Hub of Our Food Ecosystem\n\nEngagement Product Roadmap\n\n\tAct\n\n\tIgnite Engagement – The Hub of Our Food Ecosystem\n\n\tLoyalty & Virality\n\n\tShare\n\n\tQ1 Roadmap Planning - Loyalty & Virality\n\nReferrals Strategic Alignment 2026\n\nMiro\n\n\tMissions\n\n\tRewards\n\n\tConsumer Foundations\n\n\tConsumer Acceleration\n\n\tConsumer Acceleration - Q4 2025 Roadmap\n\n\tClient Platform\n\n\tSquad Client Platform – Capacity Planning\n\n\tConsumer Core\n\n\tCustomers\n\n\t\n\n\n\n\tPlans\n\n\t\n\n\n\n\tOrders & Deliveries\n\n\t\n\n\n\n\tMonoliths\n\n\t\n\n\n\n\tNew Ventures\n\n\tThe Pets Table\n\n\tDraft 2026 Roadmap\n\n\tGood Chop\n\n\tRoadmap - Good Chop 2025/2026\n\n\tFactor Form\n\n\tRoadmap - Factor Form\n\n\tMarket Innovation & Optimizati\n\n\n\n\n\tCart\n\n\tHigh-level Shopping Foundation Roadmap 2026 \n\n\tShopping Platform\n\n\tHigh-level Shopping Foundation Roadmap 2026 \n\n\tPersonalization\n\n\tHigh-level Shopping Foundation Roadmap 2026 \n\n\t\n\n\n\nLinks for reference\n\nQuarterly Planning Process - Consumer Services Alliance (for reference)\n\n(2025) Customer Benefits & Pricing OKRs/Initiatives Capacity Planner\n\nAJA - Q4 planning\n\nStandard for Epics in Jira in Active Alliance [approved - 2025.02] (outdated, maybe still useful)\n\n\n\n\n\nIntro\n\n🚦 Q1 Planning Kick-off: Timeline & Immediate Actions\n\nNow that the 2026 YP is finalized and the new org structure is live, we’re shifting focus to Q1 Planning. Awn and I learned yesterday that the due date for submitting our draft Q1 plan is Dec 5. \n\nWe acknowledge there are still a few open questions about the \"definition of done\" for the Q1 plan (e.g., granularity, should it cover 100% of the team’s capacity or just what’s needed to deliver the Q1 meta-backlog, etc.). We’re working on clarifying these questions with Assaf and Brian to make sure we don't ask you all to do unnecessary work.\n\n📅 The Plan for This Week:\n\n* Tues: mega-alliance leads review the \"definition of done\" for Q1 plans with Assaf to confirm expectations (aiming for monthly deliverables by squad vs. detailed capacity plan).\n\n* Fri: we’ll share the confirmed timeline, template, and process with you.\n\nWhat you should do now (Don't wait for Friday):\n\n* Product Leads: Start compiling your Q1 initiative backlog.\n\n   * Break down your squads’ Q1 quarterly deliverables from the YP into chunks you expect to deliver in each month of the quarter. \n\n   * Notes: \n\n      * If the quarterly deliverables in the YP no longer reflect what you see as the best way to drive your squads’ KPIs, you can propose changes.\n\n      * For Consumer Core, we can create a single plan for the whole tribe\n\n* Engineering Leads: Stick to \"T-Shirt Sizing\" for now. Do not spend time on detailed engineering estimation yet.\n\n* Everyone: Plan Bottom-Up.\n\n   * The Meta Backlog for Q1 isn’t finalized yet. For now, assume you can build your roadmap based on the domain objectives, squad KPIs, and the YP. We’ll adjust for top-down Meta Backlog items once they’re published.\n\nWe’re looking to keep this lightweight and focused on outcomes. More details to follow by the end of the week. As always, thanks for your understanding while we go through this transition",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-.md",
      "source_date": "2025-12-05",
      "doc_type": "strategy",
      "matched_topics": [
        "new ventures",
        "good chop",
        "the pets table",
        "pets table",
        "factor form",
        "market innovation"
      ],
      "matched_people": [
        "max"
      ],
      "filter_score": 7
    }
  ],
  "doc_count": 5,
  "total_chars": 49480
}