{
  "batch_id": "prd_012",
  "doc_type": "prd",
  "documents": [
    {
      "title": "InComm / HelloFresh Tech Integration  - 2025/12/08 09:27 EST - Notes by Gemini",
      "doc_id": "1rRmGsbWAGQO0FkOpzSbKUngrJdhuwlKvfRyl4f_1Zto",
      "link": "https://docs.google.com/document/d/1rRmGsbWAGQO0FkOpzSbKUngrJdhuwlKvfRyl4f_1Zto/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 8, 2025\n\nInComm / HelloFresh Tech Integration \n\nInvited Laura Titherington Taylor Phelan April Dunham Elysa Viti pmccabe@incomm.com Nikita Gorshkov solutionsconsulting@incomm.com ovicente@incomm.com Scott Silver Amy Alpert Elaine Tobin Aniva Lu Phillip Pidoux-Koronya Jacob Gabiam\n\nAttachments InComm / HelloFresh Tech Integration  \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nLaura Titherington, Jacob Gabiam - InComm, Nikita Gorshkov, Oliver Vicente, Phillip Pidoux-Koronya, and Elaine Tobin, among others, discussed the integration process and roles for HelloFresh’s new retail gift card program with InComm, covering the transferred value activation process, value management, and the use of PINs for redemption. Key technical and business requirements were debated, including InComm's ability to create custom-prefixed PINs, the data available in reporting for analytics (such as merchant name and location), and error handling with specific timeout thresholds and retry/cancel recommendations for \"get status\" and \"redeem\" requests. Participants also addressed the scope of integration, noting the preference for a variable load product from Elysa Viti and the need to finalize economics, particularly for the Costco program and the creation of separate or combined Canadian and US contracts, with Laura Titherington agreeing to inquire about a single North American agreement to simplify legal review for Elaine Tobin.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Meeting Setup and Introductions Laura Titherington addressed initial technical issues with Jacob Gabiam - InComm's audio connection (00:00:00). After resolving the audio problem, Laura Titherington stated that the purpose of the call was to discuss the transferred value integration and introduced Jacob Gabiam - InComm, who would answer questions, and Nikita Gorshkov, who would lead the discussion (00:01:25). A round of introductions followed, with attendees including Nikita Gorshkov (leading new ventures at HelloFresh) (00:02:29), Jacob Gabiam - InComm (Solutions Consultant at InComm) (00:03:29), Laura Titherington (Business Development for InComm Canada) (00:02:29), Oliver Vicente (Lead Channel Manager at InComm), Phillip Pidoux-Koronya (Director of Account Management at InComm Canada) (00:03:29), and Elaine Tobin (running gift cards and flyers for HelloFresh US/Factor) (00:04:36).\n\n* Integration Process and Roles Jacob Gabiam - InComm outlined the steps for the integration, explaining that they would gather requirements and then send them out for PM assignment, with Oliver Vicente providing additional support until a Project Manager is assigned (00:03:29). Phillip Pidoux-Koronya clarified that their team will manage the relationship with HelloFresh, launch the product, and manage the program going forward after Laura Titherington hands off the contract. Elaine Tobin noted that HelloFresh is working as a North America unit to scope out and onboard with InComm for a new retail gift card program (00:04:36).\n\n* Transferred Value Gift Card Activation Jacob Gabiam - InComm described the transferred value process for physical gift cards, where HelloFresh is not involved in the initial activation (00:05:38). The process involves the retailer scanning the IAB barcode, which InComm uses to mark the card as active for the requested amount. The consumer then uses the PIN on the back of the card to send a request to InComm via HelloFresh to validate the PIN and purchase; upon success, HelloFresh sends a redemption request, transferring the value. Nikita Gorshkov confirmed that the verification h\n\n\n\nthough um and see see what they if there's an opportunity to do a North American agreement for this. I I'm just not hopeful because they it hasn't been done in the past.\n\n \n\n \n\n00:41:01\n\n \n\nElysa Viti: Okay. Like we're okay to have two different so it just like the main portion of the MSA usually is the same for both North um both countries.\n\nLaura Titherington: Totally understand. Not typically how we do it. I will I will ask the question though.\n\nElysa Viti: Okay. Yeah. See if what your team can do. If not, like you said, if there was a red line version, you guys can provide. We just don't want that much. We don't want to create too much work for a procurement team, unnecessary extra work. Uh, and we don't want the US to have to launch a lot later than Canada.\n\nLaura Titherington: Yeah.\n\nElysa Viti: We'd like to launch like similar timelines.\n\nElaine Tobin: Yeah.\n\nLaura Titherington: Yeah, understood. So, let me take that back. Um, let me take that back. I I don't have an answer right now because I have to ask\n\nElysa Viti: Okay. All right.\n\nElaine Tobin: Yeah, I think the other thing of note is like given this request is going in after December 1st, I know our legal team isn't even going to like be able to review and finalize anything until like January. I think anything that we need signed off and reviewed the end of year was due a week ago. So like that's already setting our team back. If that means like Canada won't get finalized until sometime in January, then how long will it take for us, you know? So I think in terms of us like getting business case resourcing like US is just a much higher spend market. So we kind of need to be running in tandem for things to move on the Canadian side.\n\nLaura Titherington: No problem. Let me see what we can do on our side.\n\nElaine Tobin: Okay.\n\nLaura Titherington: All right.\n\nElysa Viti: Okay, we'll wait for the contract from you, Laura, and then if we have any questions.\n\nLaura Titherington: Good. Yeah. So, I may hold on that until I get the answer of because there's no point in sending and unless, you know, because right now it as it stands, it's just a Canadian contract.\n\nElysa Viti: Yeah. Yeah. Okay, great. Awesome.\n\nElaine Tobin: Thank you.\n\n \n\n \n\nTranscription ended after 00:43:13\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.\n\n\n============================================================\n## EMAIL CONTENTS\n============================================================\n\n----------------------------------------\n### EMAIL: Invitation: Actives Journey: Early & Often @ Weekly from 4pm to 5pm on Thursday (CET) (Nikita Gorshkov)\nID: 19b033bca46aa328\nFrom: Elisa Marku <em@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Invitation: Good Chop Charge at Checkout refunds @ Tue Dec 9, 2025 6:30pm - 7pm (CET) (Nikita Gorshkov)\nID: 19b03397435f8bc2\nFrom: Beatrice Dimarucut <bdim@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Global Warehouse Technology Update November 2025\nID: 19b03337339bc689\nFrom: Chris Chapman <chris.chapman@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Re: [URGENT ACTION NEEDED] NOVEMBER-2025 Reporting on Time Spent per KR for Capitalisation\nID: 19b032596bb07a0e\nFrom: Ankith <ankith.padmanabha@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Invitation: Anthropic @ HelloFresh - Claude Code Masterclass @ Tue Dec 16, 2025 9:30am - 11:30am (CET) (Nikita Gorshkov)\nID: 19b02f8e7ac83824\nFrom: Pepijn Senders <ps@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Updated invitation: [HOLD] Consumer Mega Alliance AHM @ Thu Dec 18, 2025 5pm - 6pm (CET) (Nikita Gorshkov)\nID: 19b02d8e28132d44\nFrom: Marc <marc.mellone@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Canceled event: Bi-Weekly GenAI and Engineering Excellence - CFA @ Tue 2025-12-09 16:00 - 17:00 (CET) (tam-expansion-alliance-all@hellofresh.ca)\nID: 19b02ce3aa25d203\nFrom: Stefano Palazzo <stefano.palazzo@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Notes: “Prateek:Nikita 1:1” Dec 9, 2025\nID: 19b02a13ed0464ba\nFrom: Gemini <gemini-notes@google.com>\n----------------------------------------\n\nNotes from “Prateek:Nikita 1:1”\n\n\n\nThese notes have been sent to invited guests in your organization.\n\n\n\nOpen meeting notes\n\n\n\nThe content was auto-generated on December 9, 2025, 11:05 AM CET and may  \n\ncontain errors.\n\n\n\n\n\nSummary\n\n\n\nPrateek Jajoo experienced a Confluence page access issue, which was  \n\nresolved by Nikita Gorshkov granting access to anonymous users, who also  \n\nclarified the meeting's purpose is for Prateek Jajoo's personal  \n\ndevelopment, unblocking, and issue escalation, asking them to manage ETAs  \n\nfor the login page and app documentation. Prateek Jajoo updated on  \n\nprioritizing login page features like text box visibility and language  \n\nenhancement for conversion before Katrina's absence, seeking reviews from  \n\nNikita Gorshkov and Laura Doas this week, and also discussed deprioritizing  \n\nsocial logins while raising concerns about the lack of recipe selection  \n\ntransparency on the checkout page, which Nikita Gorshkov agreed to test if  \n\ninexpensive. Additionally, Prateek Jajoo sought clarity on the design  \n\nreview process with Laura Doas, with Nikita Gorshkov advising to consult  \n\nMaria about the TPT experience preview or set up a separate small design  \n\nreview.\n\n\n\n\n\nSuggested next steps\n\n\n\n\n\nPrateek Jajoo will manage Nikita Gorshkov's expectations regarding the ETA  \n\nfor the plan and documents related to the login page and the app.\n\n\n\nPrateek Jajoo will catch up with the PM who has more information on social  \n\nlogin and include the reasons fo\n\n\n\ne  \n\npayment or checkout page by checking if the information is available and if  \n\nthere are customer complaints related to a lack of transparency.\n\n\n\nPrateek Jajoo will check with Maria regarding the TPT experience preview or  \n\nset up a small design review with Laurand Dovas to get feedback on the  \n\ndesign changes.\n\n\n\nPrateek Jajoo will get feedback from Doas today and, if concrete and  \n\naligned, will set up 30 minutes to socialize the design.\n\n\n\nPrateek Jajoo will check again for access to the groups needed, after  \n\ngetting access to the new tribe new in Slide page.\n\n\n\nPrateek Jajoo will raise a support request if the confluence page access  \n\nissue is not resolved.\n\n\n\n\n\nMeeting records Document Notes by Gemini Document Chat transcript Video  \n\nRecording\n\n\n\n\n\nWas this email useful?\n\nNot Useful Email Useful Email\n\n\n\n\n\nGoogle LLC, 1600 Ampitheatre Parkway, Mountain View, CA 94043, USA\n\n\n\nYou have received this email because meeting artifacts were initiated in  \n\nGoogle Meet.\n\n\n\n\n\n\n\n\n----------------------------------------\n### EMAIL: Invitation: Anthropic @ HelloFresh - Claude Code Masterclass @ Tue Dec 16, 2025 9:30am - 11:30am (CET) (Nikita Gorshkov)\nID: 19b02921541fd9c7\nFrom: Pepijn Senders <ps@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Re: [URGENT ACTION NEEDED] NOVEMBER-2025 Reporting on Time Spent per KR for Capitalisation\nID: 19b0278beaad36f6\nFrom: Marc Huvelin <marc.huvelin@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Notes: “Beatrice:Nikita 1:1” Dec 9, 2025\nID: 19b026d8662564f9\nFrom: Gemini <gemini-notes@google.com>\n----------------------------------------\n\nNotes from “Beatrice:Nikita 1:1”\n\n\n\nThese notes have been sent to invited guests in your organization.\n\n\n\nOpen meeting notes\n\n\n\nThe content was auto-generated on December 9, 2025, 10:23 AM CET and may  \n\ncontain errors.\n\n\n\n\n\nSummary\n\n\n\nNikita Gorshkov and Beatrice Dimarucut discussed \"charge at checkout\"  \n\nrefunds, noting that a week is too long for the process and that tracking  \n\nrefunded customers separately may be necessary, and they agreed to consult  \n\nwith Kag to clarify how refunds and cancellations are individually tracked  \n\nin the AL system for paid orders. Nikita Gorshkov is introducing Beatrice  \n\nDimarucut to the Spur founders, whose competitive analysis tool addresses  \n\ntracking and comparing flows to an ideal state, and they have financial  \n\napproval to procure them as a supplier. Furthermore, Nikita Gorshkov is  \n\nopening a CS5 role for Beatrice Dimarucut to mentor, providing career  \n\ndevelopment and shoring up work with Yuri following Dio's departure, and  \n\nassured Beatrice Dimarucut that potential resistance from Annie would be  \n\nminimal due to the defined headcount structure and involvement of key  \n\npeople like John, Yuri, Seb, Alex, DA, and external folks from payments and  \n\ncustomer care.\n\n\n\n\n\nSuggested next steps\n\n\n\n\n\nBeatrice Dimarucut will summarize the owl issues for Nikita Gorshkov.\n\n\n\nNikita Gorshkov will formalize the career development plan for Beatrice  \n\nDimarucut.\n\n\n\nNikita Gorshkov will create the promo case for the new headcount and talk  \n\nwith Jamba about the candidate to open the CS5 role.\n\n\n\nThe group will ask Kag if refunds and cancelled are individually tracked.\n\n\n\n\n\nMeeting records Document Notes by Gemini\n\n\n\n\n\nWas this email useful?\n\nNot Useful Email Useful Email\n\n\n\n\n\nGoogle LLC, 1600 Ampitheatre Parkway, Mountain View, CA 94043, USA\n\n\n\nYou have received this email because meeting artifacts were initiated in  \n\nGoogle Meet.\n\n\n\n\n\n\n\n\n----------------------------------------\n### EMAIL: Re: [URGENT ACTION NEEDED] NOVEMBER-2025 Reporting on Time Spent per KR for Capitalisation\nID: 19b025bc305b2991\nFrom: Patrick Gunia <patrick.gunia@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Re: [URGENT ACTION NEEDED] NOVEMBER-2025 Reporting on Time Spent per KR for Capitalisation\nID: 19b0174279fb201d\nFrom: Brian Leung <brian.leung@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: \nID: 19b00905bd13bcae\nFrom: Nikita Gorshkov <nikita.gorshkov@hellofresh.com>\n----------------------------------------\n\n\n\n\n\nNikita Gorshkov Director of Product, New Ventures\n\n\n\nHelloFresh Global | Prinzenstraße 89 , 10969 Berlin, Germany\n\n\n\nEmail: nikita.gorshkov@hellofresh.com\n\n\n\nHelloFresh SE, Berlin (Sitz der Gesellschaft) | Vorstände: Dominik S. \n\nRichter (Vorsitzender), Thomas W. Griesel, Christian Gärtner, Edward Boyes \n\n| Vorsitzender des Aufsichtsrats: Jeffrey Lieberman | Eingetragen beim \n\nAmtsgericht Charlottenburg, HRB 182382 B | USt-Id Nr.: DE 302210417\n\n\n\nCONFIDENTIALITY NOTICE: This message (including any attachments) is \n\nconfidential and may be privileged. It may be read, copied and used only by \n\nthe intended recipient. If you have received it in error please contact the \n\nsender (by return e-mail) immediately and delete this message. Any \n\nunauthorized use or dissemination of this message in whole or in parts is \n\nstrictly prohibited.\n\n\n\nHelloFresh SE, Berlin (Sitz der Gesellschaft) | Vorstände: Dominik S. \n\nRichter (Vorsitzender), Thomas W. Griesel, Christian Gärtner, Edward Boyes \n\n| Vorsitzender des Aufsichtsrats: John H. Rittenhouse | Eingetragen beim \n\nAmtsgericht Charlottenburg, HRB 182382 B | USt-Id Nr.: DE 302210417\n\n\n\nCONFIDENTIALITY NOTICE: This message (including any attachments) is \n\nconfidential and may be privileged. It may be read, copied and used only by \n\nthe intended recipient. If you have received it in error please contact the \n\nsender (by return e-mail) immediately and delete this message. Any \n\nunauthorized use or dissemination of this message in whole or in parts is \n\nstrictly prohibited.\n\n\n\n\n\n\n----------------------------------------\n### EMAIL: Updated invitation: Spur / Comp Reports (Follow-up Conversation) @ Tue Dec 9, 2025 6pm - 6:30pm (CET) (nikita.gorshkov@hellofresh.com)\nID: 19b0080446a452dd\nFrom: Sneha Sivakumar <sneha@tryspur.dev>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Re: Intro: Max Chizhov (dellish.co) - Potential YouFoodz Integration\nID: 19aff8b919a19a3d\nFrom: Serdar Nurmammedov <serdar@dellish.co>\n----------------------------------------\n\nHi Greer, Rhea and Nick,\n\n\n\nNice to connect with you!\n\n\n\nHere is our generic presentation deck:\n\nhttps://docsend.com/view/7uarjmm6ecuunxi7\n\n\n\nI noticed your office is in Brisbane. I am actually based in the Gold Coast\n\nsix months of the year (the other half is split between Dubai and Europe)\n\nand I will be in the GC from next week.\n\n\n\nIn any case, we can have a zoom call first and/or meet up in person. How is\n\nyour availability next week?\n\n\n\nBest,\n\n\n\nSerdar\n\nCo-founder & CEO\n\n\n\n\n\nOn Fri, Dec 5, 2025 at 10:15 PM Maxim Chizhov <max@dellish.co> wrote:\n\n\n\n> Hey Greer, Rhea and Nick,\n\n> I'd like to add my co-founder Serdar.\n\n> Could you share some slots for our call next week?\n\n>\n\n> Blurb:\n\n> *Dellish* is redefining how food is produced, preserved, and consumed\n\n> with its proprietary plug-and-play HyperFresh™ solution — delivering\n\n> delicious, healthy, and sustainable food at peak freshness, flavour, and\n\n> nutrition, naturally and without additives or waste.\n\n>\n\n> *HyperFresh*™ is compatible with existing chilling and freezing systems,\n\n> enabling Dellish to bridge food producers and delivery aggregators poised\n\n> to expand their share of the stomach through quick commerce — unlocking a\n\n> new, more efficient revenue stream that reduces waste, maintains high\n\n> quality, and enables consistent, fast delivery.\n\n>\n\n> As the enabler of this novel business model, Dellish turns waste into\n\n> value for producers and aggregators alike — delivering better margins and\n\n> improved custome\n\n\n\nreturn e-mail) immediately and delete this message. Any\n\n>>> unauthorized use or dissemination of this message in whole or in parts is\n\n>>> strictly prohibited.\n\n>>>\n\n>>>\n\n>>>\n\n>>>\n\n>>>\n\n>>> <https://www.hellofresh.com/jobs/?utm_medium=email&utm_source=email_signature>\n\n>>> HelloFresh SE, Berlin (Sitz der Gesellschaft) | Vorstände: Dominik S.\n\n>>> Richter (Vorsitzender), Thomas W. Griesel, Fabien Simon, Edward Boyes | Vorsitzender\n\n>>> des Aufsichtsrats: John H. Rittenhouse | Eingetragen beim Amtsgericht\n\n>>> Charlottenburg, HRB 182382 B | USt-Id Nr.: DE 302210417\n\n>>>\n\n>>> *CONFIDENTIALITY NOTICE:* This message (including any attachments) is\n\n>>> confidential and may be privileged. It may be read, copied and used only by\n\n>>> the intended recipient. If you have received it in error please contact the\n\n>>> sender (by return e-mail) immediately and delete this message. Any\n\n>>> unauthorized use or dissemination of this message in whole or in parts is\n\n>>> strictly prohibited.\n\n>>>\n\n>>\n\n\n\n\n----------------------------------------\n### EMAIL: Updated invitation: Spur / Comp Reports (Follow-up Conversation) @ Tue Dec 9, 2025 6pm - 6:30pm (CET) (nikita.gorshkov@hellofresh.com)\nID: 19afee526aabc788\nFrom: Sneha Sivakumar <sneha@tryspur.dev>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: HelloFresh US 2025-W47 Recipe Report\nID: 19afee2ea4608421\nFrom: \"'Rachel LeMier' via Recipe Survey Results\" <recipe-survey-results@hellofresh.com>\n----------------------------------------\n\nHi team,\n\n\n\n\n\nHelloFresh 2025 Week 47 resulted in an overall menu score of 3.41 (-0.09 target\n\nscore of 3.50, -0.10 vs planned menu score of 3.51).\n\n\n\n\n\nCPI Commentary: Scores this week were still greatly impacted by the\n\nbroccoli shortage with nearly 20% of all comments received mentioning\n\nmissing broccoli. Other recipes that missed included: Meatloaf a la mom\n\n(commentary that gravy recipe was bad), super-quick market recipes\n\n(currently being addressed by product team) and 2 recipes for side dishes\n\nthat ran as Thanksgiving specials.\n\n\n\n\n\nPlease see our full report\n\n<https://docs.google.com/spreadsheets/d/1mVR6C-x_UMmuY9lgn3VC0N-SdEnfhMcwM2eX9sMpse0/edit?gid=389153776#gid=389153776>\n\nfor\n\nin-depth WoW views.\n\n\n\n\n\nWeekly Call-Outs:\n\n\n\n   - SKU Launches:\n\n      - Falafel, Traditional - 10 Piece (pc), slot 20\n\n   - *Quality*\n\n      - R31 - steak was tough and fatty - DC TI: 28/252 | DC NJ: 24/252 |\n\n      DC NW: 4/252; demand was 9.3 suggesting the concept is appealing but the\n\n      meat quality was a detractor from overall score\n\n\n\n\n\n\n\nRecipe of the Week:\n\n\n\nCheesy Smashed Burgers, Demand 6.6 and RS 3.70; L2 \"DELICIOUS! Hands down\n\none of my favorites!\"\n\n\n\n\n\nReferenced Links\n\n\n\n   -\n\n\n\n   Recipe Report\n\n   <https://docs.google.com/spreadsheets/d/1mVR6C-x_UMmuY9lgn3VC0N-SdEnfhMcwM2eX9sMpse0/edit?gid=965641887#gid=965641887>\n\n   -\n\n\n\n   Recipe Score Dashboard\n\n   <https://tableau.hellofresh.io/#/workbooks/13325/views>\n\n   -\n\n\n\n   Weekly Sentiment Dashboard\n\n   <https://tableau.hellofresh.io/#/workbooks/8937/views> & Trend Dashboard\n\n   <https://tableau.hellofresh.io/#/views/SentimentTrendAnalysisNEWDraft/SentimentTrends?:iid=1>\n\n   -\n\n\n\n   US Product & Monetization Metrics\n\n   <https://tableau.hellofresh.io/#/workbooks/7980/views>\n\n   -\n\n\n\n   Zest (Recipe Summarization Tool)\n\n   <https://docs.google.com/document/d/1_JTVkhfkcFDg_jylwmAXo7urFq_GYFJeddPmQHrOSI0/edit?tab=t.0>\n\n\n\n\n\n--\n\n\n\n*RACHEL LEMIER*\n\n\n\nManager, Consumer & Product Insights\n\n\n\n-- \n\nYou received this message because you are subscribed to the Google Groups \"Recipe Survey Results\" group.\n\nTo unsubscribe from this group and stop receiving emails from it, send an email to recipe-survey-results+unsubscribe@hellofresh.com.\n\nTo view this discussion visit https://groups.google.com/a/hellofresh.com/d/msgid/recipe-survey-results/CAP8Ce7myWNoCfQ4asjSNn%3DdWx_puGnLN5PygN3W%2BjfdNu%3Dy6uw%40mail.gmail.com.\n\n\n\n\n\n\n----------------------------------------\n### EMAIL: Notes: “Nikita / Beatrice” Dec 8, 2025\nID: 19afee2babd168dc\nFrom: Gemini <gemini-notes@google.com>\n----------------------------------------\n\nNotes from “Nikita / Beatrice”\n\n\n\nThese notes have been sent to invited guests in your organization.\n\n\n\nOpen meeting notes\n\n\n\nThe content was auto-generated on December 8, 2025, 5:53 PM CET and may  \n\ncontain errors.\n\n\n\n\n\nSummary\n\n\n\nNikita Gorshkov outlined a plan to include a banner suggesting users try  \n\nthe marketplace beta for meat, featuring a one-off box for delivery with  \n\nexpress checkout, to be included in the next delivery of dashboards. The  \n\nteam, including Beatrice Dimarucut and Nikita Gorshkov, discussed the  \n\ntechnical implementation of one-time purchases (OTP) for active customers,  \n\nweighing the ease of transferring addresses and choosing between using a  \n\nproper endpoint or a redirect to Shopify. The main talking points focused  \n\non enabling OTP for active customers due to its low cost and potential  \n\nrevenue, which Beatrice Dimarucut agreed to move forward with using minimal  \n\nUI work and a redirect to a plans page, pending confirmation with Alex.\n\n\n\n\n\nSuggested next steps\n\n\n\n\n\nBeatrice Dimarucut will clarify with Alex whether it will be easier to use  \n\nthe proper endpoint for the OTP flow and confirm the required work to link  \n\nit with different products, such as occasion or preset boxes.\n\n\n\nBeatrice Dimarucut will determine where to place the minimal UI work to  \n\nexpose the OTP entry point in the subscription flow and redirect users back  \n\nto a plans page with the OTP option.\n\n\n\nNikita Gorshkov and Beatrice Dimarucut will work on seeing and getting  \n\nfeedback from customers.\n\n\n\n\n\nMeeting records Document Notes by Gemini\n\n\n\n\n\nWas this email useful?\n\nNot Useful Email Useful Email\n\n\n\n\n\nGoogle LLC, 1600 Ampitheatre Parkway, Mountain View, CA 94043, USA\n\n\n\nYou have received this email because meeting artifacts were initiated in  \n\nGoogle Meet.\n\n\n\n\n\n\n\n\n----------------------------------------\n### EMAIL: Declined: Yury:Nikita 1:1 (2w) @ Fri Dec 19, 2025 9:45am - 10:15am (CET) (Nikita Gorshkov)\nID: 19afed29ebf4ab60\nFrom: Yury Trofimov <yt@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Declined: Yury:Nikita 1:1 (2w) @ Fri Dec 19, 2025 9:45am - 10:15am (CET) (Nikita Gorshkov)\nID: 19afed284efc55e9\nFrom: Yury Trofimov <yt@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Proposed new time: Ian:Nikita 1:1 (2w) @ Fri Jan 2, 2026 5pm - 5:30pm (CET) (Nikita Gorshkov)\nID: 19afeca2d34ecea4\nFrom: Ian Brooks <ian@hellofresh.ca>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Updated invitation: Good Chop: Product Experience Weekly Review @ Thu Dec 11, 2025 1:30pm - 2pm (CET) (Nikita Gorshkov)\nID: 19afec13366c1d01\nFrom: Beatrice Dimarucut <bdim@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Updated invitation: Tech Sync Good Chop @ Wed Dec 17, 2025 8:30pm - 9:30pm (CET) (Nikita Gorshkov)\nID: 19afeaad33937c04\nFrom: Yury Trofimov <yt@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Updated invitation: Tech Sync Good Chop @ Wed Dec 17, 2025 8:30pm - 9:30pm (CET) (Nikita Gorshkov)\nID: 19afeaa737ccc65b\nFrom: Yury Trofimov <yt@hellofresh.com>\n----------------------------------------\n\n[No readable text content found]\n\n\n----------------------------------------\n### EMAIL: Notes: “InComm / HelloFresh Tech Integration ” Dec 8, 2025\nID: 19afe8a6532a3680\nFrom: Gemini <gemini-notes@google.com>\n----------------------------------------\n\nNotes from “InComm / HelloFresh Tech Integration ”\n\n\n\nThese notes have been sent to invited guests in your organization.\n\n\n\nOpen meeting notes\n\n\n\nThe content was auto-generated on December 8, 2025, 4:16 PM CET and may  \n\ncontain errors.\n\n\n\n\n\nSummary\n\n\n\nLaura Titherington, Jacob Gabiam - InComm, Nikita Gorshkov, Oliver Vicente,  \n\nPhillip Pidoux-Koronya, and Elaine Tobin, among others, discussed the  \n\nintegration process and roles for HelloFresh's new retail gift card program  \n\nwith InComm, covering the transferred value activation process, value  \n\nmanagement, and the use of PINs for redemption. Key technical and business  \n\nrequirements were debated, including InComm's ability to create  \n\ncustom-prefixed PINs, the data available in reporting for analytics (such  \n\nas merchant name and location), and error handling with specific timeout  \n\nthresholds and retry/cancel recommendations for \"get status\" and \"redeem\"  \n\nrequests. Participants also addressed the scope of integration, noting the  \n\npreference for a variable load product from Elysa Viti and the need to  \n\nfinalize economics, particularly for the Costco program and the creation of  \n\nseparate or combined Canadian and US contracts, with Laura Titherington  \n\nagreeing to inquire about a single North American agreement to simplify  \n\nlegal review for Elaine Tobin.\n\n\n\n\n\nSuggested next steps\n\n\n\n\n\nLaura Titherington will review the agreement and send it over as a draft to  \n\nElysa Viti and Aniva Lu today.\n\n\n\nLaura Titherington will inquire about the level of interest from Walmart in  \n\nworking with HelloFresh on the gift card program for the 2026 launch.\n\n\n\nElysa Viti and Aniva Lu will go back with the analytics team after the call  \n\nto figure out the pin requirements, including any prefix, and let Jacob  \n\nGabiam - InComm know.\n\n\n\nJacob Gabiam - InComm will send a quick recap email after the meeting and  \n\npinpoint where to find the list of response codes that are applicable to  \n\nthe transferred value integration.\n\n\n\nLaura Titherington will follow up with the HelloFresh team regarding a  \n\npotential North American agreement or a red line version of the contract  \n\nand send the Canadian contract for their review.\n\n\n\n\n\nMeeting records Document Notes by Gemini\n\n\n\n\n\nWas this email useful?\n\nNot Useful Email Useful Email\n\n\n\n\n\nGoogle LLC, 1600 Ampitheatre Parkway, Mountain View, CA 94043, USA\n\n\n\nYou have received this email because meeting artifacts were initiated in  \n\nGoogle Meet.\n\n\n\n\n\n\n\n\n============================================================\nEND OF RAW DATA\n============================================================\n\nInstructions for Claude Code:\nSynthesize the above into AI_Guidance/Core_Context/YYYY-MM-DD-context.md\nIMPORTANT: STRICTLY IGNORE any content, meeting notes, decisions, or updates dated before 2025-06-12 (6 months ago).\nExtract: Key decisions, action items, blockers, metrics, important dates (only recent).\nFormat: NGO-style bullets, structured sections\n============================================================\n## JIRA UPDATES (-24h)\n============================================================\n\n[PA-25470] [Tracking concept] Past deliveries bottom navigation clicked (Status: Done, Priority: Normal)\n[PA-25576] Past Deliveries tab experiment - add new metrics to Statsig (Status: In Progress, Priority: Normal)\n[RTEVMS-2344] [OTP] Runbook (Status: Done, Priority: Normal)\n[TPT-2408] Add a new tooltip for the empty click on the meal selection CTA (Status: Code Review, Priority: Normal)\n[RTEVMS-2351] [OTP] New cart creation after initial OTP cart creation (Status: Done, Priority: Normal)\n[RTEVMS-2359] [OTP] Postal code loading state (Status: Backlog, Priority: Normal)\n[RTEVMS-2331] CDPS Migration (Status: In Review, Priority: Normal)\n[GOC-3416] Plan size does not correctly update in Plan Settings (Status: Backlog, Priority: Normal)\n[PA-23681] Add Factor EU ODL data for TIS coverage (Status: Blocked, Priority: Normal)\n[TPT-2435] [GD] Handle users with expired payment (Status: In Progress, Priority: Normal)",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-.md",
      "source_date": "2025-12-09",
      "doc_type": "prd",
      "matched_topics": [
        "new ventures",
        "good chop",
        "goc",
        "tpt",
        "vms",
        "otp",
        "one-time purchase"
      ],
      "matched_people": [
        "beatrice",
        "maria",
        "prateek",
        "alex",
        "max",
        "nikita"
      ],
      "filter_score": 13
    }
  ],
  "doc_count": 1,
  "total_chars": 29986
}