{
  "batch_id": "meeting_079",
  "doc_type": "meeting",
  "documents": [
    {
      "title": "VMS OTP UAT - Part 2 - 2025/12/30 09:27 EST - Notes by Gemini",
      "doc_id": "1_RSbov08MhGNUh8K-4gJDW8dhb7N7bcdj9zs68G5exI",
      "link": "https://docs.google.com/document/d/1_RSbov08MhGNUh8K-4gJDW8dhb7N7bcdj9zs68G5exI/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 30, 2025\n\nVMS OTP UAT - Part 2\n\nInvited Nikita Gorshkov Emily Mendelson Michael James Clarke Hamed Karimian Edwin Torres Tavi Scandiff-Pirvu\n\nAttachments VMS OTP UAT - Part 2 UAT | One Time Purchase VMS \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nEdwin Torres reviewed previous bug findings and confirmed that high-priority issues were addressed, while also outlining the objective to re-review One-Time Purchase (OTP) scenarios and test cases, including monitoring events generated on staging. Edwin Torres and Nikita Gorshkov planned to open a support ticket with the Katana group concerning event rollout issues, and Edwin Torres, Hamed Karimian, and Michael James Clarke discussed and prioritized several bugs, including a critical issue breaking the dashboard bundles section, a shipping fee discrepancy for OTP, and a problem with price reflection when changing item frequency or quantity. Hamed Karimian confirmed that four high-priority tickets need resolution, including the contradictory price communication and the subscription discount communication, and that the Katana issue must be solved before deployment to live.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Review of Previous Findings and Prioritization Edwin Torres opened the session by reviewing bug issues and tickets created from previous findings, confirming that high, medium, and low priority issues were addressed, with emphasis on fixing high priority ones (00:00:00). The main objective of the current session is to re-review different scenarios and test cases for One-Time Purchase (OTP) (00:01:35). Edwin Torres also mentioned a way to test events generated on staging by using a platform that listens to CFKA topics, expecting to see events triggered for orders created during the session (00:00:00).\n\n* SFMC and Katana Event Rollout Issues Nikita Gorshkov inquired about responses regarding event rollouts, particularly for the first issue, which Edwin Torres confirmed had no message received, leading them to plan to open a support ticket with the Katana group in Slack. Regarding the second topic, SFMC (Salesforce), Edwin Torres reported no response from Christian and the need to find someone else to assist, with Nikita Gorshkov subsequently requesting the link to the thread and inviting Manuel (00:04:27) (00:09:07). The team confirmed a need to create another message directly to the Katana support thread, with Nikita Gorshkov suggesting to ping Pablo and Brad and keep themself as an FYI (00:05:46).\n\n* Refund and Testing Logistics Edwin Torres reported a refund issue with DM that is likely to be fixed next week due to the payments team working on an incident and capacity limitations (00:07:28). For the current testing session, Hamed Karimian and Edwin Torres agreed to test order creation on both live and staging environments to see if events are generated (00:10:58). Hamed Karimian completed a purchase on live to check for events, which Edwin Torres then checked by filtering by the customer ID (00:13:27).\n\n* Order Processing and Event Confirmation Edwin Torres explained that completing an order triggers an event on a Kafka topic related to checkout, and the goal is to confirm the event was published and received by other subscribed services like Katana and Salesforce. Edwin Torres confirmed the event for the new live order was reported three minutes ago and linked the filter used to the meeting notes (00:32:06). The next step is to confirm that Katana and other systems receive this data (00:33:20).\n\n* Shipping Fee Discrepancy for OTP Edwin Torres identified an issue with a s\n\n\n\nad here just to confirm something I got a OTP order I have the bundles here I click try now I will be able to add items as OTP orders or subscription or only subscription because the logic behind this section here on my dashboard is only affecting the subscription once. So we would need to extend that logic there.\n\nHamed Karimian: So is it possible to show the same model that we show to users to select between OTP and SNS?\n\nEdwin Torres: That's what I'm thinking that we could do\n\n \n\n \n\n01:21:00\n\n \n\nHamed Karimian: Yeah.\n\nEdwin Torres: there.\n\nHamed Karimian: Yeah, that's I think what's expected over here.\n\nEdwin Torres: Okay. Yeah. to work similarly as the credit page.\n\nHamed Karimian: Yeah, exactly.\n\nEdwin Torres: Okay. Okay. Cool. Yeah, I think this one is like a million. This requires like a a factor there. Um, other than that, I think the others are manageable. Yep. All right. So, yeah, it looks like uh we already have a the priority identify it. So what I'm what we can do next uh is to create these uh tickets to follow up quickly and put the link here and and then um yeah share with the team as long as we are progressing and getting progress on that part. So basically uh we are only with Emily. So in these days we will work with Emily on the ones that we have here. Okay. So okay by saying that it means that tomorrow we will get an update on the progress on the medium and high priority ones and on Friday we will have another update regarding to when we release and also summing up the topic for the katana issue we have. Okay. uh if if we don't solve that so we cannot uh deploy on live\n\nHamed Karimian: Amazing. Yep. Sounds good.\n\nEdwin Torres: okay\n\nHamed Karimian: Uh,\n\nNikita Gorshkov: Very\n\nEdwin Torres: good all right\n\nHamed Karimian: yeah. Seem to be all\n\nNikita Gorshkov: nice.\n\nEdwin Torres: team so yeah so yeah thank you very much for your time your patient on\n\nHamed Karimian: good.\n\nEdwin Torres: on this topic so let's let's continue so we are almost there finishing the OTP we want to release\n\nHamed Karimian: Yeah. Thank you.\n\nMichael James Clarke: Yeah,\n\nHamed Karimian: Thank the whole team.\n\nMichael James Clarke: great to have\n\nHamed Karimian: Yeah.\n\nMichael James Clarke: it.\n\n \n\n \n\nTranscription ended after 01:23:39\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-30-01.md",
      "source_date": "2025-12-30",
      "doc_type": "meeting",
      "matched_topics": [
        "vms",
        "otp",
        "one time purchase",
        "one-time purchase"
      ],
      "matched_people": [
        "hamed",
        "nikita"
      ],
      "filter_score": 6
    },
    {
      "title": "Spike - Precheckout Meal Selection FJ",
      "doc_id": "1dOkajM2aIL6beew6m49mS5OQnTyXa0CGRLKfrJemI40",
      "link": "https://docs.google.com/document/d/1dOkajM2aIL6beew6m49mS5OQnTyXa0CGRLKfrJemI40/edit?usp=drivesdk",
      "content": "﻿Last Update\n\n\tJun 25, 2024\n\n\tAuthor\n\n\t(A-Dos) Arbaaz Dossani\n\n\tReviewers / Contributors\n\n\t* Claire Wang\n\n* Paul Andrews\n\n* Jânio Cássio Leite\n\n* Nikita Gorshkov\n\n* Travis Provick\n\n* Anna Wardell (Trushkina)\n\n\tStatus\n\n\tDone\n\n\tAssociate Docs\n\n\t  Cross Brands Account Switching - User Stories & Notes\n\n\tOverview\n\n\n\n\n\nThe Mealkit Expansion and Support Squad is currently building the crossbrands passwordless signup experience for HelloFresh US customers which checkout through the Factor US signup funnel [RFC]. This experience is planned to extend for active Hellofresh US customers through an entry point. [Figma]\n\n\n\n\n\n  \n\n\n\nOpt in banner experience for Active HF US customers\n\n\n\n\n\nFor Hellofresh US customers engaging with this flow, they will be following the same experience as the crossbrands passwordless signup experience using a magic link. Before engaging with the magic link, the users will be redirected to the new Factor signup funnel where they would initially select meals, which will be later patched when subscription is created. The timeline for this initiative is late Q3 2024.\n\n\n\n  \n\n\n\nProposed User Flow\n\n\n\n\n\n  \n\n[a][b]\n\nPrecheckout meal selection for Factor US\n\n\n\n\n\nTechnical Solution\n\n\n\n\n\nNote: [c][d]\n\n1. In case the Hellofresh US customer is already a deactivated Factor US Customer, they should be routed to the Reactivations page.\n\n2. In case the Hellofresh US customer is already logged in on Factor US, they should be routed to the Factor My Deliveries page.\n\nThe solution can be implemented in multiple domains depending on the requirements and timelines:\n\n1. Backend-based Solution (Not recommended)[e][f]\n\nThere are two options available:\n\n   1. Customer Recurring Selection Service (CRS) \n\nSquad:  #nv-backend (NVB)  PoC (Ahmed WagdiMorteza Pourkazemi)\n\nThe NVB team implemented changes for the precheckout meal selection functionality supporting Goodchop brand earlier this year (H1 2024). The functionality in itself can be used for all brands for precheckout meal selection. The caveat here is that Goodchop uses static menu every week and therefore the then solution built was enmeshed with precheckout meal selection and recurring selection service, essentially preserving users precheckout meal selection to the current as well as future weeks of their subscription.\n\nThe details of the initiatives can be found here: \n\n      1. Epic\n\n      2. RFC ticket\n\n                Pros:\n\n                The solution is readily available with an existing brand and can be extended for Factor US customers[g][h][i]\n\n                \n\nCons:\n\nThe solution built by NVB team is temporary with the above mentioned caveat and will be sunsetted in favor of yearly planning agreement with Cart Foundation Squad (#​​squad-cart-foundation)\n\n\n\nEffort Estimate: ~1 sprint 1 FTE (including Progress Bar changes)\n\nNote: This is a very rough guesstimate as NVB effort estimate is unknown yet. We can assume medium for now.  I will check with their team (Our guess is that until NVB can prioritize and finish the work, option 1b will be already available, so this temporary solution will become obsolete)\n\nSo, we choose the higher end of the estimation\n\n                \n\n      2. Cart Foundation Squad\n\nSquad: #​​squad-cart-foundation PoC (Tales PaduaLaura Mneimneh)\n\nThe Cart foundation squad had agreed as a part of yearly planning to provide an endpoint for the New Ventures team that would replace the requirement of CRS and could be extended to multiple brands. \n\nThe details of the agreement can be found here:\n\n         1. YP agreement (Row 37/ FOO-T-35)\n\nPros:\n\nUse a solution bu\n\n\n\nonly choose from public menu\n\n[j]are there any workarounds for this endpoint, or are we blocked until it becomes available?\n\n[k]Yes, we are blocked until this endpoint becomes available or CRS is updated to handle multiple countries and CRS is disintegrated as precehckout meal selection and recurring meal selection for Goodchop\n\n[l]Does the current solution account for the filterDeliveryMoments/firstDeliveryDate RCS setting that is commonly used on Factor US for demand steering?\n\n[m]We haven't accounted for this. Do you foresee any potential issues?\n\n[n]Since new Factor users can have their first order in a number of future weeks, you need to allow them to make preselections that are in the menu for their first order.  And then if they change their first delivery week before check out, they would invalidate their selections.  So, this challenge isn't exclusive to demand steering.\n\n1 total reaction\n\nWanderley Teixeira reacted with ➕ at 2024-09-11 18:58 PM\n\n[o]Why did the GoC team move away from this solution to use CRS?\n\n[p]Added the reason as a con for the solution\n\n[q]Would the idea be to duplicate the existing GoodChop solution or to  simply modify existing implementation?\n\n\n\n\n\nIs the solution responsive? Will we be replacing the Single Question Flow with this pre-checkout meal selection flow too?\n\n[r]The FJ solution can reuse majority of the existing Goodchop solution.\n\n\n\n\n\nThere should be no change to the single question flow as the precheckout meal selection is followed by Select Plan followed by magic link signup in the Progress Bar\n\n\n\n\n\n@claire.wang@hellofresh.com correct me if otherwise\n\n[s]Would we need to at least update the header/progress bar? I don't recall if the progress bar in SingleQuestionFlow is the same as the one in web\n\n[t]This estimate includes creating a new meal selection page for the checkout flow ONLY if they are customer redirected from HF? Seems like this would add to a total time estimate > 1.5 sprints, imo (not by much, but probably a touch more than what is listed here)\n\n[u]Or maybe includes repurposing GoodChop's solution for all brands? Feels like it still might be a bit more than 1.5 sprints but we'll see once a dev takes a closer investigation into building tickets\n\n[v]The frontend precheckout meal selection will be repurposing the Goodchop frontend solution. \n\n\n\n\n\nDo you still see more effort estimate than what is listed?",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-.md",
      "source_date": "2025-12-09",
      "doc_type": "meeting",
      "matched_topics": [
        "new ventures",
        "goodchop",
        "goc"
      ],
      "matched_people": [
        "ahmed",
        "nikita"
      ],
      "filter_score": 5
    },
    {
      "title": "Q1 Planning Workshop - 2025/12/04 14:56 CET - Notes by Gemini",
      "doc_id": "1EJgKVu-I_U2nEGbP4YHR8fzgDm5Kh5R6decxN6Jda_M",
      "link": "https://docs.google.com/document/d/1EJgKVu-I_U2nEGbP4YHR8fzgDm5Kh5R6decxN6Jda_M/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 4, 2025\n\nQ1 Planning Workshop\n\nInvited Evan Weintraub Holger Hammel Annie Meininghaus Adam Ghanem Daniel Arias Gabriel Range Leo Lee Mert Bozdag Nikita Gorshkov Remy Aldasoro Sergei Kuzmenko Stefano Palazzo Travis Provick Marc Amey Patil Shishir Mishra Awn Ali Jama Musse Jenna O'Shea Marlene Rosner Edward Day Fernando Luiz Valente de Souza Wellney Yarra Luiz Cavalcanti\n\nAttachments Q1 Planning Workshop \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nThe session, attended by Travis Provick, Nikita Gorshkov, Sergei Kuzmenko, Leo Lee, Evan, Hoga, Talis, Adam, Mark, Tommaso, Fiona, and Tessa, focused on a bottom-up planning exercise for the tribe to prioritize initiatives, flag risks, and identify cross-team support needs, utilizing an interactive color-coded sheet to assess priority and confidence levels for Q1 deliverables. Key discussions involved the shift to React Native, Appio deprecation, the high priority of multi-region readiness for Project 500, and the need to prioritize Snowplow implementation for personalization signals, which currently lacks ownership despite being a blocker for meta backlog items. Critical items requiring further scoping and dependency management include the scalable food profile architecture and a long-term solution for the seamless downgrade issue, which is the highest priority for the merchandising team.\n\n\n\n\n\nDetails\n\nNotes Length: Long\n\n* Initial check-in and process overview: Travis Provick mentioned that \"the keys are good,\" followed by greetings from Nikita Gorshkov, Sergei Kuzmenko, and someone in BER - R16-L0-Parterre (Berlin Campus - Ritterstraße, L0). Someone in BER - R16-L0-Parterre (Berlin Campus - Ritterstraße, L0) noted that a participant was previously on a different Zoom link (00:00:00). Someone in BER - R16-L0-Parterre (Berlin Campus - Ritterstraße, L0) ensured everyone could hear well, receiving confirmation from Nikita Gorshkov. Someone in BER - R16-L0-Parterre (Berlin Campus - Ritterstraße, L0) addressed Leo Lee regarding covering material, possibly for foundations, as Fernando was absent, and mentioned having a plan for customer service, to which Leo Lee confirmed having things ready with a slight exception concerning personalization, which they could discuss later. Someone in BER - R16-L0-Parterre (Berlin Campus - Ritterstraße, L0) clarified that the session was part of a new process, previously discussed in a leadership meeting, and the goal was to \"figure things out together,\" \"try it,\" \"do it,\" and then \"learn from it, improve it next time\" (00:00:00). Someone in BER - R16-L0-Parterre (Berlin Campus - Ritterstraße, L0) asked if everyone had reviewed the agenda, suggesting that if not, they should take five minutes to review it to ensure clarity on the main goals for the day. The agenda was posted in the LT channel and re-posted by Evan. Someone in BER - R16-L0-Parterre (Berlin Campus - Ritterstraße, L0) expressed confidence in achieving nice outcomes and working towards a committed plan, noting that participants had mostly worked within the squads previously (00:04:45).\n\n* Bottom-up planning and expectations at the tribe level: someone in BER - R16-L0-Parterre (Berlin Campus - Ritterstraße, L0) explained that the session was a \"bottom up planning exercise\" being lifted to the tribe level. Someone in BER - R16-L0-Parterre (Berlin Campus - Ritterstraße, L0) emphasized that at this higher level, it is expected \"that we're not discuss any minuscule thing,\" urging participants to apply their judgment on what is valuable for the group to discuss. The objectives include understa\n\n\n\ny, we said the goal was to have something we could share with us tomorrow. Are we still aiming for that? So, we don't have to share tomorrow because he's going to be on a plane. Yeah. But we'll share the weekend. Exactly. Um the plan was to share something. Um when do we have the Hello Tech uh the essential functions meeting on Tuesday?\n\n \n\n \n\n03:31:10\n\n \n\nBER - R16-L0-Parterre (Berlin Campus - Ritterstraße, L0): So my understanding is right now we have until Tuesday and the main deliverable at this point would be the um updated version of the yearly plan that Leo just referenced. So what are the top things that we used that we highlighted and then what are the top things that have now changed based on the exercises that we did bottom up. We still have this disclaimer that this is a bit of an exotic quarter because remember normally we would have started with the meta backlog. So we have to figure out how we now sync the top down and the bottom up planning. But since we have on raph and some of the items uh already uh discussed within I don't expect any large changes or surprises from the final sign off of the meta back and um for this updated version of the table of top deliverables is still going to be quarterly granularity or are we going to do monthly like we previously talked about?\n\n \n\n \n\n03:32:14\n\n \n\nBER - R16-L0-Parterre (Berlin Campus - Ritterstraße, L0): I don't know Hogan you went that session I wasn't there I was on vacation. Uh I I think I I understood monthsly. That's what we had been saying. So if that's the case, maybe just after this we can we can create a template because the granularity was a little bit all over the place from team to team. I didn't say anything to people because I wanted to wait for this. Yeah, let's agree maybe on what the looks like and then we'll share that. Yeah. Yeah. Okay. Great. Then thanks for everybody. Thank you. Three and a half hours. Well done. And uh we almost have the plan. Let's pull it together and we'll share the template in the instructions. Thanks for figuring it out. Bye. One thing that this exercise doesn't show us is how confident you are about the KTLO assumptions of each team. You have to somehow do that. So really Mhm. Yeah.\n\n \n\n \n\nTranscription ended after 03:34:07\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-.md",
      "source_date": "2025-12-05",
      "doc_type": "meeting",
      "matched_topics": [],
      "matched_people": [
        "jama",
        "yarra",
        "daniel",
        "nikita"
      ],
      "filter_score": 4
    }
  ],
  "doc_count": 3,
  "total_chars": 18012
}