{
  "batch_id": "prd_017",
  "doc_type": "prd",
  "documents": [
    {
      "title": "Memo: TPT Sign-up Page Revamp",
      "doc_id": "1VOx0gTwY6uxc3WsFBI8AqjEbWeTM6n_xZWEBese9oK4",
      "link": "https://docs.google.com/document/d/1VOx0gTwY6uxc3WsFBI8AqjEbWeTM6n_xZWEBese9oK4/edit?usp=drivesdk",
      "content": "﻿Memo: Signup Page drop off rates\n\nData reveals (chart below) that the registration page on ThePetsTable adds little friction to the customer journey to the address page. In 2025, the total “Visited Address” (12.25%) sessions is higher than “Visited Registration” (11.62%) sessions for PetsTable, this is in sharp contrast to the HelloFresh sessions data, where over 45% users are lost from registration to address page. The sessions drop off in PetsTable is significantly lower because of three reasons:\n\n\n\n\n\n1. The registration page is skipped entirely for customers who logged in a previous session, and are redirected to the checkout page directly by the site cookies. HelloFresh also has the same behavior but in the case of PetsTable, the customer is completing registration often and also coming back more often to a previously logged in session. \n\n\n\n\n\n2. The higher registration completion rate can also be attributed to high intent and cognitive investment of the customer, who before reaching the registration page has completed 9 steps of the quiz (which sometimes needs research - pup weight, dietary preference, allergies, goals) and selected the plan & recipe selection. The % session for HelloFresh, ThePetsTable and GoodChop remain the same to the Address page. \n\n\n\n\n\n3. Plus, increasing propensity to make more premium & health conscious choices for their pets over themselves, drives higher intent in completion of the PetsTable account registration, than that of HelloFresh. \n\n\n\n\n\nGiven that the registration step isn’t resulting in customer drop offs, the removal of the page is not likely to increase conversions. The registration page is in fact necessary[a][b][c][d] to verify whether a prospect already has an account, which helps in redirecting existing users to the reactivation page (and adjusting applicable discounts), and prevents them from redundantly navigating the entire signup funnel. After enabling email autopopulation on the registration page from WKND cookie, the friction on this page has declined further. Therefore, we advocate to keep the registration page, make minimal functional changes and improve the sign up CTA to increase the customer intent further to complete checkout.\n\n\n\n\n\nThe Pets Table (More sessions to Address page than the Registration page):\n\n  \n\n\n\n\n\n\n\nHello Fresh (Over 55% customers drop from Registration page to Address page):\n\n  \n\n\n\n\n\n\n\n  Current Experience:\n\nNote that the funnel data above captures conversions from the registration page before we started auto populating the customer email from the WKND cookie (link). In majority of the cases, customers will now see the email populated and are directly prompted to enter a password, which should be a delightful customer experience. \n\n\n\n\n\nGiven that we do not have any password rules or checks currently on the page, customers can set any password and can navigate to the address page. HelloFresh data also shows that only 3.4% users abandon[e] (link) the registration process without submitting a password after providing their email address. \n\n\n\n\n\nHowever, we can optimize this page UI to move away from a transactional tone to an emotional tone to further improve customer intent to complete the checkout. [f]\n\n\n\n\n\nWe should also note immediate 2 weeks conversions [g]post the improvements from WKND cookies for any adverse customer experiences. \n\n\t  \n\n\n\n\tSign up page Improvements:\n\nVision\n\nWhile not a major source of customer drop off, we still have the opportunity to improve the login experience for the first time visitors on the website to move them quickly through the\n\n\n\nbmitting a password after providing their email address. Therefore, the password itself is not a friction point but providing another way to login could help conversions. \n\n\n\n\n\nThough an innovative way to login may not result in a similar increase in conversions from older customer base, who are more accustomed to login/password UX, and are already comfortable completing registrations on the PetsTable.   \n\n\tP1 \n\n\n\n\n\nImpact: Medium\n\nEffort: 8 pts\n\n\n\n\n\n\tUse social logins\n\n\tProvide customers with social login options like  Apple, Google & Facebook to improve registration completion and improve conversions\n\n\tIn HelloFresh, adding social logins (statsig) increased the conversion rate by 2.66%. However, we hypothesize social logins will not have much impact on registration completion rate in the PetsTable (& thus conversions) as our customer demographics is much older (>50% customers are 50+ years old), who are less likely to use social logins.\n\n\tP2\n\n\n\n\n\nImpact: Low\n\nEffort: 8 pts\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Question: Do we remove the Add-ons promotions CTA?\n\nRationale for keeping the Add-ons banner:\n\n1. Two experiments that tested adding a seasonal promotional banner on the Sign up page resulted (in a similar location as the Add-ons promotional banner) in positive improvements in CVR. \n\n2. Customers hear about the Add-ons product for the first time in the sign up page and create intent to buy add-ons during checkout. \n\nRationale for removing Add-ons banner:\n\n1. Test moving one of the below the fold element (Social proof, product stat) on the banner location to further increase customer intent on checkout. \n\n\n\n\n\nGiven that we already prioritized an initiative (improve sign up CTA) to improve content and don't have experimental bandwidth, we recommend to keep the add-ons banner. \n\n\n\n\n\n\n\n\n\n  \n\n\n\n[a]OK, what's not clear for me - what's the customer problem; basically, reading this, my POV would be - why touch this at all? I am certain we have bigger fish to fry and the improvement that we caen get from here doesn't seem to be worth the investment even on a discovery level; no?\n\n[b]Yes … The CTA would have customer attention and we can optimize it and we can do some correct representation of reviews but the page is good as is.\n\n[c]_Marked as resolved_\n\n[d]_Re-opened_\n\n[e]~30% according to GA\n\n[f]but should we? Based on the data above?\n\n[g]not clear what do you mea by this?",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-30-.md",
      "source_date": "2025-12-30",
      "doc_type": "prd",
      "matched_topics": [
        "goodchop",
        "the pets table",
        "pets table",
        "tpt"
      ],
      "matched_people": [],
      "filter_score": 4
    },
    {
      "title": "PRD: Cancellation Funnel Unification",
      "doc_id": "17kjxcXQOQH18-31bc_lz6JR9vEsxmUUIcWwh75Easmw",
      "link": "https://docs.google.com/document/d/17kjxcXQOQH18-31bc_lz6JR9vEsxmUUIcWwh75Easmw/edit?usp=drivesdk",
      "content": "﻿PRD\n\nProduct Requirements Document (PRD): Cancellation Funnel Unification\n\n1. Overview & Purpose\n\nThis PRD outlines the requirements for unifying the cancellation funnels across all HelloFresh Group brands. The primary goal is to leverage the existing HelloFresh cancellation funnel, including its deflection strategies and cancellation survey, and apply it to the remaining RTE, meal kit and new venture brands. This initiative aims to standardize the cancellation experience, improve customer retention for Factor and other brands, and streamline operational and technical maintenance. Depending on the engineering complexity, we consider two possible rollout scenarios:\n\n1. [preferred] A/B test for all brands excl. Hellofresh, with control = BAU and variation = complete unified funnel. Alternatively, the test can target Factor US customers only.\n\n2. Roll out without an A/B test, with the pre-post performance analysis\n\nDecision about the prioritised rollout scenario will be taken by Karolina Zak/Edward Day once the effort estimation is known.\n\n2. Goals & Non-Goals\n\nGoals:\n\n1. Use Hellofresh Cancellation Funnel UX in the remaining brands: Replicate the proven HelloFresh cancellation flow UX, including deflections and feedback collection, onto the other brands (all meal-kit, all RTE, The PetsTable, GoodChop, Factor Form, ?Factor Programs?[a][b][c][d]).\n\n   1. !! This requirement does not mean using Hellofresh funnel code across brands. The initial engineering proposal is to create a new cancellation funnel module and move the Hellofresh flow pieces into this new cross-brand funnel. Once this is setup we can migrate the funnels to use this new app\n\n2. Easy handling of all funnel variations: all the existing cancellation funnel variations (BAU flow, one-step funnel, one-click funnel, French adjusted funnel) need to be handled in a scalable way and allow reusing existing flows in other brands and markets\n\n3. Standardize Cancellation Surveys: Implement the HelloFresh cancellation survey framework for other brands to gather consistent customer feedback on reasons for cancellation.\n\n4. Unify Deflection Strategies: Make all existing deflection mechanisms available for use (not necessarily enabled) in all other brands cancellation funnels, including:\n\n   1. Special deflections offered in a dedicated page sections:\n\n      1. Benefits of keeping the subscription active (available discounts & credits, loyalty program status) → do not show if a customer doesn’t have a discount nor credit nor loyalty program status\n\n      2. Switch to other brand (offered post cancellation) → Removed from the initiative scope. Remember to keep it live for Hellofresh brand.\n\n   2. Regular deflections offered in small modular boxes:\n\n      1. Offer new discount - Emmanuelle Hazeauxto clarify the ownership of the voucher creation for all brands and markets → changed from special deflection to the regular module - needs small design change\n\n      2. Change plan frequency → links to the second step of the deflection, where customers can select alternative plan frequency\n\n      3. Change plan size → there’s no price information, it has one of the lowest deflection rates. Therefore in the new funnel we want to send customers directly to the subscription settings page (!different links for different brands: HF /account-settings/subscription-settings, Factor /settings/plan/plan-selection)\n\n      4. Help me skip → change to “Skip instead of cancel”, redirect to the homepage/single week page with a simple onboarding about using “Edit delivery” feature (only if skipping CTA is hidden\n\n\n\nl not support having an active RTE subscription without an active meal kit subscription so for launch we added an \"orchestration layer\" that cancels the RTE subscription when the meal kit subscription is cancelled\n\n[p]@nikita.gorshkov@hellofresh.com @kza@hellofresh.com It's not clear to me what consequences this project has for analytics - are cancellation metrics and GA events already aligned cross-brand or would we have to shake up our events and reporting as part of this push?\n\n\n\n\n\nHow about dashboarding?\n\n[q]+ revisit the cancellation dashboard\n\n[r]I think this needs to be investigated a bit further, but general cancellation metrics should be unified overal (at least looking at Tableau as the SoT here). Of course, cancellation reason-level reporting is different.\n\n[s]what about Voice of customer team, should we we consider them as dependencies as they are the primary users of the cancellation survey results, maybe we need to check how it would impact them\n\n1 total reaction\n\nJuan Sebastian Hernandez reacted with 🙏 at 2025-09-05 15:25 PM\n\n[t]Who would be your primary contact for this team?\n\n[u]@juan.hernandez@hellofresh.com\n\n[v]@kza@hellofresh.com my read from this is that we don't make any changes to the BAU survey experience for any brand/market other than maybe the UI - am I right in this?\n\n[w]Hey team, hope you're doing well and thanks for flagging @ehaz@hellofresh.co. I assume that from our end there is no big change as we only send the comments to Chattermill. Not sure if this would affect more the existing categories in Cancellation data sets, so I'll add @winnie.huang@hellofresh.com to the conversation\n\n[x]Q on my side - how do we ensure market level compliance?\n\n[y]what do you mean by compliance? Compliance to regulations?\n\n[z]Yes cancellation tends to be regulated at a local level.\n\n\n\n\n\nOn top of legal compliance, I wonder if there are non-legal decisions we've taken at a local level that we also should look to preserve\n\n[aa]Q2: Governance - the ability to change survey & deflections by brand/market will only be available to the owning _technical_ team right? We have no requirements to enable other stakeholders to modify this?\n\n[ab]If so, it means owning tech team owns final decision on local setups (with local input) due to balancing capacity\n\n[ac]i don't know why i imagined green chef being also sustainable so i'm curious why is not there today",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-15-.md",
      "source_date": "2025-12-15",
      "doc_type": "prd",
      "matched_topics": [
        "goodchop",
        "factor form"
      ],
      "matched_people": [
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "Maria:Nikita 1:1 - 2025/12/16 17:59 CET - Notes by Gemini",
      "doc_id": "1XYIBY2fKZdSqpoWTCzM3Of8LPxoiayIBlJrLvx7y0IQ",
      "link": "https://docs.google.com/document/d/1XYIBY2fKZdSqpoWTCzM3Of8LPxoiayIBlJrLvx7y0IQ/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 16, 2025\n\nMaria:Nikita 1:1\n\nInvited Maria Chelminska Nikita Gorshkov\n\nAttachments Maria:Nikita 1:1 \n\n\n\n\n\nSummary\n\nNikita Gorshkov and Maria Chelminska discussed the ownership of the CVR program, with Nikita Gorshkov clarifying it should be a time-boxed initiative focusing on discovery and funnel improvement, and Maria Chelminska agreeing to own the program. Maria Chelminska provided updates on blocked initiatives, including the charger checkout being held up by refund issues and the reactivation page delay due to a multi-subscription issue with the new pricing endpoint, which Nikita Gorshkov approved temporarily reverting to the old endpoint to secure value before the holidays. They also discussed contractor-related delays on initiatives like PDPs, with Maria Chelminska reporting contractors' \"sloppy\" adherence to requirements, and Nikita Gorshkov proposing a review of the cut scope and the cost to complete that work.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Ownership of the CVR Program Nikita Gorshkov clarified that the CVR program should be packaged as a time-boxed initiative focusing on discovery and a clean sweep of the funnel, including banner placements and communication reinforcements. Maria Chelminska expressed concern that the CVR program might evolve into a recurring analysis and reporting function, which Nikita Gorshkov dismissed by stating that those responsibilities belong to Doas and their team. Nikita Gorshkov emphasized that their ownership should focus on the customer experience from the moment they land on the page.\n\n* Assignment of New Initiative Nikita Gorshkov is looking to assign a substantial topic for someone to own and onboard, ideally by Friday's meeting with Lauron. Maria Chelminska confirmed their willingness to take on the CVR program, though they initially thought the individual might be too busy with the app work. Nikita Gorshkov countered that the app work is focused on determining technical specifications like web view, React Native, and the cost of building notifications, suggesting it might not be as demanding as Maria Chelminska anticipated.\n\n* Status of Ongoing Initiatives and Blockers Maria Chelminska provided an update on several initiatives that are nearly ready for launch but are currently blocked. The charger checkout is blocked due to issues with refunds, which Nikita Gorshkov is aware of and plans to address in a separate meeting. Maria Chelminska noted that Ahmed will be out of office starting tomorrow and unable to attend that meeting.\n\n* Reactivation Page Delay and Multi-Subscription Issue The reactivation page has been ready for two weeks but is blocked by an issue with the new pricing endpoint where vouchers are incorrectly flagged as fraudulent for multi-subscription users. Maria Chelminska explained that to launch the page before the holidays, they plan to temporarily revert to the old pricing endpoint, which creates future overhead work. Nikita Gorshkov agreed to proceed with the temporary migration to secure value from reactivations and committed to working with Java to enforce a rule that multi-subscriptions must always be supported in new service development.\n\n* Contractor Initiative Delays and Scope Management Maria Chelminska reported that contractors have been \"sloppy\" in following requirements for initiatives like PDPs and different portion percentages, leading to delays and the likely launch being pushed to week two or week three of Q1. Guhan is now working with the contractors to manage inconsistencies, and additional team resources will be allocated. Maria Chelminska noted that a learning from this is that contractors easily underestimate the complexity of work, especially with complex initiatives impacting the funnel and active experience.\n\n* Scope of Work and Future Planning Maria Chelminska acknowledged that sticking to a scope-based pricing model, rather than time and materials, was beneficial despite the expanded timeline. Nikita Gorshkov suggested reviewing what scope was cut from the contractors' deliverables, the cost of completing that work, and how to space out delivery of the initiatives that were removed, such as one-click add-ons and updating pet profiles. Nikita Gorshkov is considering incorporating improvements to quick actions into the app scope, using React Native to ensure speed and potentially pushing them to the main site.\n\n* Team Impact and Communication Plan Maria Chelminska noted that the delays have taken a toll on the team and suggested leveraging Maria, who is starting in January, to help deliver the remaining initiatives and address overhead work that will go into Q1. Maria Chelminska plans to share news with the team tomorrow about potential delays into the first sprint of the year. Nikita Gorshkov requested that Maria Chelminska draft a high-level message before sharing the update to manage expectations.\n\n\n\n\n\nSuggested next steps\n\n* Maria Chelminska will send the thread about the issue with multi-bat users and vouchers not being applied correctly to Nikita Gorshkov.\n\n* Nikita Gorshkov will work with Java to establish a rule that multi-subscriptions are always part of the deal when developing new services within the shopping platform space.\n\n\n\n\n\nYou should review Gemini's notes to make sure they're accurate. Get tips and learn how Gemini takes notes\n\nPlease provide feedback about using Gemini to take notes in a short survey.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-17-.md",
      "source_date": "2025-12-17",
      "doc_type": "prd",
      "matched_topics": [],
      "matched_people": [
        "maria",
        "ahmed",
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "InComm / HelloFresh Tech Integration  - 2025/12/08 09:27 EST - Notes by Gemini",
      "doc_id": "1rRmGsbWAGQO0FkOpzSbKUngrJdhuwlKvfRyl4f_1Zto",
      "link": "https://docs.google.com/document/d/1rRmGsbWAGQO0FkOpzSbKUngrJdhuwlKvfRyl4f_1Zto/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 8, 2025\n\nInComm / HelloFresh Tech Integration \n\nInvited Laura Titherington Taylor Phelan April Dunham Elysa Viti pmccabe@incomm.com Nikita Gorshkov solutionsconsulting@incomm.com ovicente@incomm.com Scott Silver Amy Alpert Elaine Tobin Aniva Lu Phillip Pidoux-Koronya Jacob Gabiam\n\nAttachments InComm / HelloFresh Tech Integration  \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nLaura Titherington, Jacob Gabiam - InComm, Nikita Gorshkov, Oliver Vicente, Phillip Pidoux-Koronya, and Elaine Tobin, among others, discussed the integration process and roles for HelloFresh’s new retail gift card program with InComm, covering the transferred value activation process, value management, and the use of PINs for redemption. Key technical and business requirements were debated, including InComm's ability to create custom-prefixed PINs, the data available in reporting for analytics (such as merchant name and location), and error handling with specific timeout thresholds and retry/cancel recommendations for \"get status\" and \"redeem\" requests. Participants also addressed the scope of integration, noting the preference for a variable load product from Elysa Viti and the need to finalize economics, particularly for the Costco program and the creation of separate or combined Canadian and US contracts, with Laura Titherington agreeing to inquire about a single North American agreement to simplify legal review for Elaine Tobin.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Meeting Setup and Introductions Laura Titherington addressed initial technical issues with Jacob Gabiam - InComm's audio connection (00:00:00). After resolving the audio problem, Laura Titherington stated that the purpose of the call was to discuss the transferred value integration and introduced Jacob Gabiam - InComm, who would answer questions, and Nikita Gorshkov, who would lead the discussion (00:01:25). A round of introductions followed, with attendees including Nikita Gorshkov (leading new ventures at HelloFresh) (00:02:29), Jacob Gabiam - InComm (Solutions Consultant at InComm) (00:03:29), Laura Titherington (Business Development for InComm Canada) (00:02:29), Oliver Vicente (Lead Channel Manager at InComm), Phillip Pidoux-Koronya (Director of Account Management at InComm Canada) (00:03:29), and Elaine Tobin (running gift cards and flyers for HelloFresh US/Factor) (00:04:36).\n\n* Integration Process and Roles Jacob Gabiam - InComm outlined the steps for the integration, explaining that they would gather requirements and then send them out for PM assignment, with Oliver Vicente providing additional support until a Project Manager is assigned (00:03:29). Phillip Pidoux-Koronya clarified that their team will manage the relationship with HelloFresh, launch the product, and manage the program going forward after Laura Titherington hands off the contract. Elaine Tobin noted that HelloFresh is working as a North America unit to scope out and onboard with InComm for a new retail gift card program (00:04:36).\n\n* Transferred Value Gift Card Activation Jacob Gabiam - InComm described the transferred value process for physical gift cards, where HelloFresh is not involved in the initial activation (00:05:38). The process involves the retailer scanning the IAB barcode, which InComm uses to mark the card as active for the requested amount. The consumer then uses the PIN on the back of the card to send a request to InComm via HelloFresh to validate the PIN and purchase; upon success, HelloFresh sends a redemption request, transferring the value. Nikita Gorshkov confirmed that the verification h\n\n\n\nthough um and see see what they if there's an opportunity to do a North American agreement for this. I I'm just not hopeful because they it hasn't been done in the past.\n\n \n\n \n\n00:41:01\n\n \n\nElysa Viti: Okay. Like we're okay to have two different so it just like the main portion of the MSA usually is the same for both North um both countries.\n\nLaura Titherington: Totally understand. Not typically how we do it. I will I will ask the question though.\n\nElysa Viti: Okay. Yeah. See if what your team can do. If not, like you said, if there was a red line version, you guys can provide. We just don't want that much. We don't want to create too much work for a procurement team, unnecessary extra work. Uh, and we don't want the US to have to launch a lot later than Canada.\n\nLaura Titherington: Yeah.\n\nElysa Viti: We'd like to launch like similar timelines.\n\nElaine Tobin: Yeah.\n\nLaura Titherington: Yeah, understood. So, let me take that back. Um, let me take that back. I I don't have an answer right now because I have to ask\n\nElysa Viti: Okay. All right.\n\nElaine Tobin: Yeah, I think the other thing of note is like given this request is going in after December 1st, I know our legal team isn't even going to like be able to review and finalize anything until like January. I think anything that we need signed off and reviewed the end of year was due a week ago. So like that's already setting our team back. If that means like Canada won't get finalized until sometime in January, then how long will it take for us, you know? So I think in terms of us like getting business case resourcing like US is just a much higher spend market. So we kind of need to be running in tandem for things to move on the Canadian side.\n\nLaura Titherington: No problem. Let me see what we can do on our side.\n\nElaine Tobin: Okay.\n\nLaura Titherington: All right.\n\nElysa Viti: Okay, we'll wait for the contract from you, Laura, and then if we have any questions.\n\nLaura Titherington: Good. Yeah. So, I may hold on that until I get the answer of because there's no point in sending and unless, you know, because right now it as it stands, it's just a Canadian contract.\n\nElysa Viti: Yeah. Yeah. Okay, great. Awesome.\n\nElaine Tobin: Thank you.\n\n \n\n \n\nTranscription ended after 00:43:13\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-08-02.md",
      "source_date": "2025-12-08",
      "doc_type": "prd",
      "matched_topics": [
        "new ventures"
      ],
      "matched_people": [
        "nikita"
      ],
      "filter_score": 2
    },
    {
      "title": "PRD: (🥇MVP) Cross-Selling as Market Integration; Recurring Multi-Subscription (v1.0)",
      "doc_id": "169IIJfqd6Rk0KO9QvOQqcSrJrCoA4GQndOrX00s_y0k",
      "link": "https://docs.google.com/document/d/169IIJfqd6Rk0KO9QvOQqcSrJrCoA4GQndOrX00s_y0k/edit?usp=drivesdk",
      "content": "﻿👋 1) Start Here [Read-me]\n\n        \n\nBRD: (🥇MVP) Cross-Selling as Market Integration; Recurring Multi-Subscription (1.0)\n\n\tSummary: An outline of requirements for the creation of the Cross-Selling as Market Integration MVP.\n\n\tCreated At: Jan 1, 2025\n\n\tLast Updated: (See individual tabs)\n\n\t\n\n\n\n\tEditor(s): Leo LeeNikita Gorshkov\n\n\tInitial WBD: Cross-Selling: Enable HF US customers to purchase single order(s) or recurring Factor meals through a “Market Integration” experience\n\n\tPurpose\n\nThe purpose of the document is to provide teams across HelloFresh responsible for the delivery of the Cross-Selling as Market Integration experience (Top-5 Company Strategy #5) in 2025: Serve more household meal moments with a customer-centric, integrated RTE & Meal Kit offering that increases Average Order Rate (AOR) at reduced Customer Acquisition Costs (CACs) with a clear set of requirements for the MVP launch. \n\nRecap\n\nAs of W1-2025, the HelloFresh US Physical Product team has begun testing the inclusion of Ready Made Meals on the HF-US Core Menu. These meals are supplied by a third-party vendor and shipped as part of the same standard HelloFresh meal-kit box. However, our team’s objective is to continue experimenting with cross-selling strategies and explore alternate models to ultimately gather enough insights in 2025 to provide a recommendation for 2026 peak and beyond. We are referring to this strategy as “Market Integration,” which specifically involves utilizing Factor-produced RTE (Ready-to-Eat) meals as our physical product offering.\n\n\n\n\n\nTarget Market: HelloFresh US 🇺🇸\n\nMarket Integration 2025 High Level Milestone\n\n1. [MVP Release] Opt-in model via a secondary, recurring RTE subscription; Multi-subscription set-up.\n\nFuture Roadmap 2026+\n\n2. Refactor experience onto new Actives Journey revamp - Migrate  MVP experience in Native onto the new AJ flows in React Native.\n\n3. Iterative Improvements - On-going refinement and enhancement of our cross-selling experience. TBD product scope.\n\nGoals\n\n* Provide all teams involved in execution with a complete set of MVP requirements for delivery\n\n* Reduce ambiguity around dependencies and scope of work across teams\n\n* Drive alignment on the MVP experience for launch\n\n* Reduce project complexity to empower teams to execute\n\nNon-Goals\n\n* Provide overviews or recommendations for post-MVP interactions or launch\n\n* Provide operational execution details or requirements\n\n* Open items for debate or further discussions outside of existing product discovery workstreams\n\nDocument Navigation\n\nThis particular document  covers our MVP release scope Opt-in model via a secondary, recurring RTE subscription \n\n* MVP Scope Overview tab will provide key context on the core MVP deliverable\n\n* The rest of the Document Tabs will dive into specific key domain areas of focus\n\n\n\n\n\n🚀 2) MVP Scope Overview\n\n,Status: Review\n\nLast Updated: Jan 27, 2025\n\n\n\n\n\nOverview\n\n\n\nTarget Market: HelloFresh US 🇺🇸\n\nTarget Timeline: August 2025\n\nAdditional Details also in: 🎢Roll-Out Strategy\n\nEngineering Estimations = Cross-Selling V1 - Engineering Effort Breakdown\n\n________________\n\n\n\n\n\nTable of Contents\n\nTop-level Experience Principles\n\nUX Overview\n\nMarket Integration Versions; High-Level Differences\n\nFAQs\n\nOther Related Artifacts\n\n\n\n\n\nTop-level Experience Principles\n\n\n\n\n\n\n\n\n\n\tHigh Level Experience\n\n\tDescription\n\n\tDecision Log\n\n\tReviewers (CS9+)\n\n\tCore Technology\n\n\tEmploy multi-subscription technology to unlock an initial Opt-out and Opt-in(lower commitment; future default skipped) model.\n\n\tCustomers will have up to two separate subscriptions on He\n\n\n\na.misola@hellofresh.ca does the word Receipt IMPLY it's a confirmed transaction? I wonder if we need to use some other language\n\n[fl]Haha, i just had a curiosity because i know the business, but yes, maybe we just need a better content instead of receipt, like \"Order summary\" or something like that.\n\n[fm]@leo.lee@hellofresh.ca how will the receipt look when one brand is skipped ? Will it have any mention of the skipped brand ?\n\nBecause in HF, if users are skipped, we do not show the cart/order summary.\n\n[fn]Yeah it should only show for non-skipped meals.\n\n\n\n\n\nThat said, cc @katerina.scoullos@hellofresh.com @arbaaz.dossani@hellofresh.com is that reflected in our ticket\n\n\n\n\n\n@allysa.misola@hellofresh.ca Are we then adding more permutations in copy if people:\n\nJust order MK, just Order RTE?\n\n[fo]Ooh! Great call out on the permutations! I'm gonna add that as a topic but it would be helpful to call out just X brand for the single orders!\n\n[fp]@tricia.mcgleam@factor75.com, @frankie.hernandez@hellofresh.com & @sanyuja.mahajan@factor75.com Thank you for your time today. I wanted to outline the ask, process and pain points from our call today. Can you please take a moment to look this over and confirm if I have understood your points correctly? Thank you! cc: @leo.lee@hellofresh.ca\n\n[fq]and to be clear: FJ menu ops is not able to take on the manual management across FJ and x-sell\n\n[fr]Just to confirm since it's not specified here, we're excluding add-ons right?\n\n[fs]What about preferences? Are they same for US and FJ? And slots?\n\n[ft]@leo.lee@hellofresh.ca correct me, because my data might be obsolete; but the idea was that we would use the HFUS preferences; so we would need to map the FJ recipes to HF preferences. \n\n\n\n\n\nTHat said we did something similar for cross-brands, right @arbaaz.dossani@hellofresh.com for v3?\n\n[fu]We descoped it for v3\n\n[fv]For opt-in MVP, it doesn't really matte because pre-selection is a fixed step. We also don't call out F_ preferences in Opt-out ever. I'd pick the path that is creates less problems for us from the culinary tool side and the front end side.\n\n\n\n\n\nFor opt-out, we could go both ways, I can think of pros/cons for both, but we can land on it later\n\n[fw]we could also just schedule a run, no? basically: \n\n1. check if menu for DW exists every day\n\n2. if yes - trigger call\n\n3. if no - nada\n\n[fx]_Marked as resolved_\n\n[fy]_Re-opened_",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-10-02.md",
      "source_date": "2025-12-10",
      "doc_type": "prd",
      "matched_topics": [
        "market integration",
        "cross-selling"
      ],
      "matched_people": [],
      "filter_score": 2
    },
    {
      "title": "Request- tech support for DACH juices launch",
      "doc_id": "1RvnLB5EBpMNRJ00gD5pE2HU7bsiajcRprh0OG7tpzkc",
      "link": "https://docs.google.com/document/d/1RvnLB5EBpMNRJ00gD5pE2HU7bsiajcRprh0OG7tpzkc/edit?usp=drivesdk",
      "content": "﻿Last update\n\n\tSeptember 18\n\n\tAuthors\n\n\tPatricia de Campos \n\n\tContributors\n\n\tAlejandro Tomas CallejasDiogo AlmeidaSusanne UlrichFrank Zeugner\n\n\tStatus\n\n\tIn Progress\n\n\tBackground:\n\nHelloFresh and Factor have invested in launching a range of Private Label shots and juices in Europe, with Factor also planning to launch protein shakes and electrolyte drinks soon. This portfolio of relevant, innovative and exciting products will strengthen our brand, drive net AOV and unlock incremental value in the Free for Life and Loyalty Programs. \n\nWhile the current juice and shot portfolios are available for HF and F-EU customers in NL and FR, they are yet not available in DACH and NOR due to the complex Pfand (deposit) requirements.\n\nTo launch any beverage in DACH and the Nordics (DK,SE, NO), we must meet 3 requirements:\n\n1. Register with local regulatory agencies (completed)\n\n2. Set up a local bottle deposit scheme (completed) \n\n3. Meet the minimum legal require\n\n4. ments on our website and app, by clearly stating the relevant refund amount whenever a product is being ordered \n\n   * More specifically, the \"Pfand\" amount (e.g., \"Pfand Amount x 0.25 EUR\") must be declared expressly and separately in an additional line, not as \"other charges.\" We also need to clearly display the individual costs for the customer, showing how much of the €0.25 is being charged (e.g., 1x, 2x, etc.). (more details below)\n\nThe first two requirements have been met. However the third requirement cannot be fulfilled with our current platform and requires tech support to drive the necessary UI and backend integration. Without this tech integration, the launch of all beverages > 100ml in DACH (as paid and FFL add-ons) is completely blocked, and puts the launch in the Nordics and IE in a grey area.\n\nSolution needed: \n\nIn summary, we must clearly display the deposit (Pfand) collected for all beverages purchased by the customer in the \"Order Overview\" step on the checkout funnel, and ideally in the invoice too. \n\nMore specifically, the key change required is to add a new line within the 'order overview' section, located  on the right side of the screen,  clearly displaying the pfand amount and number of pfand's charged. For instance, if a product comprises a bundle of 3 bottles, it must state “3 x pfand”alongside the corresponding monetary value  (see picture below)\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\nQuestions to be clarified: \n\n* Does the €0.25 charge for a single-use bottle change market-to-market? \n\nYes, the exact deposit amount changes market by market. \n\nDifferent sizes of the bottle could have a different price as well (recipe-dependent). \n\n* What is the exact name/translation for the \"Pfand\" charge for each of the three markets?        \n\nThe “Pfand” is the German translation of ”Deposit”. The name will need to be translated in all markets.\n\n* Is it a definitive legal requirement to show the \"Pfand\" charge as a separate line item in the add-on section, or can it be omitted there?        \n\nIt is a must-have requirement to display a separate line item in both the Add-on and Order-summary due to legal requirements. \n\n   * If a customer orders multiple different juice/shot packs, can we show just one single collated line item for the total \"Deposit\" charge?\n\nConfirmed. Example: h\n\n\n\n\n\nBasket\n\n\tAdd-ons section \n\n- line items\n\n\tOrder summary section\n\n- line items\n\n\t1x Recipe A: 3x ginger shots\n\n\n\n\t1x Recipe A: base price €5.99\n\n\n\n3x Pfand: (corresponding to the n. of units in the recipe) €0.75\n\n\t1 Hellofresh Market product €5.99\n\n\n\n\n\nTotal pfand: \n\n3x units (0.25) = €0.75\n\n\t1x Recipe A: 3x ginger shots\n\n1x Recipe B: 5x Shot variety pack (3x ginger, 2x turmeric)\n\n\n\n\t1x Recipe A: base price €5.99\n\n1x Recipe B: base price €8.99\n\n\n\n8x Pfand: €2.00[a]\n\n\t2x Hellofresh Market product €14.98\n\n\n\n\n\nTotal pfand: \n\n8x units (0.25) = €2.00\n\n\t2x Recipe A: 3x ginger shots\n\n\n\n\n\n\t2x Recipe A: base price €11.98\n\n\n\n6x Pfand: €1.50\n\n\t2x Hellofresh Market product €11.98\n\n\n\n\n\nTotal pfand: €1.50\n\n\t\n\n\n\n\n\n[a]@sameer.doda@hellofresh.ca\n\nGood news on the single line item in the add-ons section. \n\nWe cannot omit it, but it can be aggregated as long as we show the exact units of pfand as in the order summary. \n\n\n\n\n\nPlease let me know if I've answered all your questions and thanks again for the support!\n\n_Assigned to sameer.doda@hellofresh.ca_",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-.md",
      "source_date": "2025-12-05",
      "doc_type": "prd",
      "matched_topics": [],
      "matched_people": [
        "sameer"
      ],
      "filter_score": 1
    },
    {
      "title": "Request- tech support for DACH juices launch",
      "doc_id": "1RvnLB5EBpMNRJ00gD5pE2HU7bsiajcRprh0OG7tpzkc",
      "link": "https://docs.google.com/document/d/1RvnLB5EBpMNRJ00gD5pE2HU7bsiajcRprh0OG7tpzkc/edit?usp=drivesdk",
      "content": "﻿Last update\n\n\tSeptember 18\n\n\tAuthors\n\n\tPatricia de Campos \n\n\tContributors\n\n\tAlejandro Tomas CallejasDiogo AlmeidaSusanne UlrichFrank Zeugner\n\n\tStatus\n\n\tIn Progress\n\n\tBackground:\n\nHelloFresh and Factor have invested in launching a range of Private Label shots and juices in Europe, with Factor also planning to launch protein shakes and electrolyte drinks soon. This portfolio of relevant, innovative and exciting products will strengthen our brand, drive net AOV and unlock incremental value in the Free for Life and Loyalty Programs. \n\nWhile the current juice and shot portfolios are available for HF and F-EU customers in NL and FR, they are yet not available in DACH and NOR due to the complex Pfand (deposit) requirements.\n\nTo launch any beverage in DACH and the Nordics (DK,SE, NO), we must meet 3 requirements:\n\n1. Register with local regulatory agencies (completed)\n\n2. Set up a local bottle deposit scheme (completed) \n\n3. Meet the minimum legal require\n\n4. ments on our website and app, by clearly stating the relevant refund amount whenever a product is being ordered \n\n   * More specifically, the \"Pfand\" amount (e.g., \"Pfand Amount x 0.25 EUR\") must be declared expressly and separately in an additional line, not as \"other charges.\" We also need to clearly display the individual costs for the customer, showing how much of the €0.25 is being charged (e.g., 1x, 2x, etc.). (more details below)\n\nThe first two requirements have been met. However the third requirement cannot be fulfilled with our current platform and requires tech support to drive the necessary UI and backend integration. Without this tech integration, the launch of all beverages > 100ml in DACH (as paid and FFL add-ons) is completely blocked, and puts the launch in the Nordics and IE in a grey area.\n\nSolution needed: \n\nIn summary, we must clearly display the deposit (Pfand) collected for all beverages purchased by the customer in the \"Order Overview\" step on the checkout funnel, and ideally in the invoice too. \n\nMore specifically, the key change required is to add a new line within the 'order overview' section, located  on the right side of the screen,  clearly displaying the pfand amount and number of pfand's charged. For instance, if a product comprises a bundle of 3 bottles, it must state “3 x pfand”alongside the corresponding monetary value  (see picture below)\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\nQuestions to be clarified: \n\n* Does the €0.25 charge for a single-use bottle change market-to-market? \n\nYes, the exact deposit amount changes market by market. \n\nDifferent sizes of the bottle could have a different price as well (recipe-dependent). \n\n* What is the exact name/translation for the \"Pfand\" charge for each of the three markets?        \n\nThe “Pfand” is the German translation of ”Deposit”. The name will need to be translated in all markets.\n\n* Is it a definitive legal requirement to show the \"Pfand\" charge as a separate line item in the add-on section, or can it be omitted there?        \n\nIt is a must-have requirement to display a separate line item in both the Add-on and Order-summary due to legal requirements. \n\n   * If a customer orders multiple different juice/shot packs, can we show just one single collated line item for the total \"Deposit\" charge?\n\nConfirmed. Example: h\n\n\n\n\n\nBasket\n\n\tAdd-ons section \n\n- line items\n\n\tOrder summary section\n\n- line items\n\n\t1x Recipe A: 3x ginger shots\n\n\n\n\t1x Recipe A: base price €5.99\n\n\n\n3x Pfand: (corresponding to the n. of units in the recipe) €0.75\n\n\t1 Hellofresh Market product €5.99\n\n\n\n\n\nTotal pfand: \n\n3x units (0.25) = €0.75\n\n\t1x Recipe A: 3x ginger shots\n\n1x Recipe B: 5x Shot variety pack (3x ginger, 2x turmeric)\n\n\n\n\t1x Recipe A: base price €5.99\n\n1x Recipe B: base price €8.99\n\n\n\n8x Pfand: €2.00[a]\n\n\t2x Hellofresh Market product €14.98\n\n\n\n\n\nTotal pfand: \n\n8x units (0.25) = €2.00\n\n\t2x Recipe A: 3x ginger shots\n\n\n\n\n\n\t2x Recipe A: base price €11.98\n\n\n\n6x Pfand: €1.50\n\n\t2x Hellofresh Market product €11.98\n\n\n\n\n\nTotal pfand: €1.50\n\n\t\n\n\n\n\n\n[a]@sameer.doda@hellofresh.ca\n\nGood news on the single line item in the add-ons section. \n\nWe cannot omit it, but it can be aggregated as long as we show the exact units of pfand as in the order summary. \n\n\n\n\n\nPlease let me know if I've answered all your questions and thanks again for the support!\n\n_Assigned to sameer.doda@hellofresh.ca_",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-03.md",
      "source_date": "2025-12-05",
      "doc_type": "prd",
      "matched_topics": [],
      "matched_people": [
        "sameer"
      ],
      "filter_score": 1
    }
  ],
  "doc_count": 7,
  "total_chars": 38109
}