{
  "batch_id": "one_on_one_007",
  "doc_type": "one_on_one",
  "documents": [
    {
      "title": "Series-evanikita-11.md",
      "doc_id": "1y5LCssuZCe-3rOYbzu6sxMiu-MqzvIxvntP_y3xPj_U",
      "link": "https://docs.google.com/document/d/1y5LCssuZCe-3rOYbzu6sxMiu-MqzvIxvntP_y3xPj_U/edit?usp=drivesdk",
      "content": "﻿Meeting Series: Eva:Nikita 1:1\n\nCadence: Recurring\n\n[2025-12-09] Upcoming Meeting\n\nEva:Nikita 1:1 Pre-Read\n\nType: 1on1\n\n\n\n\n\n________________\n\n\n\n\n\n1. Context/Why\n\nThis 1:1 provides an opportunity to follow up on key strategic initiatives and ongoing projects discussed in our previous meeting. We aim to review progress, address any emerging challenges, and align on next steps for critical areas such as the Tishi headcount conversion, Simon's involvement in development, and the VMS error metric report.\n\n\n\n\n\n________________\n\n\n\n\n\n2. Participant Notes\n\n* Eva Martínez Romero: Leading strategic initiatives related to team bandwidth, development prioritization, and metric reporting to support business needs.\n\n* Nikita Gorshkov: Providing strategic oversight, exploring funding avenues, and reviewing key reports to enable broader team support.\n\n\n\n\n\n________________\n\n\n\n\n\n3. Last Meeting Recap (December 4, 2025)\n\nOur last 1:1 focused on two main strategic points:\n\n\n\n\n\n* Tishi Headcount Conversion: Eva proposed a business case to convert Tishi's existing freelancer headcount to a permanent or temporary contract to address bandwidth needs for TPT and Good shop. Nikita supported this, suggesting funding could come from Good shop and TPT, and noted a PA might be a more cost-effective solution than a contractor.\n\n   * Key Action: Nikita planned to discuss this with Yuri and Lauron to initiate the conversation, considering a temporary contract as a viable interim solution.\n\n* Involving Simon in Road Mapping & Development: Eva outlined plans to involve Simon more closely in road mapping and development, including handing over the development of the perfect order rate. This was driven by recurrent prioritization issues in the shopping experience's lithium release impacting local markets.\n\n   * Key Action: Eva also suggested, and both agreed, that Simon should create an extended report on the VMS error metric (to include Good shop and TPT data) for Nikita to review, aiming to bolster support for Alexia.\n\n\n\n\n\n________________\n\n\n\n\n\n4. Agenda Suggestions\n\n1. Follow-up on Tishi Headcount Conversion: Update on discussions with Yuri and Lauron, and next steps.\n\n2. Simon's Involvement: Progress on integrating Simon into road mapping and the handover of perfect order rate development.\n\n3. VMS Error Metric Report: Review of Simon's extended report, initial findings, and next steps for leveraging it.\n\n4. Strategic Alignment: Discuss any new priorities or emergent blockers related to current initiatives.\n\n5. Open Discussion / AOB.\n\n\n\n\n\n________________\n\n\n\n\n\n5. Key Questions\n\n* What was the outcome of your discussion with Yuri and Lauron regarding the Tishi headcount conversion? Are there any updates on potential funding from Good shop and TPT?\n\n* What is the current status of Simon's involvement in road mapping, and has the handover of the perfect order rate development begun?\n\n* Has Simon's extended report on the VMS error metric been completed or are there any initial insights? How can we best utilize this report to support Alexia?\n\n* Are there any new critical issues or developments stemming from the shopping experience's lithium release that require attention?\n\n* Are there any other topics or challenges you'd like to discuss that could impact our current strategic objectives?\n\n\n\n\n\n________________",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-.md",
      "source_date": "2025-12-09",
      "doc_type": "one_on_one",
      "matched_topics": [
        "tpt",
        "vms"
      ],
      "matched_people": [
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "Ali:Nikita 1:1 - 2025/12/09 17:47 CET - Notes by Gemini",
      "doc_id": "1LxNTUKotaHmFgZX_HSmAU3mWGPBoou0WGMLjXJNAsoI",
      "link": "https://docs.google.com/document/d/1LxNTUKotaHmFgZX_HSmAU3mWGPBoou0WGMLjXJNAsoI/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 9, 2025\n\nAli:Nikita 1:1\n\nInvited Nikita Gorshkov Alison Ryan\n\nAttachments Ali:Nikita 1:1 \n\n\n\n\n\nSummary\n\nAlison Ryan provided updates on the Shopify project for VMS, noting strong collaboration with Laura, Samir, and the Netta team as the launch approaches and key Recharge issues are resolved, which will simplify future projects like Good Chop; Nikita Gorshkov connected with Samir, who also feels they are in the final stages. Alison Ryan and Nikita Gorshkov discussed the Good Chop contracts, with Alison Ryan clarifying that the Recharge partnership was introduced but the contracts are still undergoing legal review, a process Yuri posted that procurement approved to fast track. Finally, Alison Ryan asked Nikita Gorshkov about the New York office check-in process for an upcoming trip, to which Nikita Gorshkov advised \"bugging Ashling\" for access information.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Project Updates and Collaboration Alison Ryan provided updates on the Shopify project, expressing enjoyment in working with Laura and Samir and noting strong collaboration with the Netta team. They reported that things are moving well, with the launch date approaching, and key issues like those related to Recharge are being sorted out, which will make future projects like Good Chop more straightforward. Nikita Gorshkov mentioned having connected with Samir, who also feels they are in the final stretches for Shopify for VMS and anticipates a quick turnaround for the Good Chop side now that the process is understood.\n\n* Good Chop Contracts and Legal Review Nikita Gorshkov followed up on the status of the Good Chop contracts, questioning if the team had signed them. Alison Ryan clarified that an introduction was done with Recharge as a partner, but not with the Anetta team, and they understood that the contracts have not been fully signed yet. Alison Ryan shared that Yuri posted in the Good Chop channel that procurement gave an \"okay\" to fast lane the legal side, suggesting the contracts are currently undergoing legal review. Nikita Gorshkov planned to follow up with Yuri and Seb regarding the contracts.\n\n* Upcoming Trip to the New York Office Alison Ryan is set up for a trip to New York next week and is excited to meet the Good Chop team and represent their project well for Shopify decisions. They asked Nikita Gorshkov about the check-in process for the New York office since they have never been there. Nikita Gorshkov advised that they would \"bug Ashling\" for office access information, suggesting that Ashling likely knows the policies and the people who need to issue codes and necessary items.\n\n\n\n\n\nSuggested next steps\n\n* Alison Ryan will contact Ashling to inquire about US office access, including necessary codes and policies, for the New York trip next week.\n\n* Nikita Gorshkov will follow up with Yuri and Seb regarding the contract signing for Shopify for VMS.\n\n\n\n\n\nYou should review Gemini's notes to make sure they're accurate. Get tips and learn how Gemini takes notes\n\nPlease provide feedback about using Gemini to take notes in a short survey.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-10-.md",
      "source_date": "2025-12-10",
      "doc_type": "one_on_one",
      "matched_topics": [
        "good chop",
        "vms"
      ],
      "matched_people": [
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "Series-evanikita-11.md",
      "doc_id": "1y5LCssuZCe-3rOYbzu6sxMiu-MqzvIxvntP_y3xPj_U",
      "link": "https://docs.google.com/document/d/1y5LCssuZCe-3rOYbzu6sxMiu-MqzvIxvntP_y3xPj_U/edit?usp=drivesdk",
      "content": "﻿Meeting Series: Eva:Nikita 1:1\n\nCadence: Recurring\n\n[2025-12-09] Upcoming Meeting\n\nEva:Nikita 1:1 Pre-Read\n\nType: 1on1\n\n\n\n\n\n________________\n\n\n\n\n\n1. Context/Why\n\nThis 1:1 provides an opportunity to follow up on key strategic initiatives and ongoing projects discussed in our previous meeting. We aim to review progress, address any emerging challenges, and align on next steps for critical areas such as the Tishi headcount conversion, Simon's involvement in development, and the VMS error metric report.\n\n\n\n\n\n________________\n\n\n\n\n\n2. Participant Notes\n\n* Eva Martínez Romero: Leading strategic initiatives related to team bandwidth, development prioritization, and metric reporting to support business needs.\n\n* Nikita Gorshkov: Providing strategic oversight, exploring funding avenues, and reviewing key reports to enable broader team support.\n\n\n\n\n\n________________\n\n\n\n\n\n3. Last Meeting Recap (December 4, 2025)\n\nOur last 1:1 focused on two main strategic points:\n\n\n\n\n\n* Tishi Headcount Conversion: Eva proposed a business case to convert Tishi's existing freelancer headcount to a permanent or temporary contract to address bandwidth needs for TPT and Good shop. Nikita supported this, suggesting funding could come from Good shop and TPT, and noted a PA might be a more cost-effective solution than a contractor.\n\n   * Key Action: Nikita planned to discuss this with Yuri and Lauron to initiate the conversation, considering a temporary contract as a viable interim solution.\n\n* Involving Simon in Road Mapping & Development: Eva outlined plans to involve Simon more closely in road mapping and development, including handing over the development of the perfect order rate. This was driven by recurrent prioritization issues in the shopping experience's lithium release impacting local markets.\n\n   * Key Action: Eva also suggested, and both agreed, that Simon should create an extended report on the VMS error metric (to include Good shop and TPT data) for Nikita to review, aiming to bolster support for Alexia.\n\n\n\n\n\n________________\n\n\n\n\n\n4. Agenda Suggestions\n\n1. Follow-up on Tishi Headcount Conversion: Update on discussions with Yuri and Lauron, and next steps.\n\n2. Simon's Involvement: Progress on integrating Simon into road mapping and the handover of perfect order rate development.\n\n3. VMS Error Metric Report: Review of Simon's extended report, initial findings, and next steps for leveraging it.\n\n4. Strategic Alignment: Discuss any new priorities or emergent blockers related to current initiatives.\n\n5. Open Discussion / AOB.\n\n\n\n\n\n________________\n\n\n\n\n\n5. Key Questions\n\n* What was the outcome of your discussion with Yuri and Lauron regarding the Tishi headcount conversion? Are there any updates on potential funding from Good shop and TPT?\n\n* What is the current status of Simon's involvement in road mapping, and has the handover of the perfect order rate development begun?\n\n* Has Simon's extended report on the VMS error metric been completed or are there any initial insights? How can we best utilize this report to support Alexia?\n\n* Are there any new critical issues or developments stemming from the shopping experience's lithium release that require attention?\n\n* Are there any other topics or challenges you'd like to discuss that could impact our current strategic objectives?\n\n\n\n\n\n________________",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-10-.md",
      "source_date": "2025-12-10",
      "doc_type": "one_on_one",
      "matched_topics": [
        "tpt",
        "vms"
      ],
      "matched_people": [
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "Beatrice:Nikita 1:1 - 2025/12/11 10:01 CET - Notes by Gemini",
      "doc_id": "1R8JHV4VrcrrZqVlTVRveXapfNggkMwLygQe767hQG0A",
      "link": "https://docs.google.com/document/d/1R8JHV4VrcrrZqVlTVRveXapfNggkMwLygQe767hQG0A/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 11, 2025\n\nBeatrice:Nikita 1:1\n\nInvited Beatrice Dimarucut Nikita Gorshkov\n\nAttachments Beatrice:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nBeatrice Dimarucut and Nikita Gorshkov discussed HelloFresh's app-first approach for new features like merchandising tiles on Ellesium, clarifying that code reuse between web and mobile requires features to be built in a specific way, although all backend logic should be reusable. The participants addressed confusion around charge checkout issues and the cancel/refund functionalities during the AL migration, noting that performing one action makes the other option unavailable. Nikita Gorshkov suggested looping in Shay or creating documentation to clarify the charge checkout flows for AL, which Beatrice Dimarucut agreed is necessary for documenting expected AL behavior despite current workarounds with Bob.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* HelloFresh App First Approach and Code Sharing Beatrice Dimarucut reported on a chat with Merit regarding HelloFresh's shopping journey, merchandising, and personalization, noting their app-first approach for new features like merchandising tiles on Ellesium (00:00:00). Nikita Gorshkov emphasized that if they were to reuse code between web and mobile, as the new infrastructure allows, the features would need to be built in a specific way (00:01:20). Beatrice Dimarucut clarified that because the new code is being written for both web and app simultaneously, they should be able to reuse some parts of it, including all backend logic (00:02:17).\n\n* Issues with Charge Checkout in AL Migration Beatrice Dimarucut expressed doubt about increasing the charge checkout allocation due to potential issues, which they plan to discuss with Ahmed. Nikita Gorshkov clarified that the cancel option does not cancel the order itself, but the payment processing of the order (00:03:32). Both speakers discussed the confusion around the cancel and refund functionalities, noting that if one action is taken first (cancel or refund), the option for the other disappears (00:04:32).\n\n* Charge Checkout Documentation and Confusion Nikita Gorshkov suggested looping in Shay or creating a document to clarify the flows for charge checkout, expressing confusion over the processes, especially with the AL migration (00:04:32). Beatrice Dimarucut noted that the payment team initially implemented charge checkout through Bob, and the current confusion is due to the AL migration (00:05:26). They further detailed that the refund process works via AL through the orders tab or by refunding first, but not via the error reporting tool that agents are trained to use for good shop (00:06:31).\n\n* Documenting Charge Checkout Flows in AL Beatrice Dimarucut summarized the remaining confusion: if a refund works, how to cancel the box, and if the box is canceled, why the refund option is missing (00:07:31). Nikita Gorshkov outlined a documentation approach to map the flow, including order states (pre- and post-cutoff), payment states (BAU and CC), AL actions (cancel, refund), and results (00:08:46). Beatrice Dimarucut acknowledged that while Bob is a current workaround, they need to focus on documenting what is expected for AL, as the company will not revert to Bob (00:10:38).\n\n\n\n\n\nSuggested next steps\n\n* Beatrice Dimarucut will ask about reusing the backend services for HelloFresh.\n\n* Nikita Gorshkov will create a document to loop in Shay and detail what Al is planning for charger checkout when it scales, given the confusion around current flows and issues.\n\n* Beatrice Dimarucut will do\n\n\n\n you first do the other thing even via Bob?\n\n \n\n \n\n00:08:46\n\n \n\nBeatrice Dimarucut: It doesn't matter. I'm going to document this.\n\nNikita Gorshkov: Wait,\n\nBeatrice Dimarucut: I think this\n\nNikita Gorshkov: wait, wait, wait. No, just I think so. We don't need to even uh do it as a uh so here we\n\nBeatrice Dimarucut: is\n\nNikita Gorshkov: have pre cutff. So, okay, wait. Uh state order state payment state CC L action one or action first action second\n\nBeatrice Dimarucut: Mhm.\n\nNikita Gorshkov: action um okay and then order state is pre uh cutoff because that's an order state.\n\nBeatrice Dimarucut: Mhm.\n\nNikita Gorshkov: Post cutoff uh then payment state uh C uh well actually BAU and see right.\n\nBeatrice Dimarucut: Mhm. Yeah. So those are like Yeah.\n\nNikita Gorshkov: Yep. And then here it will always be\n\nBeatrice Dimarucut: Um\n\nNikita Gorshkov: uh um drop down. Uh cancel uh refund. Anything else?\n\nBeatrice Dimarucut: I mean th those are like what are you trying to do with like the owl action like you're trying to dictate what should be possible or what is\n\nNikita Gorshkov: I'm trying to document what's the flow.\n\n \n\n \n\n00:10:38\n\n \n\nNikita Gorshkov: No.\n\nBeatrice Dimarucut: possible.\n\nNikita Gorshkov: And uh here we just have results.\n\nBeatrice Dimarucut: Ah okay. Okay. I think we also need some Bob columns just to compare it\n\nNikita Gorshkov: Uh but but no,\n\nBeatrice Dimarucut: maybe.\n\nNikita Gorshkov: but so they're not going to u revert back to Bob, right? That's the reality that we have to live with.\n\nBeatrice Dimarucut: Yeah. Okay. Fair.\n\nNikita Gorshkov: Uh so we need to show them.\n\nBeatrice Dimarucut: I I mean the only reason why I'm talking about Bob right now is because that's the workaround we need to do\n\nNikita Gorshkov: Uhhuh.\n\nBeatrice Dimarucut: if we want to increase allocation right now. But yeah. Okay.\n\nNikita Gorshkov: Mhm.\n\nBeatrice Dimarucut: You're trying to just do you're just trying to show them for Al what should\n\nNikita Gorshkov: Yeah. Exactly.\n\nBeatrice Dimarucut: be.\n\nNikita Gorshkov: Uh order states. Actually, we need to just have this as another dropdown. Uh\n\nBeatrice Dimarucut: So pre-cut off post cut off.\n\nNikita Gorshkov: pretty. And then uh okay. Mhm. Yep. Mhm.\n\n \n\n \n\nTranscription ended after 00:13:48\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-11-01.md",
      "source_date": "2025-12-11",
      "doc_type": "one_on_one",
      "matched_topics": [],
      "matched_people": [
        "beatrice",
        "ahmed",
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "Laurent:Nikita 1:1 (2w) - 2025/12/19 16:26 CET - Notes by Gemini",
      "doc_id": "13UAg-f04jVF9RqoSOCwAZmz6g8v_wLQpWcVZ36elCAo",
      "link": "https://docs.google.com/document/d/13UAg-f04jVF9RqoSOCwAZmz6g8v_wLQpWcVZ36elCAo/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 19, 2025\n\nLaurent:Nikita 1:1 (2w)\n\nInvited Nikita Gorshkov Laurent Guillemain Dovas Zakas\n\nAttachments Laurent:Nikita 1:1 (2w) \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nLaurent Guillemain introduced the one-year conversion rate program with multiple time-boxed initiatives aimed at achieving 2026 OKRs, with Dovas Zakas detailing the objective of a 25% year-on-year CVR improvement, focusing on dependable channels for tracking. Nikita Gorshkov emphasized a six-week short-term cadence for impetus, while Laurent Guillemain confirmed achievements would be measured through the quantifiable impact of delivered initiatives and a monthly ramp aligned with the OKR. Dovas Zakas, Laurent Guillemain, and Nikita Gorshkov agreed that Pratik would manage the conversion rate program for the first six months, focusing on initiatives across six pillars, with 20% of their time allocated to CVR and 20-30% to retention, requiring a technical owner from the engineering team to support them.\n\n\n\n\n\nDetails\n\n* Conversion Rate Program Structure and Governance Laurent Guillemain introduced the conversion rate program, explaining the shift towards program-based approaches to drive change due to increased complexity in larger organizations and past difficulties with resourcing (00:00:00). They stated that the program is not a three-month effort but an ongoing one-year program with multiple time-boxed initiatives, aimed at achieving 2026 OKRs (00:01:17). Dovas Zakas noted the importance of having someone from the tech team manage the program, as the majority of the impact will come through features and technology (00:08:37).\n\n* Program Cadence and Measurement Nikita Gorshkov emphasized the need for a short-term cadence, such as six weeks, to maintain impetus and provide a sense of delivered achievement for engineering teams, countering the feeling of a \"consistent slog\" for long-term programs (00:02:09). Laurent Guillemain agreed, stating that achievements should be marked by the delivery of initiatives and their quantifiable impact through analytics, adding that there will be a monthly ramp with goals aligned to the OKR target (00:03:26). The retention program was highlighted as an example, featuring ramped goals throughout the year and a monthly tracking of average AO (Average Order) versus the target (00:04:33) (00:19:31).\n\n* Conversion Rate Program Objectives and Tracking Dovas Zakas detailed that the OKR is to improve CVR (Conversion Rate) by 25% year on year, acknowledging the difficulty in tracking the blended number due to varying channel performance, such as direct sales and app (00:06:58). They plan to focus on more dependable channels like Meta native or one of the search channels for tracking the 25% uplift to ensure fairness (00:08:37). Dovas Zakas also presented an initial list of 25-30 initiatives across six pillars—quiz, price and offer testing, landing pages, post-quiz, program ops, and RAPH (00:09:44).\n\n* Program Ownership and Staffing The group discussed the program manager role, noting that Maria previously managed it but was stretched (00:00:00). Laurent Guillemain outlined that for the retention program, Reena is the program manager who owns the plan and reports on progress, managing the link with individual initiative owners (00:05:35). Dovas Zakas expressed excitement about Pratik taking on the conversion rate program, seeing it as a good onboarding and test to ensure they can quickly grasp all topics (00:11:42). Nikita Gorshkov agreed, noting that Pratik brings relevant experience in building and optimizing funnels and convers\n\n\n\n,\n\nDovas Zakas: Yeah.\n\nLaurent Guillemain: and they start to give feedback as well at some point, which is kind of nice, right? They're not just a lump.\n\nNikita Gorshkov: I mean she was never a lump.\n\nDovas Zakas: Yeah.\n\nNikita Gorshkov: She was very attentive from day one, which is super cool. But um yeah, it's uh it I mean it it is a magical feeling. I you folks know all about it. It's uh when people without kids ask me, I struggle to explain it\n\nDovas Zakas: Yeah.\n\nNikita Gorshkov: necessarily.\n\nDovas Zakas: But right now it's purely physical like the challenges and then to get it changes to a point that I don't even remember how hard it was. But now everything is a negotiation.\n\n \n\n \n\n00:27:12\n\n \n\nNikita Gorshkov: And that's when you get the second group.\n\nDovas Zakas: What?\n\nNikita Gorshkov: And then you get the second kid because you forgot how hard it\n\nDovas Zakas: Yeah. Exactly.\n\nLaurent Guillemain: Um what one other thing and maybe actually you can update us offline on this one but um just the\n\nNikita Gorshkov: is.\n\nDovas Zakas: Exactly.\n\nLaurent Guillemain: app scoping document I know you've given it to Pritique uh but it would be I'm a little like I'm interested to see what with what Pritique comes up with in the document considering he hasn't been involved in the discussion so far. But let's see. And we'll probably need to align quite a bit on the output.\n\nNikita Gorshkov: I mean I I did provide him with essentially the majority guidance\n\nLaurent Guillemain: Um\n\nNikita Gorshkov: and how I see the PC v 0 scope and v1 scope. I actually need more Daniel's input right now than anything because of uh on the technical side to make decisions in terms of what exactly um where the new architecture is going to be beneficial for us and where we're just going to go with web views and I first need to catch him. So um I can actually like it's it's a very rough draft at the moment but nothing too crazy.\n\nLaurent Guillemain: Do do you want us all ready to read through it? Is it at the stage where? No, no, no. I I will only read through it when you want me to read through it to me rather than me piece me or going for it. Okay, awesome. Well, good luck with the sleeping and good weekend. Bye.\n\n \n\n \n\nTranscription ended after 00:29:01\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-19-01.md",
      "source_date": "2025-12-19",
      "doc_type": "one_on_one",
      "matched_topics": [],
      "matched_people": [
        "maria",
        "daniel",
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "Laura:Nikita 1:1 (2w) - 2025/12/19 16:05 CET - Notes by Gemini",
      "doc_id": "1twfZiL-M7nTV0GW_baHTaxg7XMQVSOgFEvfl9AcXboY",
      "link": "https://docs.google.com/document/d/1twfZiL-M7nTV0GW_baHTaxg7XMQVSOgFEvfl9AcXboY/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 19, 2025\n\nLaura:Nikita 1:1 (2w)\n\nInvited Nikita Gorshkov Laura Loughran\n\nAttachments Laura:Nikita 1:1 (2w) \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nLaura Loughran welcomed Nikita Gorshkov back, and they discussed the recent Shopify launch, confirming that traffic strategy will be decided in January after analyzing conversion rates, and Nikita Gorshkov confirmed the OTP launch is still targeting the 5th, with a full end-to-end UAT scheduled for the 30th. Laura Loughran and Nikita Gorshkov raised concerns about the small team’s capacity to manage both the new Shopify site and existing operations, agreeing that a dedicated Shopify team might be necessary to handle maintenance and questioning the future product ownership and strategy beyond basic maintenance, especially given team commitments like Samir and Alli (Allison) to other projects. Nikita Gorshkov also noted the team, including Hammed and Michael, is working on significantly improving the legacy integrated site, particularly the PDP pages.\n\n\n\n\n\nDetails\n\n* Return and Personal Update Laura Loughran welcomed Nikita Gorshkov back, and they shared that their little one is doing great, noting that although it is \"a lot\", they are finding a pattern with sleep and the child is a \"bundle of joy\". The child's name is Na Adelated (00:00:00).\n\n* Shopify Launch and Traffic Strategy Laura Loughran reported that they launched Shopify yesterday, but they are not yet driving traffic to it (00:00:00). They plan to wait until after Christmas to see the conversion rate on the paid side and then decide in January how to allocate traffic between the new site and the legacy site (00:06:28).\n\n* OTP Launch and UAT Scheduling Nikita Gorshkov confirmed that they are still targeting the 5th for the OTP launch, expecting traffic to pick up from that date due to New Year's. They acknowledged that they will lose some conversions but not too many, and they have scheduled a full end-to-end UAT for the 30th to resolve any lingering issues (00:06:28). Nikita Gorshkov also noted that they have a list of known bugs that the team is currently fixing (00:07:34).\n\n* Team Capacity and Future Ownership of Shopify Laura Loughran raised a concern about managing both the new Shopify site and the existing operations with a small team and questioned what product ownership of the Shopify site would look like moving forward (00:07:34). Nikita Gorshkov responded that they do not know at the moment, as the team members involved, Samir and Alli (Allison), are already committed to other projects like the GCNL closure, the launch of HelloFresh premium tier, and the recipe creator marketplace with Ian (00:08:39).\n\n* Need for Dedicated Shopify Team Nikita Gorshkov stated that they believe they need to figure out the staffing in a consolidated way and suggested they might need to go to Ed to request a dedicated Shopify team to handle at least the \"KTLO stuff\" (Keep the Lights On) for these sites (00:08:39). Laura Loughran agreed and confirmed alignment, suggesting that one PM or one team might be able to cover all the sites, as they do not believe any single site requires full-time maintenance (00:10:14).\n\n* Product Strategy for Site Ownership Nikita Gorshkov further questioned what the PM would be accountable for beyond maintenance, asking what \"product strategy\" the person would contribute towards, especially regarding development and potential needs for new PDP pages, which would require a designer (00:10:14). They acknowledged that longer-term integrations and automation topics could be handled by the engineering s\n\n\n\nthe legacy side to a state of competitiveness. Let's put it like that and that uh so that we can see and because for good shop as well I need to like theoretically we could do everything uh Shopify is providing but I also acknowledge that it's not as fast but it has other other benefits and other you know cost benefits uh longer term anyway\n\n \n\n \n\n00:12:44\n\n \n\nLaura Loughran: Yeah. Yeah. Okay. All right. So,\n\nNikita Gorshkov: Okay.\n\nLaura Loughran: it sounds like I think we can't can't even make any decisions till we see how I see how the site performs. And then if it's like, oh my god, it's 3x better, then we make decisions accordingly. And if not, then we, you know, make different decisions. So, we'll see how it goes and then um we can determine how to consolidate,\n\nNikita Gorshkov: Yep.\n\nLaura Loughran: shift, move forward in the future.\n\nNikita Gorshkov: Yep.\n\nLaura Loughran: But I guess for the next like couple of weeks, can I assume that Allison will at least be around to support\n\nNikita Gorshkov: Yes. Yeah. I I'll check with her.\n\nLaura Loughran: Okay.\n\nNikita Gorshkov: Let me check with her schedule. Like there's always uh somebody on call obviously uh on our ends. Um I'm meeting with her today. I I'll double check uh with her on uh on her schedule.\n\nLaura Loughran: Cool.\n\nNikita Gorshkov: She should be around holiday schedule.\n\nLaura Loughran: All right.\n\nNikita Gorshkov: Cool.\n\nLaura Loughran: All right. I think that's everything, but yeah, happy to have you back. Um, and I'll keep you in the loop as we continue to learn and try new things.\n\nNikita Gorshkov: Nice. Cool. Yeah, exciting stuff.\n\nLaura Loughran: Yeah.\n\nNikita Gorshkov: Um, I've also like I've been working with Hamemeds uh and now with Michael quite a bit. So, I think we'll be improving the the leg legacy uh integrated site uh quite a bit. I've also pushed them to be a bit more like this is the whole thing like if if we um if we believe that we're also selling a a particular lifestyle with all of the options that we're providing um to our customers like I think we need to go a bit farther than what we have right now in the PDP pages which is like a Amazon PDP page which is built for a completely different function.\n\n \n\n \n\nTranscription ended after 00:15:07\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-19-01.md",
      "source_date": "2025-12-19",
      "doc_type": "one_on_one",
      "matched_topics": [
        "otp"
      ],
      "matched_people": [
        "allison",
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "Prateek:Nikita 1:1 - 2025/12/30 16:45 CET - Notes by Gemini",
      "doc_id": "1kteMfputNdHOGCG2fu024SpgrXKjEYskeMl4bPqi8MI",
      "link": "https://docs.google.com/document/d/1kteMfputNdHOGCG2fu024SpgrXKjEYskeMl4bPqi8MI/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 30, 2025\n\nPrateek:Nikita 1:1\n\nInvited Nikita Gorshkov Prateek Jajoo\n\nAttachments Prateek:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nPrateek Jajoo and Nikita Gorshkov discussed the signup page memo, focusing on Google Analytics inconsistencies and prioritizing CTA and passwordless features to combat a 24% abandonment rate, with a preference for the passwordless solution pending reliable data next week. They also addressed the CVR program, with Nikita Gorshkov asking Prateek Jajoo to work with DAS to define Q1 OKRs by February 9th, targeting the micro-conversion from \"plans to dashboard.\" Finally, they reviewed Project LEGO's implementation for features like social login and considered its potential for a unified layout across Good Shop and Pet Stable, while confirming the high priority of express checkout by Apple Pay for the CVR program.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Discussion with DAS on Signup Page and Analytics Prateek Jajoo briefed Nikita Gorshkov about their discussion with DAS regarding the signup page memo, which included reviewing Google Analytics data that showed inconsistencies, specifically a 24% abandonment rate compared to HelloFresh (00:00:00). Prateek Jajoo prioritized two features—CTA and passwordless—to address the drop-off, creating a PRD that was reviewed by EMTT and will be shared with Nikita Gorshkov. Prateek Jajoo indicated that the passwordless solution would be the preferred direction once reliable data is secured from the analytics team next week (00:01:06).\n\n* CVR Program and Q1 OKRs The CVR program was discussed as a close collaboration with DAS involving prioritization and execution, estimated to take up 50% of Prateek Jajoo's capacity, though Nikita Gorshkov suggested efficiency could reduce this over time after the initial setup (00:02:16). Nikita Gorshkov requested Prateek Jajoo to work with DAS to define OKRs or ambition levels for Q1, specifically targeting the micro conversion from \"plans to dashboard\" and to provide this target by next Friday, February 9th (00:03:25). Prateek Jajoo confirmed they only needed the ambition level for now (00:04:19).\n\n* Project LEGO and Checkout Funnel Strategy Prateek Jajoo asked about timelines and the appropriate contact person for implementing Project LEGO, particularly features like social login (00:04:19). Nikita Gorshkov explained that Alex estimated 70 engineering days for refactoring the current Good Shop funnel, prompting consideration of transitioning to LEGO instead. The challenge for both Good Shop and Pet Stable is that Project LEGO currently lacks pre-checkout menu selection, but it may allow for extracting the address and checkout page for a unified layout, which would enable the reuse of components from HelloFresh (00:05:23).\n\n* Pricing, Bugs, and Express Checkout Priority Prateek Jajoo plans to develop a problem statement for pricing to initiate discussions with design for a short-term and long-term fix (00:07:22). Prateek Jajoo also noted a bug where hitting the back button from the recipe selection page incorrectly sent customers to the first quiz question, but observed that the tech team may have already fixed it (00:08:28). Finally, Nikita Gorshkov confirmed that express checkout by Apple Pay should be prioritized and integrated into the CVR program, alongside the one-pager on the app, as both are high priority (00:09:59).\n\n\n\n\n\nSuggested next steps\n\n* Prateek Jajoo will check the OKRs or ambition levels for the micro conversion from plans to dashboard that Nikita Gorshkov posted in the product channel and togethe\n\n\n\nticket has been picked up.\n\nNikita Gorshkov: Huh?\n\nPrateek Jajoo: When we go to the recipe page, recipe selection page and hit the back button,\n\n \n\n \n\n00:08:28\n\n \n\nNikita Gorshkov: Huh?\n\nPrateek Jajoo: uh it takes customers directly to the first question on the\n\nNikita Gorshkov: All\n\nPrateek Jajoo: quiz.\n\nNikita Gorshkov: right. Once\n\nPrateek Jajoo: So I'm sharing my screen. Okay.\n\nNikita Gorshkov: again.\n\nPrateek Jajoo: I just cash uh it would not be it would be Let's do it. Let's do it. Let's and let me know if this is uh something that we looked at before or Okay. So, we'll uh pick a meal and then we go here and then we go here.\n\nNikita Gorshkov: Mhm.\n\nPrateek Jajoo: Here pick and if we go back as in we should go to the meal selection page, right?\n\nNikita Gorshkov: Sure.\n\nPrateek Jajoo: It actually Oh, it's working now. I think they fixed it.\n\nNikita Gorshkov: There might be a slight delay.\n\nPrateek Jajoo: No, no,\n\nNikita Gorshkov: Like that's the issue.\n\nPrateek Jajoo: no. It it uh generally goes to the first question. So, maybe they fixed it already. The bug was it when you hit back,\n\nNikita Gorshkov: Okay.\n\nPrateek Jajoo: it went to the first page, which is the first page of the quiz.\n\n \n\n \n\n00:09:59\n\n \n\nPrateek Jajoo: So, the customer travels back and have to complete the quiz again. Uh yeah. So, they fixed it basically.\n\nNikita Gorshkov: Okay.\n\nPrateek Jajoo: Okay.\n\nNikita Gorshkov: Cool.\n\nPrateek Jajoo: So uh and the last few things yeah I actually wanted to just get an understanding of the next things that I'm doing right so it was uh a one pager on the app that's one thing that's needed express checkout by Apple Pay\n\nNikita Gorshkov: Yes.\n\nPrateek Jajoo: that you also said hey we need this and like that so is there anything that you would want me\n\nNikita Gorshkov: Yes. Yeah. Yeah.\n\nPrateek Jajoo: to prioritize\n\nNikita Gorshkov: I would take the uh so uh in any case the CVR oh both of these are kind of\n\nPrateek Jajoo: Yeah.\n\nNikita Gorshkov: priority so you can focus uh on this but the express checkout you can add into the uh CVR program because it's it's one of it's perfectly fits into that whole thing.\n\nPrateek Jajoo: Got it. Okay. Cool. I love Android. Okay. Cool. Go ahead.\n\n \n\n \n\nTranscription ended after 00:11:14\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-30-03.md",
      "source_date": "2025-12-30",
      "doc_type": "one_on_one",
      "matched_topics": [],
      "matched_people": [
        "prateek",
        "alex",
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "Ian:Nikita 1:1 (2w) - 2025/12/05 17:02 CET - Notes by Gemini",
      "doc_id": "1qnA4wfp8b6ah19iVN4YmghKSqGB0wVkaMp8LU-DUvmg",
      "link": "https://docs.google.com/document/d/1qnA4wfp8b6ah19iVN4YmghKSqGB0wVkaMp8LU-DUvmg/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 5, 2025\n\nIan:Nikita 1:1 (2w)\n\nInvited Nikita Gorshkov Ian Brooks\n\nAttachments Ian:Nikita 1:1 (2w) \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nIan Brooks and Nikita Gorshkov discussed the challenges of poor personalization, including menu repeats, resulting from the current recommendation engine, which Ian Brooks suggested requires a UX overhaul using a more food-based, \"restaurant\"-style approach for \"total choice for chef's plate\" implementation. Nikita Gorshkov confirmed the leadership for the creator platform/marketplace will be Lineia Serisma for product strategy, Cole Banning for growth, and Melanie Schmidt for project management, with an MVP focused on simple, occasion-based boxes for one-off purchases via social media. They also addressed the organization of Market Innovation, with Nikita Gorshkov proposing a new prioritization structure, and Ian Brooks agreeing to serve as the delegate for international markets while emphasizing the need for guardrails to mitigate US market dominance in resource allocation.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Personalization and Menu Timelines Ian Brooks is focused on understanding the timelines and implications of \"harp penguin liar nextgen harp\" in the context of \"total choice for chef's plate\" and discussed the unintended consequences of poor personalization on their current HelloFresh menu. Ian Brooks demonstrated that their personalized menu defaults included a high volume of repeats, specifically Mexican and pasta dishes, requiring them to scroll through 20 recipes before encountering variety, leading to variety and repetition complaints that are 2x higher in their market than any other (00:03:15). Ian Brooks shared that they have videos of this issue to send to Nikita Gorshkov (00:05:39).\n\n* Personalization and UX Issues Ian Brooks contends that the current recommendation engine, which they believe is \"liar\" and not \"harp,\" has not adjusted for active selections and continues to show repeated defaults, leading to a \"terrible experience\" (00:04:21). Ian Brooks stated that proper UX and recommendation/personalization is a prerequisite for implementing \"total choice\" for Chef's Plate, given the potential problems that would arise in a 600-slot menu (00:08:10). Nikita Gorshkov agreed that a 500-recipe menu could result in 10 screens of pasta dishes, especially on mobile (00:09:39).\n\n* Proposal for UX Overhaul Ian Brooks proposed adopting a more food-based, DoorDash/Uber Eats type of UX, rather than the current functional organization, which is not how people shop for food (00:09:39). Ian Brooks suggested organizing recipes by \"restaurants\" like \"the sushi restaurant at HelloFresh\" and allowing recipes to dynamically group into multiple categories to inspire exploration, moving away from a format where every recipe fits in only one bucket (00:10:48). Ian Brooks argued that the current UX is a \"mistake born of hubris\" because they are attempting to reinvent the UX when customers are already accustomed to the standard grocery or food ordering platform experiences, despite holding only a 1% share of weeknight dinners in their market (00:13:17).\n\n* Creator Platform/Marketplace Leadership and Potential Nikita Gorshkov raised the topic of the creator program/marketplace, confirming the leaders for the Canada side will be Lineia Serisma for product strategy and Cole Banning for growth, with Melanie Schmidt handling the project management (00:17:40). Nikita Gorshkov reported that the initial creator interviews showed a \"generically positive response,\" exceeding the positivity seen \n\n\n\n: I can be involved. I'm happy to be involved. Um, and and play whatever role you guys want me to play.\n\nNikita Gorshkov: The reality is like the why I was thinking for for you to be that champion or ombbudsman for for the international markets is that would allow a um to consolidate some of those requirements or or at least sell\n\n \n\n \n\n00:30:11\n\n \n\nIan Brooks: Yeah.\n\nNikita Gorshkov: some of the bigger bets that we have uh to those markets. and therefore increase that you know the weight of any requests that's coming from them and number two is that I know that Canada and you yourself are all always game for new experiments and big bets whereas not all the markets are equipped to or don't necessarily always think about this in that way like Mhm.\n\nIan Brooks: No, I hear you. I hear you. So maybe maybe what you do is you propose that it's a rotating kind of chair type of thing. The concern I have I'm happy to do it. Okay, let me start with that. I'm happy to do it. I see your point and I'm happy to play ball. Um, maybe that's good enough for people. If it's not good enough for people, then we could set it up to be like it's going to rotate every year. someone else is going to be the delegate from the non US markets and but I would I would almost want you to tell me what you want me to do.\n\nNikita Gorshkov: H. M okay I see I need to run right now I'll consolidate a proposal in terms of how I see uh this input of new items working because right now it's all a bit of a free-for-all and then out of left field it gets convinced by somebody\n\nIan Brooks: Yeah.\n\nNikita Gorshkov: that something is a priority and then it becomes a priority for us. I don't want to have this as outside of our visibility or control and I want to have like this as a more like clear and have that flexibility of like if I need the six people for the for\n\nIan Brooks: Yeah.\n\nNikita Gorshkov: Q3 to work on influencer marketplace, I want to have the structure in place to actually invest into it and go forward rather than um you know just because we agreed to\n\nIan Brooks: Right. And so you know la last thought as you go and I want to have the ability to increase your resource level when things go well. Right. Right. Exactly.\n\n \n\n \n\nTranscription ended after 00:32:54\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-.md",
      "source_date": "2025-12-05",
      "doc_type": "one_on_one",
      "matched_topics": [
        "market innovation"
      ],
      "matched_people": [
        "nikita"
      ],
      "filter_score": 2
    },
    {
      "title": "Beatrice:Nikita 1:1 - 2025/12/18 18:07 CET - Notes by Gemini",
      "doc_id": "10VRgNBBiN6jDd3j9LlVvR3e269mwizvS3N1mePeM9IY",
      "link": "https://docs.google.com/document/d/10VRgNBBiN6jDd3j9LlVvR3e269mwizvS3N1mePeM9IY/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 18, 2025\n\nBeatrice:Nikita 1:1\n\nInvited Beatrice Dimarucut Nikita Gorshkov\n\nAttachments Beatrice:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nA summary wasn't produced for this meeting because there wasn't enough conversation in a supported language.\n\n\n\nIf the meeting was transcribed, you can review the transcript linked in the meeting records section of this document.\n\n\n\nVisit the help center for troubleshooting information\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\nDetails weren't produced for this meeting.\n\n\n\n\n\nSuggested next steps\n\nNo suggested next steps were found for this meeting.\n\n\n\n\n\nYou should review Gemini's notes to make sure they're accurate. Get tips and learn how Gemini takes notes\n\nPlease provide feedback about using Gemini to take notes in a short survey.\n\n📖 Transcript\n\nDec 18, 2025\n\nBeatrice:Nikita 1:1 - Transcript\n\n00:00:00\n\n \n\nNikita Gorshkov: director. Watching for f***. Boom.\n\n \n\n \n\nTranscription ended after 00:11:58\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-19-.md",
      "source_date": "2025-12-19",
      "doc_type": "one_on_one",
      "matched_topics": [],
      "matched_people": [
        "beatrice",
        "nikita"
      ],
      "filter_score": 2
    },
    {
      "title": "Maria:Nikita 1:1 - 2025/12/22 15:58 CET - Notes by Gemini",
      "doc_id": "1r3fMFixOVEOuKvoMFlGdX4kq2X1sJ8y1OEkZRU2smLA",
      "link": "https://docs.google.com/document/d/1r3fMFixOVEOuKvoMFlGdX4kq2X1sJ8y1OEkZRU2smLA/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 22, 2025\n\nMaria:Nikita 1:1\n\nInvited Maria Chelminska Nikita Gorshkov\n\nAttachments Maria:Nikita 1:1 Notes by Gemini \n\n\n\n\n\nSummary\n\nMaria Chelminska and Pritique are dividing Q1 initiatives, and Maria Chelminska is starting a conversion-only test with Beam, with the concern of its placement in the funnel being too late at checkout, which led Nikita Gorshkov to suggest earlier, dynamic messaging handled by Pritique. Maria Chelminska is also prioritizing dashboard changes with Reina and Prateique, and while Nikita Gorshkov explained the rotational ownership and incremental targets of the CVR program, Maria Chelminska raised concerns about the impact of channel mix, which Nikita Gorshkov suggested mitigating with static customer samples for \"product-led CVR.\"\n\n\n\n\n\nDetails\n\n* Q1 Initiatives and Division of Labor Maria Chelminska provided an update on diving into Q1 initiatives and the split of these initiatives between themself and Pritique. Maria Chelminska noted that the roadmap item details page has been updated to show Q1 and early Q2 projects, including a division of responsibility, and the intent is to keep this documentation current with PRDs.\n\n* Beam Initiative and Conversion Testing Maria Chelminska is initiating a test with Beam, which will be limited to conversion only, not implementing anything in the active experience despite their product availability. The process will be somewhat manual, involving monthly information sharing with Beam on user conversions, chosen charity, full price, and payment amount, which will then result in an invoice from Beam. This approach is intended to test the impact on conversion, as most gains are expected there.\n\n* Beam Placement in the Funnel Maria Chelminska raised a concern about when to start mentioning Beam in the funnel, suggesting the natural place would be checkout (address or payment), but it might be too late in the process if placed on the payment page. Nikita Gorshkov initially suggested the payment page, but Maria Chelminska noted the address page has a higher drop-off rate, about 30% from address to payment, and 60% from payment to conversion, according to November data.\n\n* Strategy for Dynamic Messaging in the Funnel Nikita Gorshkov agreed that Beam should be mentioned earlier and proposed that Pritique could work on a system for dynamic messaging within the funnel to show messages based on customer profiles and origins. While the current Beam test can sacrifice some upstream proofing or messaging, the future plan involves dynamic banners or reinforcements to better communicate value. Maria Chelminska had similar ideas, such as placing the message in one of the loading states or as a reinforcement message after a user answers a question, such as about the dog's activity level.\n\n* Dashboard Changes and Priority Maria Chelminska is working on a PRD for dashboard changes, which includes many potential improvements over two sprints (four weeks in total), and they are meeting with Reina and Prateique to discuss priorities. Nikita Gorshkov supported making brand-specific changes to ensure success, even if it delays unification, and noted that this initiative is also a retention topic. The goal is to prioritize ideas and get an understanding of whether they are high priority or not worth pursuing.\n\n* CVR Program Ownership and Targets Nikita Gorshkov explained the CVR program ownership structure, which includes setting six-week or quarterly incremental targets for increasing CVR. The program owner can rotate, and two programs will run in parallel, with the responsible person executing and achieving the set objective for the period. It is intended that the program management side should not take more than about a third of the owner's time.\n\n* Mitigating Channel Mix Impact on CVR Targets Maria Chelminska expressed concern that CVR is highly dependent on channel mix, which they are not managing, pointing out that changes in budget allocation to different channels (like Apploving) could significantly impact CVR. Nikita Gorshkov suggested ways to work around this, such as using settled conversions, micro conversions, or setting a static channel mix (like organic traffic). They also proposed working with RPAs to create a representative but static sample of customers to calculate an artificial \"product-led CVR\" that is less affected by budget variability.\n\n* Holiday Plans and Congratulations Maria Chelminska is traveling to Cape Town from the 26th to the 5th and is spending Christmas in Berlin. Maria Chelminska also congratulated Nikita Gorshkov on their promotion.\n\n\n\n\n\nSuggested next steps\n\n* Nikita Gorshkov will work with RPAs to figure out how to create a representative but static sample of customers to work with the artificial CVR.\n\n* Maria Chelminska will meet with Reina and Prateique to discuss the priorities for the dashboard changes.\n\n\n\n\n\nYou should review Gemini's notes to make sure they're accurate. Get tips and learn how Gemini takes notes\n\nPlease provide feedback about using Gemini to take notes in a short survey.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-23-.md",
      "source_date": "2025-12-23",
      "doc_type": "one_on_one",
      "matched_topics": [],
      "matched_people": [
        "maria",
        "nikita"
      ],
      "filter_score": 2
    }
  ],
  "doc_count": 10,
  "total_chars": 45961
}