{
  "batch_id": "one_on_one_005",
  "doc_type": "one_on_one",
  "documents": [
    {
      "title": "Hamed:Nikita 1:1 - 2025/12/18 17:25 CET - Notes by Gemini",
      "doc_id": "1pFLm4CpL8OJYNI0YPBxf2GW1PL-JLx9G2X51hj4ydHg",
      "link": "https://docs.google.com/document/d/1pFLm4CpL8OJYNI0YPBxf2GW1PL-JLx9G2X51hj4ydHg/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 18, 2025\n\nHamed:Nikita 1:1\n\nInvited Nikita Gorshkov Hamed Karimian\n\nAttachments Hamed:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nHamed Karimian and Nikita Gorshkov discussed redesigning the product detail page (PDP) to ensure key components like \"subscribe and save\" and \"onetime purchase\" are visible above the fold by reducing element size and repositioning items; Nikita Gorshkov stressed confirming the visible frame size with Michael. The participants addressed the need for image consistency across PDPs and debated adopting a more creative, lifestyle-oriented approach to imagery, similar to Apple's design, rather than the current functional e-commerce carousel, with Hamed Karimian agreeing to explore more creative PDP ideas with Michael. Nikita Gorshkov challenged the existing feasibility constraints, encouraging boldness, and recommended involving engineers early in creative discussions to facilitate the implementation of new ideas.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Product Page Design and Visibility Hamed Karimian and Nikita Gorshkov discussed changes to the product detail page (PDP) design, particularly moving the review section and ensuring key components like \"subscribe and save\" (SNS) and \"onetime purchase\" (OTP) are visible above the fold without scrolling (00:00:00). Hamed Karimian mentioned reducing the size of elements, changing font size, and moving items up to create sufficient space for important details. Nikita Gorshkov stressed the need to confirm the visible frame size with Michael to ensure the design effectively places these details in the default view (00:01:45).\n\n* PDP Image and Consistency Updates Hamed Karimian highlighted the need to update images for clarity and consistency across the three product detail pages, noting that the current setup lacks uniformity. Nikita Gorshkov questioned the value of the proposed images, agreeing that lifestyle imagery is important for the brand but suggesting the current use of a product carousel, similar to an e-commerce platform like Wayfair, feels too functional and not lifestyle-oriented enough for a can of creatine (00:02:36).\n\n* Exploring More Creative Imagery and Lifestyle Integration Nikita Gorshkov encouraged a more creative approach to imagery, suggesting moving away from a purely e-commerce feel to better convey a lifestyle, similar to the approach seen on Apple's website (00:05:13). Hamed Karimian noted that constraints related to feasibility and implementation timeline led to the decision to keep design changes minimal, which was a concern since replicating certain advanced designs could take at least half a year (00:07:36). Nikita Gorshkov advocated for aiming high, using the \"overtone windows\" concept to encourage more ambitious design exploration (00:12:23).\n\n* Recommendations for Image Display and Implementation Nikita Gorshkov proposed integrating images more seamlessly with the overall page experience, suggesting displaying the product on a white background that blends into the page and using more visible control elements for image scrolling (00:10:22). They also suggested having more close-up, engaging images and incorporating video content, which Hamed Karimian supported (00:11:26). Hamed Karimian agreed to work with Michael to explore more creative ideas for the PDP page (00:13:31).\n\n* Challenging Constraints and Fostering Boldness Nikita Gorshkov acknowledged the constraints but challenged the current limitations, arguing that the team should be bolder and use the current opportunity (specifically within VMS) to try new stu\n\n\n\nl ask uh I mean I'll work with Michael to explore a little bit more creative ideas for this PDP page as as we\n\n \n\n \n\n00:13:31\n\n \n\nNikita Gorshkov: H\n\nHamed Karimian: are you know spending some time on it and uh see what we can\n\nNikita Gorshkov: and honestly bring to those discussions uh pants as well.\n\nHamed Karimian: Dohm.\n\nNikita Gorshkov: um like in a lot of cases you can actually like what I found is for bringing the engineers early on like they're they're engaged in the process and they're like oh yeah like well we can't do that exactly but maybe we can do something like this it's like facilitating that creative process\n\nHamed Karimian: Gotcha. Yeah, I'm I'm I'm down with all of these changes. You know, when I joined, I had a lot of high, you know, a lot of ideas that I had in mind to share, you know, to make it more of a lifestyle brand, make it more like dualingo like uh features and so on. But the more I worked over here, the more I realized, you know, how constrainted we are with the\n\nNikita Gorshkov: Well,\n\nHamed Karimian: techn\n\nNikita Gorshkov: this is what I'm trying to challenge and I I'm like I I've been trying to challenge this for some time and like the only way we get to certain progress is if we say that okay, this doesn't work for us at the moment. s there might be very strong arguments of why we're doing certain things\n\nHamed Karimian: Mhm.\n\nNikita Gorshkov: and I think in TPT and in good shop it kind of like honestly I'm happy with the TPT design in a lot of cases um but like with good good chop less so I I think we need to do much more but we never like anyway long story short uh didn't work out there but I because there are certain risks like upsetting the cards and upsetting the balance is tricky VMS doesn't have that trans restriction because we need to try new stuff and um yeah we need to try new\n\nHamed Karimian: Mhm.\n\nNikita Gorshkov: stuff. So well let's use this window of opportunity for us um yeah to to be bold and I think that will be also good uh good thing for the team as\n\nHamed Karimian: Sure. Yep.\n\nNikita Gorshkov: well.\n\nHamed Karimian: Sounds good. Thanks, man. Thanks for all the good feedback.\n\nNikita Gorshkov: Easy. Cool.\n\nHamed Karimian: Awesome.\n\n \n\n \n\nTranscription ended after 00:15:54\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-18-01.md",
      "source_date": "2025-12-18",
      "doc_type": "one_on_one",
      "matched_topics": [
        "good chop",
        "tpt",
        "vms",
        "otp"
      ],
      "matched_people": [
        "hamed",
        "nikita"
      ],
      "filter_score": 6
    },
    {
      "title": "Hamed:Nikita 1:1 - 2025/12/18 17:25 CET - Notes by Gemini",
      "doc_id": "1pFLm4CpL8OJYNI0YPBxf2GW1PL-JLx9G2X51hj4ydHg",
      "link": "https://docs.google.com/document/d/1pFLm4CpL8OJYNI0YPBxf2GW1PL-JLx9G2X51hj4ydHg/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 18, 2025\n\nHamed:Nikita 1:1\n\nInvited Nikita Gorshkov Hamed Karimian\n\nAttachments Hamed:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nHamed Karimian and Nikita Gorshkov discussed redesigning the product detail page (PDP) to ensure key components like \"subscribe and save\" and \"onetime purchase\" are visible above the fold by reducing element size and repositioning items; Nikita Gorshkov stressed confirming the visible frame size with Michael. The participants addressed the need for image consistency across PDPs and debated adopting a more creative, lifestyle-oriented approach to imagery, similar to Apple's design, rather than the current functional e-commerce carousel, with Hamed Karimian agreeing to explore more creative PDP ideas with Michael. Nikita Gorshkov challenged the existing feasibility constraints, encouraging boldness, and recommended involving engineers early in creative discussions to facilitate the implementation of new ideas.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Product Page Design and Visibility Hamed Karimian and Nikita Gorshkov discussed changes to the product detail page (PDP) design, particularly moving the review section and ensuring key components like \"subscribe and save\" (SNS) and \"onetime purchase\" (OTP) are visible above the fold without scrolling (00:00:00). Hamed Karimian mentioned reducing the size of elements, changing font size, and moving items up to create sufficient space for important details. Nikita Gorshkov stressed the need to confirm the visible frame size with Michael to ensure the design effectively places these details in the default view (00:01:45).\n\n* PDP Image and Consistency Updates Hamed Karimian highlighted the need to update images for clarity and consistency across the three product detail pages, noting that the current setup lacks uniformity. Nikita Gorshkov questioned the value of the proposed images, agreeing that lifestyle imagery is important for the brand but suggesting the current use of a product carousel, similar to an e-commerce platform like Wayfair, feels too functional and not lifestyle-oriented enough for a can of creatine (00:02:36).\n\n* Exploring More Creative Imagery and Lifestyle Integration Nikita Gorshkov encouraged a more creative approach to imagery, suggesting moving away from a purely e-commerce feel to better convey a lifestyle, similar to the approach seen on Apple's website (00:05:13). Hamed Karimian noted that constraints related to feasibility and implementation timeline led to the decision to keep design changes minimal, which was a concern since replicating certain advanced designs could take at least half a year (00:07:36). Nikita Gorshkov advocated for aiming high, using the \"overtone windows\" concept to encourage more ambitious design exploration (00:12:23).\n\n* Recommendations for Image Display and Implementation Nikita Gorshkov proposed integrating images more seamlessly with the overall page experience, suggesting displaying the product on a white background that blends into the page and using more visible control elements for image scrolling (00:10:22). They also suggested having more close-up, engaging images and incorporating video content, which Hamed Karimian supported (00:11:26). Hamed Karimian agreed to work with Michael to explore more creative ideas for the PDP page (00:13:31).\n\n* Challenging Constraints and Fostering Boldness Nikita Gorshkov acknowledged the constraints but challenged the current limitations, arguing that the team should be bolder and use the current opportunity (specifically within VMS) to try new stu\n\n\n\nl ask uh I mean I'll work with Michael to explore a little bit more creative ideas for this PDP page as as we\n\n \n\n \n\n00:13:31\n\n \n\nNikita Gorshkov: H\n\nHamed Karimian: are you know spending some time on it and uh see what we can\n\nNikita Gorshkov: and honestly bring to those discussions uh pants as well.\n\nHamed Karimian: Dohm.\n\nNikita Gorshkov: um like in a lot of cases you can actually like what I found is for bringing the engineers early on like they're they're engaged in the process and they're like oh yeah like well we can't do that exactly but maybe we can do something like this it's like facilitating that creative process\n\nHamed Karimian: Gotcha. Yeah, I'm I'm I'm down with all of these changes. You know, when I joined, I had a lot of high, you know, a lot of ideas that I had in mind to share, you know, to make it more of a lifestyle brand, make it more like dualingo like uh features and so on. But the more I worked over here, the more I realized, you know, how constrainted we are with the\n\nNikita Gorshkov: Well,\n\nHamed Karimian: techn\n\nNikita Gorshkov: this is what I'm trying to challenge and I I'm like I I've been trying to challenge this for some time and like the only way we get to certain progress is if we say that okay, this doesn't work for us at the moment. s there might be very strong arguments of why we're doing certain things\n\nHamed Karimian: Mhm.\n\nNikita Gorshkov: and I think in TPT and in good shop it kind of like honestly I'm happy with the TPT design in a lot of cases um but like with good good chop less so I I think we need to do much more but we never like anyway long story short uh didn't work out there but I because there are certain risks like upsetting the cards and upsetting the balance is tricky VMS doesn't have that trans restriction because we need to try new stuff and um yeah we need to try new\n\nHamed Karimian: Mhm.\n\nNikita Gorshkov: stuff. So well let's use this window of opportunity for us um yeah to to be bold and I think that will be also good uh good thing for the team as\n\nHamed Karimian: Sure. Yep.\n\nNikita Gorshkov: well.\n\nHamed Karimian: Sounds good. Thanks, man. Thanks for all the good feedback.\n\nNikita Gorshkov: Easy. Cool.\n\nHamed Karimian: Awesome.\n\n \n\n \n\nTranscription ended after 00:15:54\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-19-.md",
      "source_date": "2025-12-19",
      "doc_type": "one_on_one",
      "matched_topics": [
        "good chop",
        "tpt",
        "vms",
        "otp"
      ],
      "matched_people": [
        "hamed",
        "nikita"
      ],
      "filter_score": 6
    },
    {
      "title": "Beatrice:Nikita 1:1 - 2025/12/19 15:46 CET - Notes by Gemini",
      "doc_id": "1cAk1bsDpMF5ZQozGLwk4Tl6ojlTNLdcQ5Jvfuw4doC0",
      "link": "https://docs.google.com/document/d/1cAk1bsDpMF5ZQozGLwk4Tl6ojlTNLdcQ5Jvfuw4doC0/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 19, 2025\n\nBeatrice:Nikita 1:1\n\nInvited Beatrice Dimarucut Nikita Gorshkov\n\nAttachments Beatrice:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nBeatrice Dimarucut and Nikita Gorshkov discussed improving product imagery, testing refunds for one-time purchases, and increasing allocation for Christmas due to working ad tech tracking. They agreed to prioritize finishing upsells and new dashboards despite the potential increase in pause or cancellation rates from displaying future deliveries, as the expected rise in Average Order Value (AOV) should compensate. Beatrice Dimarucut set a tentative January 20th launch date for One-Time Purchase (OTP) and raised concerns about running the OTP allocation and price value funnel test concurrently due to potential result interpretation difficulties, deciding to consult with Ferron from PA. Nikita Gorshkov shared updates on an upcoming external CS5 role posting and announced their own promotion, which will involve supporting New Ventures, additional teams, and a planned B2B topic push.\n\n\n\n\n\nDetails\n\n* Product Imagery and Facility Visit Beatrice Dimarucut shared that visiting the processing facilities was a cool experience and noted that the product looked better in person than in the images online. Nikita Gorshkov agreed that the issue might be with the imagery and photography used on the website, suggesting it needs to come through better (00:00:00).\n\n* Ad Tech, Refunds, and Allocation Beatrice Dimarucut mentioned that the ad tech tracking seems to be working and that they were preparing to test refunds for one-time purchases. They also considered increasing allocation over Christmas, and Nikita Gorshkov supported this, noting that allocation could always be decreased later and that there is still time until Christmas (00:01:06). Beatrice Dimarucut confirmed they would run another test today and asked Nikita Gorshkov when they would be off, to which they replied that they are \"always on\" (00:02:28).\n\n* Future Boxes Date Picker Implementation Beatrice Dimarucut brought up a thread from Maria about future boxes, which Nikita Gorshkov had already answered, noting it was related to changes in the dashboard (00:02:28). The discussion focused on using a date picker to display the next box's date, as scrolling was deemed impractical due to the single view being too packed (00:03:27). Nikita Gorshkov advocated for thinking outside the box for design solutions, such as displaying the three key deliveries (past, current, future) more actionably instead of a traditional date picker component (00:04:15).\n\n* Dashboard Milestones and Pause Rates Nikita Gorshkov recognized that the display of future deliveries might increase pause or cancellation rates. However, they concluded that focusing on delivering the upsells and new dashboards first should remain the priority, as the expected increase in Average Order Value (AOV) might offset any negative impact on pause or cancellation rates (00:05:16).\n\n* One-Time Purchase Launch and Price Value Funnel Test Beatrice Dimarucut set a tentative new launch date of January 20th for One-Time Purchase (OTP) due to unfinished work like post-checkout and the order confirmation page. They also planned a price value funnel test, which involves changing either the price or the menu for different user groups (00:06:25). Beatrice Dimarucut expressed concern about running both the OTP allocation and the price value test in parallel, as both allocate on the plans page, raising questions about potential difficulty in interpreting the results due to interaction effec\n\n\n\n\n\nBeatrice Dimarucut: it five?\n\nNikita Gorshkov: So, it's it's CS5. Yeah.\n\nBeatrice Dimarucut: Okay. Okay. Got\n\nNikita Gorshkov: and then we finalize your promo. Um,\n\nBeatrice Dimarucut: it.\n\nNikita Gorshkov: and yeah, then we're in a good spot. Oh, um, just FYI, because there's an email that's going to come out starting, uh, Monday, um, I got a promotion, so I think I would be able to serve you folks a bit more, um, with a bit more, uh, oomph.\n\n \n\n \n\n00:12:46\n\n \n\nNikita Gorshkov: I'll put like that. Uh,\n\nBeatrice Dimarucut: Congratulations.\n\nNikita Gorshkov: so yeah,\n\nBeatrice Dimarucut: That's amazing.\n\nNikita Gorshkov: thank you.\n\nBeatrice Dimarucut: I know this is also like um it didn't go through like last uh last time, right? Congratulations.\n\nNikita Gorshkov: Yeah,\n\nBeatrice Dimarucut: That's awesome.\n\nNikita Gorshkov: thanks.\n\nBeatrice Dimarucut: Um is your scope changing?\n\nNikita Gorshkov: Well, the scope has already changed, so it's still going to be new ventures.\n\nBeatrice Dimarucut: Oh, yeah. Okay.\n\nNikita Gorshkov: We have that bigger team,\n\nBeatrice Dimarucut: Okay.\n\nNikita Gorshkov: but we to be fair, I'm anticipating that we're going to have probably two more teams uh dropping into our space in the next year. We have an M&A case that's going to drop in with also with a PM, and there's a bunch of things that we need to do.\n\nBeatrice Dimarucut: Interesting.\n\nNikita Gorshkov: And there is going to be I am looking into the tea leaves and I'm assuming that there's uh a B2B topic that's going to be pushed through but I'm going to like I'm going to firewall this whole thing so that anything B2B related anything to do with Adam and Park on B2B or uh foods will be isolated and something um so\n\nBeatrice Dimarucut: Uh, okay. Because it won't like as in you're going to try to get a dedicated squad to it.\n\nNikita Gorshkov: Yeah, exactly. I need separate funding.\n\nBeatrice Dimarucut: Okay.\n\nNikita Gorshkov: I don't want like it it has a tendency like to eat any resource that you throw at\n\nBeatrice Dimarucut: Yeah.\n\nNikita Gorshkov: it and despise.\n\nBeatrice Dimarucut: Yeah. Yeah.\n\nNikita Gorshkov: All right, I need to jump to talk with Laurel. Uh, no, with Laura. Thank you. Thank you.\n\n \n\n \n\nTranscription ended after 00:14:17\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-19-01.md",
      "source_date": "2025-12-19",
      "doc_type": "one_on_one",
      "matched_topics": [
        "new ventures",
        "otp",
        "one-time purchase"
      ],
      "matched_people": [
        "beatrice",
        "maria",
        "nikita"
      ],
      "filter_score": 6
    },
    {
      "title": "Hamed:Nikita 1:1 - 2025/12/05 17:41 CET - Notes by Gemini",
      "doc_id": "1CtMnCPd3ICKq1SZmSXGjjd2WXqmCVFpvxP280qSwkp8",
      "link": "https://docs.google.com/document/d/1CtMnCPd3ICKq1SZmSXGjjd2WXqmCVFpvxP280qSwkp8/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 5, 2025\n\nHamed:Nikita 1:1\n\nInvited Nikita Gorshkov Hamed Karimian\n\nAttachments Hamed:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nHamed Karimian and Nikita Gorshkov reviewed the OTP launch timeline, with Nikita Gorshkov recommending pushing the full launch to Monday of week two to mitigate risks associated with limited team bandwidth and outstanding items in week 51. Hamed Karimian and Nikita Gorshkov also discussed the broken mobile app prototype link and factor app ownership, with Nikita Gorshkov suggesting Laura and the shopping experience leadership as the primary contact for design alignment; Hamed Karimian confirmed he would reach out to them and also meet with Dio and Alisa. Finally, Hamed Karimian updated Nikita Gorshkov on the decision by Samir and Allison to implement Shopify redirects to prevent multiple accounts across the two websites, which Nikita Gorshkov agreed to maintain given the small expected impact.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* OTP Launch Planning and Timeline Hamed Karimian discussed the One-Time Password (OTP) launch, presenting the original plan for a week 51 launch for 90% of users despite risks due to proximity to year-end dates, as well as an option for a soft launch or launching in week two. Hamed Karimian and Nikita Gorshkov reviewed historical traffic data, with Nikita Gorshkov suggesting that due to the calendar year, week one would still see low traffic, making week two a less impactful time for launching compared to last year's data (00:03:55). Nikita Gorshkov ultimately recommended pushing the full launch to Monday of week two, doing a full launch rather than a soft launch, to mitigate risks associated with the limited team bandwidth and outstanding items in week 51 (00:05:20).\n\n* Mobile App Prototype and Ownership Alignment Hamed Karimian mentioned that the link to the full-functioning mobile app prototype was broken, but they had presented it in an \"early and often\" meeting and would share the updated link from Michael in the next call (00:07:35). Hamed Karimian asked about the owner of the factor app to align designs, and Nikita Gorshkov indicated that the ownership is distributed, suggesting that the shopping experience leadership, specifically Laura for merchandising components and add-to-cart rate, would be the primary contact (00:09:01). Hamed Karimian confirmed they will reach out to them and also have a meeting with Dio and Alisa from the shopping experience team to ensure the prototype does not interfere with the factor side or factor app designs (00:10:19).\n\n* Shopify Redirects Compromise Hamed Karimian updated Nikita Gorshkov on the decision by Samir and Allison to implement Shopify redirects, which creates a disjointed experience where net new users from legacy pages are redirected to Shopify, and existing users with Factor accounts who land on Shopify are redirected back to the legacy page (00:11:59). This compromise was adopted because the main challenge was prioritizing not having multiple accounts across the two websites, especially to ensure users see their Factor subscriptions and past orders (00:13:08). Hamed Karimian noted that they have tracking in place to monitor the number of redirects, and Nikita Gorshkov agreed to keep the current setup since it is expected to affect only a small percentage of users (00:14:29).\n\n\n\n\n\nSuggested next steps\n\n* The group will have all end-to-end testing and everything ready for the OTP launch by the end of week 51.\n\n* The group will turn on the feature flag for the OTP launch in week two.\n\n\n\n\n\nYou should review\n\n\n\nn I find the Shopify website from any like paid channel or anything and then I log into that and I don't see any of my subscriptions any of my\n\nNikita Gorshkov: From there. Yep.\n\nHamed Karimian: past orders and so on I'm like, \"Oh, I did have some subscriptions. I\n\nNikita Gorshkov: Mhm.\n\nHamed Karimian: just got a box yesterday. Where did that go?\" So, the plan is to redirect them back to the legacy page so they can It's not for factor males, it's for factor form.\n\n \n\n \n\n00:14:29\n\n \n\nNikita Gorshkov: But why not then have a notes that uh for your factor meals go to X.\n\nHamed Karimian: So if they have a factor form subscription, right, and they go to Shopify, they won't see that.\n\nNikita Gorshkov: Okay. Yes. Wait. And you're selecting so basically you're checking if there's a factor accounts that has a particular plan type.\n\nHamed Karimian: Correct.\n\nNikita Gorshkov: H interesting. Okay.\n\nHamed Karimian: Yeah. And we are you know we have some tracking on it as well. So we can monitor the number of people who are being redirected from one to the other. If that number is high we need to probably think about an alternative solution.\n\nNikita Gorshkov: H. Huh.\n\nHamed Karimian: But hypothetically it should just affect a small percentage of our users because you know from all all the SEO channels from all the organic ones you know anything we are sending all the net new users to the Shopify website and then whoever is on the legacy page is technically the ones who already have an uh active factor subscription like me subscription So yeah, it should be fine for probably maybe 95\n\nNikita Gorshkov: Mhm. Okay.\n\nHamed Karimian: plus percentage of the users if not more.\n\nNikita Gorshkov: Okay. Let's keep it as is right now. At the end of the day, it's not going to impact too many people overall.\n\nHamed Karimian: Sure.\n\nNikita Gorshkov: So, and yeah, we maybe we'll come up with a better idea. I don't have a better idea right now. Cool. Okay. All right, man. I'm going to run.\n\nHamed Karimian: Okay. Any anything else on on your end? Anything from\n\nNikita Gorshkov: No. Oh, good. My man, thank you so much. You were super quick on on the road map stuff. So, the whole um workshop yesterday went really well.\n\n \n\n \n\nTranscription ended after 00:16:57\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-.md",
      "source_date": "2025-12-05",
      "doc_type": "one_on_one",
      "matched_topics": [
        "factor form",
        "otp"
      ],
      "matched_people": [
        "hamed",
        "allison",
        "nikita"
      ],
      "filter_score": 5
    },
    {
      "title": "Maria:Nikita 1:1 - 2025/12/09 15:17 CET - Notes by Gemini",
      "doc_id": "1kXfIN_jlJSZRrC6ErpvfjZOzFdyshJngx60nutEwqGI",
      "link": "https://docs.google.com/document/d/1kXfIN_jlJSZRrC6ErpvfjZOzFdyshJngx60nutEwqGI/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 9, 2025\n\nMaria:Nikita 1:1\n\nInvited Maria Chelminska Nikita Gorshkov\n\nAttachments Maria:Nikita 1:1 \n\n\n\n\n\nSummary\n\nNikita Gorshkov provided updates on PA support, noting Simon's increased visibility and contingent interviews with five independent contractors, while Maria Chelminska confirmed Tishia would be dedicated to TPT, Good Job, and VMS if hired. Maria Chelminska is working on business cases to provide evidence for OKR numbers, with Nikita Gorshkov emphasizing CVA impact over strict numerical accuracy, and Maria Chelminska expecting to understand overall goal achievement by the end of the current week. Maria Chelminska raised the long time to significance for experiments, with Farane suggesting the use of leading indicators or micro conversions to shorten this time, which Maria Chelminska noted would require more PA support and could face pushback, but Nikita Gorshkov agreed it makes sense for small experiments. Maria Chelminska stressed the need for an analyst to translate micro conversion impact to key metrics, but Nikita Gorshkov suggested focusing on overall business numbers like net revenue, AOU, and weekly active users, making assumptions about correlations between metrics.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Staffing and PA Support Updates Nikita Gorshkov provided an update on the PA front, noting that Simon, a senior, in-house FT PA, is becoming more visible after onboarding, with Eva having shielded them from direct interaction. They are also speaking with Tishia to finalize budget matters, and have five independent contractors lined up for interviews as a contingency. Maria Chelminska confirmed that Tishia, if hired, would be dedicated to TPT, Good Job, and VMS.\n\n* OKR Tracking and CVA Impact Nikita Gorshkov emphasized focusing on achieving CVA impact rather than strict OKR numbers, stating that the numerical accuracy can be within a range of plus or minus 25% to 50%. Maria Chelminska is still working to look into things, run business cases, and provide evidence for the numbers, noting that the first CVR initiative was achieved months ago. Maria Chelminska expects to have a good understanding of whether the overall goal is achieved by the end of the current week by calculating the impact of the most valid launches.\n\n* Experimentation and Shortening Time to Significance Maria Chelminska raised the issue of experimentation, noting that they discussed with Farane, Alex's manager, the current challenge of waiting six to eight weeks to reach significance for experiments. The interaction effects initially explored do not solve the problem of long allocation time to experiments. Farane suggested focusing on potential levers to shorten this time, primarily by using leading indicators or micro conversions as the main metric instead of, for example, CVR improvement, which would make the Minimum Detectable Effect (MDE) easier to detect.\n\n* Implementation of Micro Conversions and Potential Pushback Maria Chelminska noted that implementing micro conversions would require more PA support to set up the new metrics in static, which they have not done before. They also cautioned that micro conversions cannot always be used, citing price testing as an example where the impact affects the entire funnel, and they expect pushback on this approach. Nikita Gorshkov agreed that not all experiments are equal; critical experiments still need the actual conversion rate or revenue data, but for small experiments with high confidence and relatively small impact, focusing on the micro conversion at that step makes sense.\n\n* Connecting Micro Conversions to Business Outcomes Maria Chelminska emphasized the need for an analyst to translate the impact of micro conversions into expected CVR or other key metric impacts, noting that a percentage increase in a micro conversion doesn't directly translate to the same increase in the overall conversion rate. Nikita Gorshkov suggested taking a step back and focusing on the overall business numbers, such as net revenue, AOU, and weekly active users, making the assumption that if, for example, they decrease cancellation rates, it should correlate with a higher AOU, as long as everyone aligns on this assumption. The OKRs are now focused on more trackable things like RPU or weekly active users, with net revenue as the ultimate north star.\n\n\n\n\n\nSuggested next steps\n\n* Maria Chelminska will look into things, run the business cases, and make evidence on the OKR numbers by calculating the launches in the doc that are the most valid and have the biggest expected impact, to understand if the OKR is done this week.\n\n\n\n\n\nYou should review Gemini's notes to make sure they're accurate. Get tips and learn how Gemini takes notes\n\nPlease provide feedback about using Gemini to take notes in a short survey.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-04.md",
      "source_date": "2025-12-09",
      "doc_type": "one_on_one",
      "matched_topics": [
        "tpt",
        "vms"
      ],
      "matched_people": [
        "maria",
        "alex",
        "nikita"
      ],
      "filter_score": 5
    },
    {
      "title": "Sameer:Nikita 1:1 - 2025/12/09 17:27 CET - Notes by Gemini",
      "doc_id": "1AvoECK4OlerEh_0APJGXjxtCp_kEy7MEvRFNheyhM54",
      "link": "https://docs.google.com/document/d/1AvoECK4OlerEh_0APJGXjxtCp_kEy7MEvRFNheyhM54/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 9, 2025\n\nSameer:Nikita 1:1\n\nInvited Nikita Gorshkov Sameer Doda\n\nAttachments Sameer:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nSameer Doda informed Nikita Gorshkov about the unavailability of Leman for the rest of the year, the request for additional backend engineering resources, and the status of project threads, including the payments token, account creation, and a new task involving the bulk pausing of HelloFresh accounts. Sameer Doda also mentioned a scheduled meeting with Yolanta and Shay regarding phase two designs, the need to finalize the migration of credits approach, the development of a mirror board for the influencer marketplace, and ongoing work on the Shopify migration, while Nikita Gorshkov encouraged building rapport with Ian for initiative management. The meeting concluded with Sameer Doda confirming vacation time and discussing their and Nikita Gorshkov's respective plans for their babies' first Christmas and routine medical checks.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Personal Updates and Physical Activity Nikita Gorshkov shared that they had a good week and managed to run their fastest 10k in the last two to three years, attributing this partly to new Adidas Aero Evo SL sneakers. Sameer Doda expressed interest in looking into the sneakers, as they plan to start running soon, although they previously had not spent time running (00:00:00). Sameer Doda also mentioned their love for swimming and prior cycling experience, but noted that running would be a new endeavor (00:01:18).\n\n* Project Updates and Resource Allocation Sameer Doda informed Nikita Gorshkov that Leman would be out for the remainder of the year and that a request to carry over some of Leman's additional days was not possible (00:01:18). Sameer Doda has requested that Van sync with DA to explore securing additional backend engineering resources for the project. The main project threads include the payments token, for which a draft PR is awaiting review from the payments team, and the account creation process, which still needs work with the relevant teams. A new third task involves automatically pausing new HelloFresh accounts for the first two to three weeks, requiring a back-end solution for bulk pausing (00:02:21).\n\n* Phase Two and Migration of Credits Sameer Doda is scheduled to meet with Yolanta and Shay to discuss the phase two designs and gather front-end estimation of the work. Sameer Doda plans to contact the payments team again this week to finalize an approach for the migration of credits, an action that they need to coordinate and ensure is completed on time (00:03:14). Sameer Doda informed Jonathan and Terra from the local teams that an ETA on timelines would be provided in January, which they accepted (00:04:14).\n\n* Influencer Marketplace and Internal Positioning Sameer Doda mentioned they are working on a complete mirror board with customer journeys and wireframes for the influencer marketplace to facilitate alignment with senior stakeholders. Sameer Doda also intends to sync with Dio regarding the status of the voucher application for one-time purchases (00:04:14). Nikita Gorshkov encouraged Sameer Doda to build rapport with Ian, as Nikita Gorshkov is attempting to position Ian to act as an \"arbiter\" for bigger initiatives, helping to push ED toward them and manage market pressure (00:05:14).\n\n* Shopify Migration and Good Chop Strategy The Shopify migration for re-factor form is going well, and the team is almost finished. Sameer Doda is optimistic that the subsequent migration for good chop will be much quic\n\n\n\nanging approach this year is because it's going to be the first Christmas with the baby and so I just wanted to not have to just be disconnected and just enjoy the end of\n\nNikita Gorshkov: Okay. Yeah. Fair. Fair enough.\n\nSameer Doda: the year with the baby. So that that's the reason why I changed my approach for now two months tomorrow.\n\nNikita Gorshkov: I get that. How old is yours right now? Two months tomorrow. Nice. We're going to be one month on Friday.\n\nSameer Doda: Yeah. One month on Friday. Yeah. We've got to take him for his vaccination tomorrow. So, I'm not sure how he's going to react, but fingers crossed.\n\n \n\n \n\n00:11:18\n\n \n\nNikita Gorshkov: Yeah. Fair. Fair.\n\nSameer Doda: Yeah.\n\nNikita Gorshkov: All right. Uh oh, and we have our um hipbone scan uh on Thursday.\n\nSameer Doda: What's that? It's not something that happens in in Canada.\n\nNikita Gorshkov: Uh basically like in so what they do is they uh check if the hips are developing correctly so that uh like you don't need additional braces and stuff like that as early as possible. uh that you know they're in the right positions and doing all the stuff. And that's essentially it.\n\nSameer Doda: Oh, that's interesting because it's it's a big difference. Uh if it's something that's done there and it's not even talked about in in Canada. Uh, I'll if it's a thing in Europe, I'll probably ask my pediatrician because she used to work in the UK, so she might have I mean she might remember it from her days in UK, but I\n\nNikita Gorshkov: Uh ask ask if it makes sense. Like at least in Germany this is a thing. We had a couple of friends who had to had have braces. I think in the past uh what was done is when they wrapped all of the people so f****** tightly that so that that made the the legs straight.\n\nSameer Doda: Yeah.\n\nNikita Gorshkov: Uh now they just do uh sort of a scan that uh everything's fine.\n\nSameer Doda: Yeah, my mom my mom keeps on telling me that you need to tie his legs as well, which we which we never did. Um, but yeah, you're right. Maybe that's the reason. It's it's just a traditional knowledge that our parents had, which we don't have anymore and we opt for these fancy new swaddles that don't have the same effect. Yeah.\n\n \n\n \n\nTranscription ended after 00:13:09\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-10-.md",
      "source_date": "2025-12-10",
      "doc_type": "one_on_one",
      "matched_topics": [
        "good chop",
        "factor form",
        "one-time purchase"
      ],
      "matched_people": [
        "sameer",
        "nikita"
      ],
      "filter_score": 5
    },
    {
      "title": "Maria:Nikita 1:1 - 2025/12/09 15:17 CET - Notes by Gemini",
      "doc_id": "1kXfIN_jlJSZRrC6ErpvfjZOzFdyshJngx60nutEwqGI",
      "link": "https://docs.google.com/document/d/1kXfIN_jlJSZRrC6ErpvfjZOzFdyshJngx60nutEwqGI/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 9, 2025\n\nMaria:Nikita 1:1\n\nInvited Maria Chelminska Nikita Gorshkov\n\nAttachments Maria:Nikita 1:1 \n\n\n\n\n\nSummary\n\nNikita Gorshkov provided updates on PA support, noting Simon's increased visibility and contingent interviews with five independent contractors, while Maria Chelminska confirmed Tishia would be dedicated to TPT, Good Job, and VMS if hired. Maria Chelminska is working on business cases to provide evidence for OKR numbers, with Nikita Gorshkov emphasizing CVA impact over strict numerical accuracy, and Maria Chelminska expecting to understand overall goal achievement by the end of the current week. Maria Chelminska raised the long time to significance for experiments, with Farane suggesting the use of leading indicators or micro conversions to shorten this time, which Maria Chelminska noted would require more PA support and could face pushback, but Nikita Gorshkov agreed it makes sense for small experiments. Maria Chelminska stressed the need for an analyst to translate micro conversion impact to key metrics, but Nikita Gorshkov suggested focusing on overall business numbers like net revenue, AOU, and weekly active users, making assumptions about correlations between metrics.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Staffing and PA Support Updates Nikita Gorshkov provided an update on the PA front, noting that Simon, a senior, in-house FT PA, is becoming more visible after onboarding, with Eva having shielded them from direct interaction. They are also speaking with Tishia to finalize budget matters, and have five independent contractors lined up for interviews as a contingency. Maria Chelminska confirmed that Tishia, if hired, would be dedicated to TPT, Good Job, and VMS.\n\n* OKR Tracking and CVA Impact Nikita Gorshkov emphasized focusing on achieving CVA impact rather than strict OKR numbers, stating that the numerical accuracy can be within a range of plus or minus 25% to 50%. Maria Chelminska is still working to look into things, run business cases, and provide evidence for the numbers, noting that the first CVR initiative was achieved months ago. Maria Chelminska expects to have a good understanding of whether the overall goal is achieved by the end of the current week by calculating the impact of the most valid launches.\n\n* Experimentation and Shortening Time to Significance Maria Chelminska raised the issue of experimentation, noting that they discussed with Farane, Alex's manager, the current challenge of waiting six to eight weeks to reach significance for experiments. The interaction effects initially explored do not solve the problem of long allocation time to experiments. Farane suggested focusing on potential levers to shorten this time, primarily by using leading indicators or micro conversions as the main metric instead of, for example, CVR improvement, which would make the Minimum Detectable Effect (MDE) easier to detect.\n\n* Implementation of Micro Conversions and Potential Pushback Maria Chelminska noted that implementing micro conversions would require more PA support to set up the new metrics in static, which they have not done before. They also cautioned that micro conversions cannot always be used, citing price testing as an example where the impact affects the entire funnel, and they expect pushback on this approach. Nikita Gorshkov agreed that not all experiments are equal; critical experiments still need the actual conversion rate or revenue data, but for small experiments with high confidence and relatively small impact, focusing on the micro conversion at that step makes sense.\n\n* Connecting Micro Conversions to Business Outcomes Maria Chelminska emphasized the need for an analyst to translate the impact of micro conversions into expected CVR or other key metric impacts, noting that a percentage increase in a micro conversion doesn't directly translate to the same increase in the overall conversion rate. Nikita Gorshkov suggested taking a step back and focusing on the overall business numbers, such as net revenue, AOU, and weekly active users, making the assumption that if, for example, they decrease cancellation rates, it should correlate with a higher AOU, as long as everyone aligns on this assumption. The OKRs are now focused on more trackable things like RPU or weekly active users, with net revenue as the ultimate north star.\n\n\n\n\n\nSuggested next steps\n\n* Maria Chelminska will look into things, run the business cases, and make evidence on the OKR numbers by calculating the launches in the doc that are the most valid and have the biggest expected impact, to understand if the OKR is done this week.\n\n\n\n\n\nYou should review Gemini's notes to make sure they're accurate. Get tips and learn how Gemini takes notes\n\nPlease provide feedback about using Gemini to take notes in a short survey.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-10-.md",
      "source_date": "2025-12-10",
      "doc_type": "one_on_one",
      "matched_topics": [
        "tpt",
        "vms"
      ],
      "matched_people": [
        "maria",
        "alex",
        "nikita"
      ],
      "filter_score": 5
    },
    {
      "title": "Prateek:Nikita 1:1 - 2025/12/09 10:45 CET - Notes by Gemini",
      "doc_id": "1cIVE2-Q7g2G28iQYEWZsJvnCa4gfFEeqwWeSyomyOf8",
      "link": "https://docs.google.com/document/d/1cIVE2-Q7g2G28iQYEWZsJvnCa4gfFEeqwWeSyomyOf8/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 9, 2025\n\nPrateek:Nikita 1:1\n\nInvited Nikita Gorshkov Prateek Jajoo\n\nAttachments Prateek:Nikita 1:1 \n\nMeeting records Transcript Recording \n\n\n\n\n\nSummary\n\nPrateek Jajoo experienced a Confluence page access issue, which was resolved by Nikita Gorshkov granting access to anonymous users, who also clarified the meeting's purpose is for Prateek Jajoo’s personal development, unblocking, and issue escalation, asking them to manage ETAs for the login page and app documentation. Prateek Jajoo updated on prioritizing login page features like text box visibility and language enhancement for conversion before Katrina's absence, seeking reviews from Nikita Gorshkov and Laura Doas this week, and also discussed deprioritizing social logins while raising concerns about the lack of recipe selection transparency on the checkout page, which Nikita Gorshkov agreed to test if inexpensive. Additionally, Prateek Jajoo sought clarity on the design review process with Laura Doas, with Nikita Gorshkov advising to consult Maria about the TPT experience preview or set up a separate small design review.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Access to Confluence Page Prateek Jajoo reported difficulty accessing the new tribe in Slide page on Confluence despite receiving an email confirming access (00:00:00). Nikita Gorshkov resolved the issue by granting access to anonymous users, which Prateek Jajoo found to be a \"big relief\" (00:01:13).\n\n* Personal Development and Project Management Nikita Gorshkov clarified that the purpose of their standing meeting is to discuss Prateek Jajoo’s personal development, unblock them, and escalate issues. They requested Prateek Jajoo to manage expectations regarding the ETA for work on the login page and the app documentation and plan (00:03:09).\n\n* Login Page Feature Prioritization and Review Prateek Jajoo provided an update on the login page work, focusing on frontloaded efforts due to Katrina's upcoming absence, which involved creating and prioritizing a list of features to improve conversion rates (00:04:25). The primary features prioritized for one sprint's work include improving the text box's visibility and making it more action-oriented, as well as enhancing the language's intent with emotional appeal and social proof (00:05:52). Prateek Jajoo intends to secure reviews from Nikita Gorshkov and Laura Doas this week to finalize designs before Katrina's departure, aiming for development in the second sprint (00:04:25).\n\n* Deprioritization of Social Login and Recipe Transparency Prateek Jajoo mentioned the deprioritization of social logins, citing data from other brands and the older demographic of their customer base as factors. They are, however, deep-diving into more data and plan to detail the rationale in a one-pager. Additionally, Prateek Jajoo raised a concern about the lack of recipe selection display on the checkout or payment page, proposing that adding transparency might improve completion rates (00:09:19). Nikita Gorshkov suggested the lack of display may have been due to complexity, but agreed that testing the feature, if inexpensive, would be worthwhile, as displaying the recipes could build additional confidence for customers at the point of highest commitment (00:10:29) (00:13:43).\n\n* Process for Design Review Prateek Jajoo sought clarity on the process for reviewing designs with the broader team, specifically requesting feedback from Laura Doas while Katrina is still available. Nikita Gorshkov advised checking with Maria about the TPT experience preview or setting up an independent small design re\n\n\n\ne customer or reduces the transparency or creates doubt kind of can lead the customer to uh not make the purchase but also we don't want to overload the customer as well. So that was a bit surprising but again I just wanted to understand the reasoning of it. So if you're right uh if it's in inexpensive maybe we can try to see if we can do right.\n\nNikita Gorshkov: I agree and honestly like you can display it in the sidebar and it's a feature that doesn't necessarily distract but essentially like I know the distraction argument but in this case I don't think it's necessarily applicable.\n\n \n\n \n\n00:15:08\n\n \n\nPrateek Jajoo: I think some things are expected and that expectation not meeting could lead to drop off.\n\nNikita Gorshkov: Yeah, exactly.\n\nPrateek Jajoo: Right. Uh okay cool. Uh I'll look into it uh get more transparent in into that argument. And uh the my question is look Katrina is going I think we are already to something and I want to make sure that uh she's able to provide us her time uh this week before going but I want\n\nNikita Gorshkov: H. Yep.\n\nPrateek Jajoo: to uh understand the process of how do we review or bring it to the broader team right I want uh Laura Das to give us the feedback so that any feedback could be actioned on before she goes so that we can we are good to go. Even if she doesn't have the time, we'll know what need what's the feedback.\n\nNikita Gorshkov: So we should be having uh so check with Maria regarding the TPT uh experience preview. Else you can set it up with Laurand Dovas etc. just on your own uh for a small design review. In some cases like in this case like it might be sufficient to have this async. So basically provide them give a justification and get their feedback that way. But if you want to do it live feel free. You also need to establish those relationships. So it's worth it uh doing it live.\n\nPrateek Jajoo: Perfect. I'm I'm I'm anyway meeting with Doas today.\n\nNikita Gorshkov: Nice.\n\nPrateek Jajoo: So I'll get some feedback and then share it with the based on uh his viewpoint either if it's very concrete and we are all aligned. Uh I can just put 30 minutes to just socialize it. It would be my first so it would be great. So yeah. Cool. Awesome.\n\n \n\n \n\nTranscription ended after 00:17:20\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-.md",
      "source_date": "2025-12-09",
      "doc_type": "one_on_one",
      "matched_topics": [
        "tpt"
      ],
      "matched_people": [
        "maria",
        "prateek",
        "nikita"
      ],
      "filter_score": 4
    }
  ],
  "doc_count": 8,
  "total_chars": 45660
}