{
  "batch_id": "meeting_076",
  "doc_type": "meeting",
  "documents": [
    {
      "title": "2026 Yearly Plan - Consumer Mega-Alliance - New Ventures",
      "doc_id": "1-yBSTAzOwSGLtLUfuaL_0l1eoyL1jB7v6-ESABhWdak",
      "link": "https://docs.google.com/document/d/1-yBSTAzOwSGLtLUfuaL_0l1eoyL1jB7v6-ESABhWdak/edit?usp=drivesdk",
      "content": "﻿YP - vCURRENT\n\n\n\n\n\n💡 Meeting Notes [To be filled after the Review Meeting by the YP Document Owner and sent out via email to attendees. This section does not impact the maximum number of pages]\n\nReview Meeting Date: Oct 16, 2025\n\nAttendees: Jama MusseCho HwangAnnie MeininghausCho HwangHolger HammelDominik RichterEd BoyesAssaf RonenLaurent GuillemainSeb TronFabien SimonAdriana VillarBrian Leung\n\n\n\n\n\nKey Takeaways, Decisions, and Next Steps:\n\n1. Alignment needed with Adam Park on plan for Factor Programs, as it fell below the line for Q4 and Q1. Does this need to be reprioritized? Done, we have agreed to keep momentum on physical product as well as planning ahead of Q2 development relaunch \n\n2. Factor Tech prioritization list created by Adam Park needs to be reviewed against the backlog of the MD squad. Done, we have reviewed the incremental asks, and have pulled them into Ed squad prioritization, and flagged items already in YP’s \n\n3. Lack of analytics resourcing was highlighted as risk for New Ventures, Annie and Jama to take away and come back with Analytics resourcing plans for New Ventures We have added 1 incremental PA resource to the New Ventures domain space, and will be looking to move additional temporary capacity to reduce the outstanding backlog \n\n4. Factor Form should better connect their products to customers  goals to create a “personalized performance stack”. Jama to connect with Adam Park on this plan We have added this for exploration in Q3 plan \n\n5. An aligned strategy should be created on how Loyalty should work for the New Ventures, and should this connect to the New Loyalty strategy set to launch in Q2-Q3 We will be looking to leverage the New Loyalty program when it launches, so we have therefore moved loyalty for Pets Table back by 1 quarter into Q3   \n\n6. Cross Selling for other brands outside of HelloFresh and Factor is below the line for 2026 to be revisited for 2027 planning\n\n\n\n\n\n\n\n\n\nChanges requested to the Yearly Plan during Draft Reviews. Please update before submission for final YP approval:  \n\n* Move Loyalty on Pets Table by 1 quarter to Q3 to leverage  New Loyalty program launch \n\n* App Launch for Pets Table to become contingent on results of Elysium and ABBA app launches (both financial and performance KPIs)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tI. Organizational Overview\n\nMission and Focus areas\n\nThe New Ventures team aims to surprise and delight customers by bringing to life never-before-seen physical and digital products, changing the way everyone thinks about food. The domain scope for new ventures includes: Good Chop - delivering US consumers premium, locally sourced proteins via a digital butcher experience; The Pets Table - delicious and nutritious human-grade pet food for pet parents for all budgets and sizes & the Factor sub-brand Factor Form - supporting customers on their path towards holistic wellness and achieving their health goals;  Market Innovation - bringing customers brand new experiences across markets reinvigorating our relevance in their eyes.\n\n\n\n\n\nCurrent Organizational Structure\n\nThe funded fixed HC for the New Ventures is 50. The management structure consists of 1 Director of Engineering (Daniel Arias) and 1 Director of Product (Nikita Gorshkov). Over the course of Q4 teams will settle into the new squad structure.  Overall New Ventures have self-funded with the exception of +2 from Growth to fund the Market Innovation squad.  *Final 2026 HC budget is under review with Finance and Portfolio given the recent org changes.\n\n\n\n\n\nDepartment/Tribe\n\n\tLLeader\n\n\tNumber of Squads\n\n\tBudgeted HC (Locked Business\n\n\n\na\n\n[d]@anne@hellofresh.com Theresa Stolberg has begun conversations with the markets this week for 2026, we will work with her on the plans there.\n\n[e]_Marked as resolved_\n\n[f]_Re-opened_\n\nWhy does it need to be country by country and not a global launch ?  \n\nVoice dictated by Assaf \n\n \n\nSent from my iPhone\n\n[g]The technology is available globally, the rollouts are happening as the countries define their occasions and setup and procure the SKUs.\n\n[h]what would you like to see here but aren't right now? @lgui@thepetstable.com\n\n_Assigned to lgui@thepetstable.com_\n\n[i]1. Multipet checkout improvements (direct impact on improving AOR)\n\n2. Increasing add on % of net revenue through add on subscribe & save, product marketing & UX (goal to increase add ons as a % of NR from 1% to 5% in 2026)\n\n3. Other CVR initiatives e.g. testing other qus in the quiz (previous pet food, neutered/spayed, etc), personalised value reinforcing stats, etc\n\n4. RAF initiatives on Tiered credit based on loyalty; RAF social proof & CVR improvements -> one of our goals for 2026 is to step change RAF\n\n\n\n\n\nThe team have this long list of initiatives and we will prioritise them through our quarterly planning.\n\n\n\n\n\nThe key thing is that we are resourced to tackle the vast majority of these and we've aligned on the resourcing for that. I can share with you in our call on Tuesday\n\n[j]Aligned with Laurent on this, we have a good understanding of the overall capacity needs with the team based on the available initiative roadmap; this particular table/format was not aimed to be exhaustive of all of the work we aim to deliver in 2026.\n\n[k]whats most painful to see not on the list @yt@hellofresh.com @set@hellofresh.com\n\n_Assigned to yt@hellofresh.com_\n\n[l]all key topics are in here. \n\n\n\n\n\none stream that's not present in here but we have as part of objectives and currently actively exploring is modernized CX leveraging AI: we are now looking at a few solutions that would augment CC, support sales funnel with live Q&A as well as retention flow (i.e. replace cancellation flow with native chat experience and go off the cancellation reason - solution) - this would need team support (data ingestion, PM steering, etc)\n\n1 total reaction\n\nNikita Gorshkov reacted with 👍 at 2025-10-16 15:52 PM\n\n[m]@anne@hellofresh.com fyi\n\n_Assigned to anne@hellofresh.com_\n\n[n]@jama.musse@hellofresh.ca - if you want to use this",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-.md",
      "source_date": "2025-12-09",
      "doc_type": "meeting",
      "matched_topics": [
        "new ventures",
        "good chop",
        "the pets table",
        "pets table",
        "factor form",
        "market innovation",
        "cross selling"
      ],
      "matched_people": [
        "jama",
        "daniel",
        "nikita"
      ],
      "filter_score": 10
    },
    {
      "title": "2026 Yearly Plan - Consumer Mega-Alliance (Final) - Q1",
      "doc_id": "1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8",
      "link": "https://docs.google.com/document/d/1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8/edit?usp=drivesdk",
      "content": "﻿Final YP\n\n\n\n\n\n💡 Meeting Notes [To be filled after the Review Meeting by the YP Document Owner and sent out via email to attendees. This section does not impact the maximum number of pages]\n\nReview Meeting Date: Oct 16, 2025\n\nAttendees: Ed Boyes Assaf Ronen Dominik Richter Holger Hammel,Cho HwangAnnie MeininghausDina MehrezThomas GrieselFabien SimonMarlene RosnerBrian LeungAdriana VillarEvan WeintraubJama Musse\n\n\n\n\n\nKey Takeaways, Decisions, and Next Steps:\n\n1. Clarify how menu expansion plans, personalization roll outs  and app features come together: \n\n   * Elysium (new store and homepage in the app) roll out is fast followed by new app feature which benefits users  irrespective of menu ranking roll out (most notably merchandising widgets for marketing,  recommendation widgets,bringing search to apps, populating “most popular, “trending” widgets - details)\n\n   * Menu ranking roll out: At the same time there is a roll out plan for menu ranking models which prioritizes P500 readiness in Q4/Q1 as well as Penguin for Factor US. Food Systems is trying to expedite Penguin for INTL if possible, prioritized after p500. Fall back is to launch Penguin Harp personalization to INTL markets expanding in Q1.  Other RTE markets in H2.\n\n2. Share prioritization framework  for Project 5M. The prioritization is heavily influenced by successful companies and features observed (direct or indirect competitors) as well as through an internal workshop. This revealed a consistent and significant behavioral gap: Users enthusiastically save recipes (often from social media) but rarely act on them. This indicates a high desire for inspiration but a significant friction point in execution. This led to the prioritization of the recipe bridge in Q4/Q1. If requested we can  walk through the detailed methodology.\n\n3. Decouple forecasting from personalization models. Food Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2.\n\n4. Reconcile marketing RAF plan with tech YP.  We have addressed the  gap between Marketing and Consumer growth targets. Share squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. \n\n5. Variable pricing is an urgently requested feature by markets. We added it  to the Market Innovation squad backlog H2. Will define long-term ownership before initiation as we are currently moving pricing ownership to growth MA. \n\n\n\n\n\nChanges requested to the Yearly Plan during Draft Reviews. Please update before submission for final YP approval:  \n\n* Should we invest into an AOV-focused squad? Yes we will self fund a new AOV driven squad in Q2 with a dedicated KPI. Focus in Q1  is first to roll out the new personalized core journey including widgets and then layer in more upselling components. \n\n* Loyalty strategy across markets: We decided to reserve a small team to  maintain and improve the existing  program while implementing  the new vendor based loyalty program to launch first in  the US . See Loyalty Strategy SMT Shareout.\n\n* Double check if all Factor requirements are in the plan: All documents were collected and integrated into the Market Innovation backlog. To be signed off by Ed Boyes\n\n\n\n\n\n\tI. Organizational Overview\n\nMission and Focus areas\n\nThe Consumer Mega Alliance vision is to create the best digital product exper\n\n\n\nrioritize P500 readiness in Q4/Q1 as well as Penguin for Factor US. Expand personalization to INTL markets (100–150 meals)  HF-UK, HF-CA, CP-CA (TBD), HF-ANZ, HF-BNL, HF-DKSE, HF-DEAT will follow Q1 / Q2. Other RTE markets in H2. Details in Ops Alliance YP.\n\n\tAnnie Meininghaus\n\n\tDecouple Forecasting from Personalization Models\n\n\tFood Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2. See Forecasting Domain Boundaries.\n\n\tHolger Hammel\n\n\tFactor Tech Requests Review\n\n\tJama and Annie aligned with Adam Park to merge the Factor backlog with the Market Innovation squad list. Requests are now integrated and can be selected during quarterly planning.\n\n\tJama Musse\n\n\tVariable Pricing\n\n\tAdded to the Market Innovation squad backlog. Deferred until Q3. Will define long-term ownership before initiation.\n\n\tJama Musse\n\n\tFactor Programs Transition Plan\n\n\tPause Programs on Factor funnel for peak since results are negative. Alison Ryanwill partner with Commercial and New Programs hire in NA to design a better “Active Experience” and 3rd-party partnerships. Aligned timeline is Q2.\n\n\tJama Musse\n\n\tProject 5M Prioritization (App Engagement)\n\n\tLisa Trueblood preparing a one-pager summarizing prioritization framework and decisions for follow-up discussion.\n\n\tEvan Weintraub\n\n\tLoyalty Strategy Across Markets\n\n\tDecided to reserve 20% of engineering IC capacity to maintain and improve the legacy program while evolving the new loyalty framework. See Loyalty Strategy SMT Shareout.\n\n\tEvan Weintraub\n\n\tReferral (RAF) Program Alignment\n\n\tAddress gap between Marketing and Consumer growth targets. Share” squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. Updated FAQ 11 \n\n\tEvan Weintraub\n\n\t\n\n\n\n[a]@holger.hammel@hellofresh.com @tushar.raina@hellofresh.com @Jama.Musse@hellofresh.ca \n\n@fernando.desouza@hellofresh.com \n\n\n\n\n\nFYI I stubbed out contents from Holger's sheet. Tushar from what you mentioned, some topics/ordering might be still pending further alignment correct?\n\n[b]@leo.lee@hellofresh.ca @fernando.desouza@hellofresh.com @jama.musse@hellofresh.ca FYI\n\n\n============================================================\n## EMAIL CONTENTS\n============================================================\n\n----------------------------------------\n### EMAIL: Notes: “1:1s: Jama-Nikita” Dec 9, 2025\nID: 19b03f6f8847ac24\nFrom: Gemini <gemini-notes@google.com>\n----------------------------------------\n\nNotes from “1:1s: Jama-Nikita”\n\n\n\nThese notes have been sent to invited guests in your organization.\n\n\n\nOpen meeting notes\n\n\n\nThe content was auto-generated on December 9, 2025, 5:33 PM CET and may  \n\ncontain errors.\n\n\n\n\n\nSummary\n\n\n\nNikita Gorshkov and Jama Musse discussed several key organizational and  \n\nproject updates, including Tishia's secured budget approval and Jama  \n\nMusse's approval for an 18-month analytics support contract role, separate  \n\nfrom a permanent product role, while also addressing Alexia's contract  \n\ninquiry and the unexpected termination of Sharief following a mistake by  \n\nhis manager, Assaf. Discussions also covered David's anticipated departure  \n\nduring the reorg, concerns about Katrina's aggressive pursuit of a VP  \n\npromotion, and the January 5th launch of the OTP plus subscribe and save  \n\nfeature for factor 4, along with vendor management issues regarding Anata  \n\nattempting to offload subscription setup work onto Samir. Other topics  \n\nincluded the prioritization of the Ed roadmap, where Jama Musse explained  \n\nEd's escalating pressure to meet market demands, and the critical need for  \n\nB2B product support to address HIPPA compliance issues related to \"factor  \n\nfood as medicine stuff.\"\n\n\n\n\n\nSuggested next steps\n\n\n\n\n\nJama Musse will get the bid and the P ID number for Nikita Gorshkov.\n\n\n\nNikita Gorshkov will open the contract role for the analytics support for  \n\ngood job and TPT.\n\n\n\nJama Musse will let Alexia know that Nikita Gorshkov is off and close the  \n\nloop with her regarding the note she sent while Jama Musse was on vacation.\n\n\n\nJama Musse and Nikita Gorshkov will sit down with the B2B team to  \n\nunderstand what they need regarding HIPPA compliance for the factor food as  \n\nmedicine initiative.\n\n\n\n\n\nMeeting records Document Notes by Gemini\n\n\n\n\n\nIs the summary section in this email helpful?\n\nNot Useful Email Useful Email\n\n\n\n\n\nGoogle LLC, 1600 Ampitheatre Parkway, Mountain View, CA 94043, USA\n\n\n\nYou have received this email because meeting artifacts were initiated in  \n\nGoogle Meet.\n\n\n\n\n\n\n\n\n----------------------------------------\n### EMAIL: ChatGPT is becoming the office default\nID: 19b03deb67e62c65\nFrom: Mindstream <hello@mindstream.news>\n----------------------------------------\n\n----------\n\nAnts don’t have lungs.\n\n\n\nThey just breathe through tiny holes in their bodies like it’s no big deal.\n\n\n\nImagine being so efficient you skip major organs and still outwork everyone.\n\n\n\n**What’s in store:**\n\n\n\n* Companies are using **OpenAI **way more than they admit.\n\n\n\n* Another AI startup joins **Team Meta.**\n\n\n\n* **Mindstream Picks: **Paramount tries to block Netflix with $108B offer.\n\n\n\n_Read Time: 5 minutes_\n\n\n\n\n\n--------------------\n\n###### **OPENAI**\n\n\n\n## [ChatGPT use is exploding inside companies](https://techcrunch.com/2025/12/08/openai-boasts-enterprise-win-days-after-internal-code-red-on-google-threat/)\n\n\n\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/6c6ce63a-eccd-4a05-8dfc-398edc30b450/mindstreammg_Create_a_digital_illustration_in_a_clean_modern__93b5d515-8c0f-4067-998e-52f8c71b07f8_0.png?t=1765209201)\n\nFollow image link: (https://techcrunch.com/2025/12/08/openai-boasts-enterprise-win-days-after-internal-code-red-on-google-threat/)\n\nCaption: \n\n\n\nOpenAI has released new data [showing](https://techcrunch.com/2025/12/08/openai-boasts-enterprise-win-days-after-internal-code-red-on-google-threat/) strong growth in enterprise use of its tools. \n\n\n\nChatGPT message volume has risen eightfold since November 2024, and many workers say they save up to an hour a day. \n\n\n\nThe update follows CEO Sam Altman’s recent warning to staff about rising competition from Google.\n\n\n\nAccording to\n\n\n\ndom and philosophy created. Will AI develop it's own mad-cow disease?” _- _**sunil.gu**_\n\n\n\n_“Echoes of the Luddites: 19th-century English textile workers who protested against new, labor-saving machinery, fearing it threatened their livelihoods, wages, and craft skills during the Industrial Revolution” -_**_ brianda_**\n\n\n\n_“All these lawsuits against AI companies are making it clear that real rules are coming. Publishers want licensing, credit, and fair pay, and courts are starting to show that copyright law applies to how AI trains and what it produces.” _**_- phyllis_**\n\n\n\nSubmit your opinions in our polls to be featured!\n\n\n\n\n\n----------**Number Crunch Answer: **_45. _\n\n\n\n**#923**\n\nThat’s a nice number.\n\n\n\n———————————————————————————\n\n\n\n———————————————————————————\n\n\n\n\n\n———\n\n\n\nYou are reading a plain text version of this post. For the best experience, copy and paste this link in your browser to view the post online:\n\nhttps://www.mindstream.news/p/openai-just-dropped-some-wild-stats\n\n\n\n\n----------------------------------------\n### EMAIL: Notes: “NVE Product Roadmap Sharing” Dec 9, 2025\nID: 19b03da7126b76c6\nFrom: Gemini <gemini-notes@google.com>\n----------------------------------------\n\nNotes from “NVE Product Roadmap Sharing”\n\n\n\nThese notes have been sent to invited guests in your organization.\n\n\n\nOpen meeting notes\n\n\n\nThe content was auto-generated on December 9, 2025, 5:01 PM CET and may  \n\ncontain errors.\n\n\n\n\n\nSummary\n\n\n\nBeatrice Dimarucut set up a meeting with Maria Chelminska, Prateek Jajoo,  \n\nsomeone in Bread Sheeran (Canada - Toronto HQ, 2), someone in Bread Sheeran  \n\n(Canada - Toronto HQ, 2), Nikita Gorshkov, and Alison Ryan to review and  \n\nalign on next year's plans across various teams. Maria Chelminska and  \n\nPrateek Jajoo outlined TBT 2026's strategy, which includes a growth stream  \n\nfocused on expanding the SKU portfolio, revamping the signup page as a  \n\nquick win, and a strategic launch of a \"pantry fresh\" product, alongside a  \n\nretention stream focused on fully digital feeding guides, dashboard  \n\nimprovements, tailored cancellation deflection, and a plan recommendation  \n\nengine. Someone in Bread Sheeran (Canada - Toronto HQ, 2) and someone in  \n\nBread Sheeran (Canada - Toronto HQ, 2) detailed Factor's Q1 roadmap,  \n\nconstrained by the Shopify experiment outcome and new product development  \n\ncomplexities, focusing on OTP launch iterations, new product development  \n\n(mealshake and creatine) despite SKU flexibility issues, and integrating  \n\nwith the Factor app, while Beatrice Dimarucut presented Good Chop's H1  \n\nroadmap, prioritizing the OTP launch, a price value experiment to improve  \n\nconversion/retention, and foundational work to\n\n\n\nnd share the  \n\nprototype for the tailored cancellation deflection with Beatrice Dimarucut.\n\n\n\nSomeone in Bread Sheeran (Canada - Toronto HQ, 2) will send the designs for  \n\nthe target PDP page in the product channel.\n\n\n\nMaria Chelminska will explore the YPO integration as a potential solution  \n\nfor reviews later in the year, particularly in H2, instead of building  \n\nsomething from scratch.\n\n\n\nBeatrice Dimarucut will open a ticket for PA to investigate the  \n\nprofitability of the trial box for referrals, considering recent data  \n\nchanges and historical profitability issues.\n\n\n\nBeatrice Dimarucut will touch base with Sandra Rosario regarding the  \n\nongoing rating system changes and exposure.\n\n\n\n\n\nMeeting records Document Notes by Gemini\n\n\n\n\n\nIs the summary section in this email helpful?\n\nNot Useful Email Useful Email\n\n\n\n\n\nGoogle LLC, 1600 Ampitheatre Parkway, Mountain View, CA 94043, USA\n\n\n\nYou have received this email because meeting artifacts were initiated in  \n\nGoogle Meet.\n\n\n\n\n\n\n\n\n============================================================\nEND OF RAW DATA\n============================================================\n\nInstructions for Claude Code:\nSynthesize the above into AI_Guidance/Core_Context/YYYY-MM-DD-context.md\nIMPORTANT: STRICTLY IGNORE any content, meeting notes, decisions, or updates dated before 2025-06-12 (6 months ago).\nExtract: Key decisions, action items, blockers, metrics, important dates (only recent).\nFormat: NGO-style bullets, structured sections\n============================================================\n## JIRA UPDATES (-12h)\n============================================================\n\n[PA-25443] [Discovery] Understand Meal Choice Rate <> Order Confirmation Rate with Meal Selection (Status: In Review, Priority: High)\n[PA-25576] Past Deliveries tab experiment - add new metrics to Statsig (Status: In Progress, Priority: High)\n[TPT-2431] Update copy of notifications and the progression header (Status: In Progress, Priority: Normal)\n[TPT-2353] [Investigation] Invalid meal selection (Status: Code Review, Priority: Normal)\n[RTEVMS-2356] [OTP] Order Summary - hide specific copys when having an OTP order (Status: In Progress, Priority: Normal)\n[PA-25581] LimeSync for Active Price Migration (Status: Backlog, Priority: Normal)\n[PA-25578] Pricing KPIs (Status: Backlog, Priority: Normal)\n[PA-25579] Work out react analysis plan (Status: Backlog, Priority: Normal)\n[PA-23658] Reactivation | MMR Improvements (Status: Backlog, Priority: Normal)\n[PA-25494] Create Project Plan  (Status: Backlog, Priority: Normal)",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-05.md",
      "source_date": "2025-12-09",
      "doc_type": "meeting",
      "matched_topics": [
        "good chop",
        "tpt",
        "vms",
        "market innovation",
        "otp"
      ],
      "matched_people": [
        "jama",
        "beatrice",
        "maria",
        "prateek",
        "nikita"
      ],
      "filter_score": 10
    },
    {
      "title": "2026 Yearly Plan - Consumer Mega-Alliance - New Ventures",
      "doc_id": "1-yBSTAzOwSGLtLUfuaL_0l1eoyL1jB7v6-ESABhWdak",
      "link": "https://docs.google.com/document/d/1-yBSTAzOwSGLtLUfuaL_0l1eoyL1jB7v6-ESABhWdak/edit?usp=drivesdk",
      "content": "﻿YP - vCURRENT\n\n\n\n\n\n💡 Meeting Notes [To be filled after the Review Meeting by the YP Document Owner and sent out via email to attendees. This section does not impact the maximum number of pages]\n\nReview Meeting Date: Oct 16, 2025\n\nAttendees: Jama MusseCho HwangAnnie MeininghausCho HwangHolger HammelDominik RichterEd BoyesAssaf RonenLaurent GuillemainSeb TronFabien SimonAdriana VillarBrian Leung\n\n\n\n\n\nKey Takeaways, Decisions, and Next Steps:\n\n1. Alignment needed with Adam Park on plan for Factor Programs, as it fell below the line for Q4 and Q1. Does this need to be reprioritized? Done, we have agreed to keep momentum on physical product as well as planning ahead of Q2 development relaunch \n\n2. Factor Tech prioritization list created by Adam Park needs to be reviewed against the backlog of the MD squad. Done, we have reviewed the incremental asks, and have pulled them into Ed squad prioritization, and flagged items already in YP’s \n\n3. Lack of analytics resourcing was highlighted as risk for New Ventures, Annie and Jama to take away and come back with Analytics resourcing plans for New Ventures We have added 1 incremental PA resource to the New Ventures domain space, and will be looking to move additional temporary capacity to reduce the outstanding backlog \n\n4. Factor Form should better connect their products to customers  goals to create a “personalized performance stack”. Jama to connect with Adam Park on this plan We have added this for exploration in Q3 plan \n\n5. An aligned strategy should be created on how Loyalty should work for the New Ventures, and should this connect to the New Loyalty strategy set to launch in Q2-Q3 We will be looking to leverage the New Loyalty program when it launches, so we have therefore moved loyalty for Pets Table back by 1 quarter into Q3   \n\n6. Cross Selling for other brands outside of HelloFresh and Factor is below the line for 2026 to be revisited for 2027 planning\n\n\n\n\n\n\n\n\n\nChanges requested to the Yearly Plan during Draft Reviews. Please update before submission for final YP approval:  \n\n* Move Loyalty on Pets Table by 1 quarter to Q3 to leverage  New Loyalty program launch \n\n* App Launch for Pets Table to become contingent on results of Elysium and ABBA app launches (both financial and performance KPIs)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tI. Organizational Overview\n\nMission and Focus areas\n\nThe New Ventures team aims to surprise and delight customers by bringing to life never-before-seen physical and digital products, changing the way everyone thinks about food. The domain scope for new ventures includes: Good Chop - delivering US consumers premium, locally sourced proteins via a digital butcher experience; The Pets Table - delicious and nutritious human-grade pet food for pet parents for all budgets and sizes & the Factor sub-brand Factor Form - supporting customers on their path towards holistic wellness and achieving their health goals;  Market Innovation - bringing customers brand new experiences across markets reinvigorating our relevance in their eyes.\n\n\n\n\n\nCurrent Organizational Structure\n\nThe funded fixed HC for the New Ventures is 50. The management structure consists of 1 Director of Engineering (Daniel Arias) and 1 Director of Product (Nikita Gorshkov). Over the course of Q4 teams will settle into the new squad structure.  Overall New Ventures have self-funded with the exception of +2 from Growth to fund the Market Innovation squad.  *Final 2026 HC budget is under review with Finance and Portfolio given the recent org changes.\n\n\n\n\n\nDepartment/Tribe\n\n\tLLeader\n\n\tNumber of Squads\n\n\tBudgeted HC (Locked Business\n\n\n\na\n\n[d]@anne@hellofresh.com Theresa Stolberg has begun conversations with the markets this week for 2026, we will work with her on the plans there.\n\n[e]_Marked as resolved_\n\n[f]_Re-opened_\n\nWhy does it need to be country by country and not a global launch ?  \n\nVoice dictated by Assaf \n\n \n\nSent from my iPhone\n\n[g]The technology is available globally, the rollouts are happening as the countries define their occasions and setup and procure the SKUs.\n\n[h]what would you like to see here but aren't right now? @lgui@thepetstable.com\n\n_Assigned to lgui@thepetstable.com_\n\n[i]1. Multipet checkout improvements (direct impact on improving AOR)\n\n2. Increasing add on % of net revenue through add on subscribe & save, product marketing & UX (goal to increase add ons as a % of NR from 1% to 5% in 2026)\n\n3. Other CVR initiatives e.g. testing other qus in the quiz (previous pet food, neutered/spayed, etc), personalised value reinforcing stats, etc\n\n4. RAF initiatives on Tiered credit based on loyalty; RAF social proof & CVR improvements -> one of our goals for 2026 is to step change RAF\n\n\n\n\n\nThe team have this long list of initiatives and we will prioritise them through our quarterly planning.\n\n\n\n\n\nThe key thing is that we are resourced to tackle the vast majority of these and we've aligned on the resourcing for that. I can share with you in our call on Tuesday\n\n[j]Aligned with Laurent on this, we have a good understanding of the overall capacity needs with the team based on the available initiative roadmap; this particular table/format was not aimed to be exhaustive of all of the work we aim to deliver in 2026.\n\n[k]whats most painful to see not on the list @yt@hellofresh.com @set@hellofresh.com\n\n_Assigned to yt@hellofresh.com_\n\n[l]all key topics are in here. \n\n\n\n\n\none stream that's not present in here but we have as part of objectives and currently actively exploring is modernized CX leveraging AI: we are now looking at a few solutions that would augment CC, support sales funnel with live Q&A as well as retention flow (i.e. replace cancellation flow with native chat experience and go off the cancellation reason - solution) - this would need team support (data ingestion, PM steering, etc)\n\n1 total reaction\n\nNikita Gorshkov reacted with 👍 at 2025-10-16 15:52 PM\n\n[m]@anne@hellofresh.com fyi\n\n_Assigned to anne@hellofresh.com_\n\n[n]@jama.musse@hellofresh.ca - if you want to use this",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-10-02.md",
      "source_date": "2025-12-10",
      "doc_type": "meeting",
      "matched_topics": [
        "new ventures",
        "good chop",
        "the pets table",
        "pets table",
        "factor form",
        "market innovation",
        "cross selling"
      ],
      "matched_people": [
        "jama",
        "daniel",
        "nikita"
      ],
      "filter_score": 10
    },
    {
      "title": "Notes - The Pets Table - Weekly Check-in",
      "doc_id": "1vOrUixt-zxfpCL9iVGENlw9TfCNcnqeUuyfrsHBvKKI",
      "link": "https://docs.google.com/document/d/1vOrUixt-zxfpCL9iVGENlw9TfCNcnqeUuyfrsHBvKKI/edit?usp=drivesdk",
      "content": "﻿TPT Jira || TPT Backlog || TPT Product Launch Calendar 2024 || Design Masterfile || Sprig || Scope Proposal: External Engineering Augmentation for The Pets Table (TPT)\n\nRoadmap - The Pets Table (2026)\n\nDec 17, 2025 | The Pets Table weekly Check-in\n\nAttendees: Maria Chelminska Anisha Chandra Laurent Guillemain Dovas Zakas Nikita Gorshkov Rena Zhou Daniel Arias Prateek Jajoo Eva Martínez Romero Désirée Lima Ahmed Wagdi Pedro Ávila\n\n\n\n\n\nAction items from last time: \n\n* Ahmed Wagdito dive deeper into rescheduling including the delivery day change \n\n* Maria to check with PA on options to shorten the allocation to tets\n\n   * Can we continue with the iAdvize\n\n* Once portion % are launched, check number and types of questions asked via chatbot \n\n* Dovas Zakasand Lindsay Finnertyto start a conversation via the public squad channel with this request and discuss directly with Vinicius Fernandes de Jesus\n\n* Dashboard simplification and excitement initiative scoping & workshop\n\n\n\n\n\nNotes\n\n* Total Price communication (taxes + discount) \n\n   * Problem\n\n   * Options\n\n      * Change the way we communicate tax\n\n      * Stop showing total price before discount\n\n   * Urgency\n\n   * HF\n\n* Actives dashboard experience – scoping document. Next steps to align with Maria/ Prateek\n\n\n\n\n\nAction items\n\n* \n\n\n\nNext week: \n\n   * Dec 10, 2025 | The Pets Table weekly Check-in\n\nAttendees: Maria Chelminska Anisha Chandra Laurent Guillemain Ahmed Wagdi Dovas Zakas Nikita Gorshkov Rena Zhou Daniel Arias Prateek Jajoo Désirée Lima Pedro Ávila\n\n\n\n\n\nAction items from last time\n\n* Maria to share with Suzi: \n\n   * All new SKUs should be added to the Adjust daily calories\n\n* Ahmed Wagdito dive deeper into rescheduling including the delivery day change \n\n* Maria and Prateek to change the copy in the funnel and active experience from “meal” to “recipe” \n\n* Maria to follow up with the PA team regarding reactivation rate reporting\n\n* Ahmed Wagdito manage the incremental rollout of the C@C\n\n\n\n\n\nNotes\n\n* Beam timing \n\n   * Decision: test the simpler version with sharing Transaction Details manually via a spreadsheet \n\n* iAdvize error\n\n   * Until Nov 20th - negative\n\n   * After Nov 20 (and changes implemented, delayed trigger) +3%\n\n   * Continue topic offline \n\n   * Decide by W52 if we want to pause the experience before “Portion Percentage” feature launch\n\n* C@C - update\n\n   * First test successful \n\n* (Rena) Can we add to tech backlog: passing “how many pets do you have” funnel data to SFMC? This will enable the initiative to setup dedicated CRM flow for multipets which is one of our most impactful retention initiatives\n\n   * We can add this event to CRM\n\n   * Continue the discussion in the channel\n\n* Contractors Roadmap update: \n\n   * Reactivation page - progress update \n\n      * Fixing issues with multipet (voucher is not applied, because users have a subscription active) \n\n   * When is the product PDP launching\n\n      * Potentially mid next week \n\n* Add ons dropping from order issue\n\n\n\n\n\nAction items\n\n* Ahmed Wagdito dive deeper into rescheduling including the delivery day change \n\n* Maria to check with PA on options to shorten the allocation to tets\n\n   * Can we continue with the iAdvize\n\n* Once portion % are launched, check number and types of questions asked via chatbot \n\n* Dovas Zakasand Lindsay Finnertyto start a conversation via the public squad channel with this request and discuss directly with Vinicius Fernandes de Jesus\n\nDec 2, 2025 | The Pets Table weekly Check-in\n\nAttendees: Maria Chelminska Anisha Chandra Laurent Guillemain Ahmed Wagdi Dovas Zakas Pedro Ávila Rena Zh\n\n\n\ne're trying to address this for the VMS experience and working with Gabi and Ryan to get a clearer setup for attribution and tracking in cases of multisubscription users.\n\n[w]@nikita.gorshkov@hellofresh.com to talk to @mateusz.borowiak@hellofresh.com\n\n[x]Note for Self: they are modifying the conversion event.\n\n[y]@aw@hellofresh.com\n\n[z]@lgui@hellofresh.com FYI for updates\n\n[aa]Replied under each question\n\n[ab]Thansk Ahmed!\n\n[ac]notes! please add anything I've missed @lgui@hellofresh.co.uk @wellney.yarra@hellofresh.com @anisha.chandra@hellofresh.com @aw@hellofresh.com\n\n[ad]https://hellofresh.atlassian.net/browse/TPT-480\n\n[ae]@anisha.chandra@hellofresh.com do you agree this is the right statement for AAFCO?\n\n\n\n\n\n@dovas@hellofresh.com FYI\n\n_Assigned to anisha.chandra@hellofresh.com_\n\n[af]This is the official statement \"formulated to meet the nutritional levels established by the\n\nAAFCO (Association of American Feed Control Officials) Dog Food Nutrient Profiles for All Life Stages, including growth of large size dogs (70 lbs. or more as an adult)\"\n\n[ag]If we need shorter, then I'm ok shortening to what NOM Nom have in their FAQ which is \"Recipes meet standards set by AAFCO’s Dog Food Nutrient Profiles for all life stages.\"\n\n[ah]@wellney.yarra@hellofresh.com - does it all go through you, or we can also add tix?\n\n[ai]should we move the existing UI fix tickets to this epic?\n\n[aj]@bowang.dai@hellofresh.ca have you had a chance to check this one?\n\n_Assigned to _\n\n[ak]Sorry, didn't get a chance to speak to this yesterday! Yes! I have reach out to squad consumer core. They have updated the reporting tab is no longer a supported feature. They only way to see recent conversions is via the DWH.\n\n[al]I am currently reaching out to global BI to see how this information is pulled from DWH and which report pulls this information.\n\n[am]FYI @dovas@hellofresh.com \n\n\n\n\n\nThanks Bo!!\n\n[an]gotcha - thanks you. maybe you can check if we can use \"marketing report extract\" from tableau?\n\n[ao]Sorry team for missing this meeting as I was off. @dovas@hellofresh.com and @wellney.yarra@hellofresh.com is this the finalized RAF Values? 50% off the trial box and 20% off on the next two boxes? Is this correct?\n\n[ap]Hey! Nope these were just example of the first box discount. For RAF it will be 100% off trial box, just pay for shipping and a TBD credit customer will earn for successful referrals",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-17-.md",
      "source_date": "2025-12-17",
      "doc_type": "meeting",
      "matched_topics": [
        "the pets table",
        "pets table",
        "tpt",
        "vms"
      ],
      "matched_people": [
        "maria",
        "prateek",
        "yarra",
        "ahmed",
        "daniel",
        "nikita"
      ],
      "filter_score": 10
    },
    {
      "title": "New Ventures Tribe - Weekly Standup Notes",
      "doc_id": "1w_XOLs9WPoFBbz3GNjOxDpXGYVGlq7noplV26ZILCEU",
      "link": "https://docs.google.com/document/d/1w_XOLs9WPoFBbz3GNjOxDpXGYVGlq7noplV26ZILCEU/edit?usp=drivesdk",
      "content": "﻿General Updates\n\nNew Ventures & Ecosystems\n\nWeekly Standup \n\nTEMPLATE\n\nTeam and People Updates\n\n👪 People Updates\n\n* Team members out this week:\n\n   * * Team members coming back this week:\n\n   * * Engineers on-call this week:\n\n   * L2 - New Ventures - \n\n💃 Social Updates\n\n* None this week\n\n🤖 Gen AI\n\n* None this week\n\n\n\n\n\n\n\n\n\n2025-W51\n\nTeam and People Updates\n\n👪 People Updates\n\n* Team members out this week:\n\n   * Madeeha Hasan\n\n   * Tavi Scandiff-Pirvu\n\n   * Liman Labaran\n\n   * Oliver Strobel\n\n   * Pedro Ávila\n\n   * (A-Dos) Arbaaz Dossani\n\n   * Ahmed Wagdi out from Dec 17  - Dec 19\n\n   * Edwin Torres out from Dec 17  - Dec 19\n\n   * Romina Nicastro working from 🇦🇷\n\n   * Daniel Arias working from 🇨🇦\n\n   * Alexander Matlin & Beatrice Dimarucut working from 🇺🇸\n\n* Team members coming back this week:\n\n   * Andrea Martins\n\n🥥 Team Updates\n\n* Engineers on-call this week:\n\n   * L2 - New Ventures - Matheus Bolognini\n\n   * L2 - RTE Systems/NV Systems - Morteza Pourkazemi\n\n   * Q1 2026 New Ventures On-Call is Open for Volunteers! 💰2026 New Ventures Tribe - On-call Rotations\n\n* Peak considerations - keep an eye on Approved Deployment & No deployment Days\n\n   * Peak Release Calendar Peak 2026 - Release Calendars and Opt-In List - Next AD/ND days are Dec 20 - Jan 18\n\n* Sprint alignment across Hellotech\n\n   * First sprint of 2026 should start Jan 5 for all squads\n\n   * At the end of every sprint, we will have a tribe-wide demo which will be recorded and shared. The first will be on Fri, Jan 16\n\n💃 Social Updates\n\n* None this week\n\n\n\n\n\n\n\n\n\n2025-W50\n\nTeam and People Updates\n\n👪 People Updates\n\n* Team members out this week:\n\n   * Andrea Martins\n\n   * Madeeha Hasan\n\n   * Tavi Scandiff-Pirvu\n\n   * Liman Labaran\n\n   * Oliver Strobel\n\n   * Elena Pavlova until Thurs\n\n   * Pedro Ávila working from 🇧🇷\n\n   * Ahmed Wagdi working from 🇪🇬\n\n   * Sneha Gupta out starting Wed\n\n   * Daniel Arias Wanderley Teixeira Philip Tauro Beatrice Dimarucut Edwin Torres out on Fri\n\n* Team members coming back this week:\n\n   * Désirée Lima on Wed\n\n🥥 Team Updates\n\n* Engineers on-call this week:\n\n   * L2 - New Ventures - Himash Tehan\n\n   * L2 - RTE Systems/NV Systems - Albert Liu\n\n   * Q1 2026 New Ventures On-Call is Open for Volunteers! 💰2026 New Ventures Tribe - On-call Rotations - consisting of 2 rotations: \n\n      * L2 - New Ventures: Supporting the client TRE used by TPT, GoodChop & VMS brands\n\n      * L2 - Market Innovation (currently RTE Systems): Supporting the backend services New Ventures owns (previously TAM) until they are deprecated/handover over\n\n* House keeping\n\n   * Peak considerations - keep an eye on Approved Deployment & No deployment Days\n\n      * Peak Release Calendar Peak 2026 - Release Calendars and Opt-In List - Next AD/NA is Dec 20 - Jan 18\n\n      * Peak Web Readiness Checklist: 2026 Peak Prep - Web & React Native Clients Checklist\n\n💃 Social Updates\n\n* Anthropic is visiting HF on 16.12.2026 - checkout clan-genai for deets\n\n* New Ventures Tribe Berlin New Years Dinner - Jan 27 2026\n\n   * Please RSVP asap\n\n* New Ventures Toronto Xmas Dinner - Dec 18 2025\n\n   * Please RSVP by Dec 10, 2025\n\n\n\n\n\n2025-W49\n\nTeam and People Updates\n\n👪 People Updates\n\n* Team members out this week:\n\n   * Désirée Lima\n\n   * Andrea Martins\n\n   * Elena Pavlova\n\n   * Maksim Burov until Thursday\n\n   * Lucas Freire Torres Cruz Pedro Ávila working from 🇧🇷\n\n   * Ahmed Wagdi working from 🇪🇬\n\n* Team members coming back this week:\n\n   * Nikita Gorshkov \n\n* Engineers on-call this week:\n\n   * L2 - New Ventures - Oliver Strobel\n\n   * L2 - RTE Systems/NV Systems - Ciro da Silva da Costa\n\n   * Will be shar\n\n\n\nams to clarify the implementation of the monthly delivery and the physical incentives for vouchers. \n\n________________\n\n2021-W13\n\n🛣️ Q2+Q3 Roadmap\n\nSolenne, Ahmed, Tobias and I sat down and put our planned projects into a roadmap for Q2 and Q3. Tobias and Solenne presented this roadmap to Yoav and Annie and received good feedback about it. In the second tab of the spreadsheet we listed the priorities, with Porterhouse leading the list. Whenever we have to make a hard choice between two deliveries, we will decide for the one with the higher priority. That makes projects with lower priority more likely to be delayed than the ones with higher priority. If you have any concern of a high-priority project, please let Tobias and Solenne know as soon as possible.\n\n💻 Tech Initiatives\n\n                                                                                                                                    * The BFF migration in the mobile app is almost almost almost complete. We can expect the initiative to be complete early next week. There are still some cleaning up to do on web and mobile.\n\n                                                                                                                                    * Last week we implemented a proof of concept of how we can migrate route access control to react components, and this we started with the migration of the access control function for the Cancellation page. By the end of next week, we should have also migrated the Delivery Tracking and RaF routes.\n\n💸 Additional Vouchers\n\nOne of Engagement's sprint goals is to support Additional Vouchers in our price calculation logic for web and mobile. This week we started working on the website, refactoring the voucher Redux logic (🍝) and implementing the action to fetch a subscription's additional voucher info.\n\n🔪 Killing Alice\n\nThis week we removed the last API call to Alice: update payment method in web. Before Alice is really killed in Intfood (expected mid April), we will need to do a force update of our mobile app to prevent users from using old versions that are still using the old endpoints.\n\n🛒 Add-ons\n\nThe Happiness team started to implement some changes for Add-Ons, and was able to setup some add-ons SKUs in staging.\n\n\n\n\n\n\n\n\n\n\n\n\n\n—\n\nPrevious Notes Location: https://www.notion.so/New-Brands-Retention-Weekly-Notes-c227bcddd153472f841114c2603de18d",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-15-02.md",
      "source_date": "2025-12-15",
      "doc_type": "meeting",
      "matched_topics": [
        "new ventures",
        "goodchop",
        "tpt",
        "vms",
        "market innovation"
      ],
      "matched_people": [
        "beatrice",
        "ahmed",
        "daniel",
        "nikita"
      ],
      "filter_score": 9
    },
    {
      "title": "New Ventures Tribe - Weekly Standup Notes",
      "doc_id": "1w_XOLs9WPoFBbz3GNjOxDpXGYVGlq7noplV26ZILCEU",
      "link": "https://docs.google.com/document/d/1w_XOLs9WPoFBbz3GNjOxDpXGYVGlq7noplV26ZILCEU/edit?usp=drivesdk",
      "content": "﻿General Updates\n\nNew Ventures & Ecosystems\n\nWeekly Standup \n\nTEMPLATE\n\nTeam and People Updates\n\n👪 People Updates\n\n* Team members out this week:\n\n   * * Team members coming back this week:\n\n   * * Engineers on-call this week:\n\n   * L2 - New Ventures - \n\n💃 Social Updates\n\n* None this week\n\n🤖 Gen AI\n\n* None this week\n\n\n\n\n\n\n\n\n\n2025-W51\n\nTeam and People Updates\n\n👪 People Updates\n\n* Team members out this week:\n\n   * Madeeha Hasan\n\n   * Tavi Scandiff-Pirvu\n\n   * Liman Labaran\n\n   * Oliver Strobel\n\n   * Pedro Ávila\n\n   * (A-Dos) Arbaaz Dossani\n\n   * Ahmed Wagdi out from Dec 17  - Dec 19\n\n   * Edwin Torres out from Dec 17  - Dec 19\n\n   * Romina Nicastro working from 🇦🇷\n\n   * Daniel Arias working from 🇨🇦\n\n   * Alexander Matlin & Beatrice Dimarucut working from 🇺🇸\n\n* Team members coming back this week:\n\n   * Andrea Martins\n\n🥥 Team Updates\n\n* Engineers on-call this week:\n\n   * L2 - New Ventures - Matheus Bolognini\n\n   * L2 - RTE Systems/NV Systems - Morteza Pourkazemi\n\n   * Q1 2026 New Ventures On-Call is Open for Volunteers! 💰2026 New Ventures Tribe - On-call Rotations\n\n* Peak considerations - keep an eye on Approved Deployment & No deployment Days\n\n   * Peak Release Calendar Peak 2026 - Release Calendars and Opt-In List - Next AD/ND days are Dec 20 - Jan 18\n\n* Sprint alignment across Hellotech\n\n   * First sprint of 2026 should start Jan 5 for all squads\n\n   * At the end of every sprint, we will have a tribe-wide demo which will be recorded and shared. The first will be on Fri, Jan 16\n\n💃 Social Updates\n\n* None this week\n\n\n\n\n\n\n\n\n\n2025-W50\n\nTeam and People Updates\n\n👪 People Updates\n\n* Team members out this week:\n\n   * Andrea Martins\n\n   * Madeeha Hasan\n\n   * Tavi Scandiff-Pirvu\n\n   * Liman Labaran\n\n   * Oliver Strobel\n\n   * Elena Pavlova until Thurs\n\n   * Pedro Ávila working from 🇧🇷\n\n   * Ahmed Wagdi working from 🇪🇬\n\n   * Sneha Gupta out starting Wed\n\n   * Daniel Arias Wanderley Teixeira Philip Tauro Beatrice Dimarucut Edwin Torres out on Fri\n\n* Team members coming back this week:\n\n   * Désirée Lima on Wed\n\n🥥 Team Updates\n\n* Engineers on-call this week:\n\n   * L2 - New Ventures - Himash Tehan\n\n   * L2 - RTE Systems/NV Systems - Albert Liu\n\n   * Q1 2026 New Ventures On-Call is Open for Volunteers! 💰2026 New Ventures Tribe - On-call Rotations - consisting of 2 rotations: \n\n      * L2 - New Ventures: Supporting the client TRE used by TPT, GoodChop & VMS brands\n\n      * L2 - Market Innovation (currently RTE Systems): Supporting the backend services New Ventures owns (previously TAM) until they are deprecated/handover over\n\n* House keeping\n\n   * Peak considerations - keep an eye on Approved Deployment & No deployment Days\n\n      * Peak Release Calendar Peak 2026 - Release Calendars and Opt-In List - Next AD/NA is Dec 20 - Jan 18\n\n      * Peak Web Readiness Checklist: 2026 Peak Prep - Web & React Native Clients Checklist\n\n💃 Social Updates\n\n* Anthropic is visiting HF on 16.12.2026 - checkout clan-genai for deets\n\n* New Ventures Tribe Berlin New Years Dinner - Jan 27 2026\n\n   * Please RSVP asap\n\n* New Ventures Toronto Xmas Dinner - Dec 18 2025\n\n   * Please RSVP by Dec 10, 2025\n\n\n\n\n\n2025-W49\n\nTeam and People Updates\n\n👪 People Updates\n\n* Team members out this week:\n\n   * Désirée Lima\n\n   * Andrea Martins\n\n   * Elena Pavlova\n\n   * Maksim Burov until Thursday\n\n   * Lucas Freire Torres Cruz Pedro Ávila working from 🇧🇷\n\n   * Ahmed Wagdi working from 🇪🇬\n\n* Team members coming back this week:\n\n   * Nikita Gorshkov \n\n* Engineers on-call this week:\n\n   * L2 - New Ventures - Oliver Strobel\n\n   * L2 - RTE Systems/NV Systems - Ciro da Silva da Costa\n\n   * Will be shar\n\n\n\nams to clarify the implementation of the monthly delivery and the physical incentives for vouchers. \n\n________________\n\n2021-W13\n\n🛣️ Q2+Q3 Roadmap\n\nSolenne, Ahmed, Tobias and I sat down and put our planned projects into a roadmap for Q2 and Q3. Tobias and Solenne presented this roadmap to Yoav and Annie and received good feedback about it. In the second tab of the spreadsheet we listed the priorities, with Porterhouse leading the list. Whenever we have to make a hard choice between two deliveries, we will decide for the one with the higher priority. That makes projects with lower priority more likely to be delayed than the ones with higher priority. If you have any concern of a high-priority project, please let Tobias and Solenne know as soon as possible.\n\n💻 Tech Initiatives\n\n                                                                                                                                    * The BFF migration in the mobile app is almost almost almost complete. We can expect the initiative to be complete early next week. There are still some cleaning up to do on web and mobile.\n\n                                                                                                                                    * Last week we implemented a proof of concept of how we can migrate route access control to react components, and this we started with the migration of the access control function for the Cancellation page. By the end of next week, we should have also migrated the Delivery Tracking and RaF routes.\n\n💸 Additional Vouchers\n\nOne of Engagement's sprint goals is to support Additional Vouchers in our price calculation logic for web and mobile. This week we started working on the website, refactoring the voucher Redux logic (🍝) and implementing the action to fetch a subscription's additional voucher info.\n\n🔪 Killing Alice\n\nThis week we removed the last API call to Alice: update payment method in web. Before Alice is really killed in Intfood (expected mid April), we will need to do a force update of our mobile app to prevent users from using old versions that are still using the old endpoints.\n\n🛒 Add-ons\n\nThe Happiness team started to implement some changes for Add-Ons, and was able to setup some add-ons SKUs in staging.\n\n\n\n\n\n\n\n\n\n\n\n\n\n—\n\nPrevious Notes Location: https://www.notion.so/New-Brands-Retention-Weekly-Notes-c227bcddd153472f841114c2603de18d",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-16-.md",
      "source_date": "2025-12-16",
      "doc_type": "meeting",
      "matched_topics": [
        "new ventures",
        "goodchop",
        "tpt",
        "vms",
        "market innovation"
      ],
      "matched_people": [
        "beatrice",
        "ahmed",
        "daniel",
        "nikita"
      ],
      "filter_score": 9
    }
  ],
  "doc_count": 6,
  "total_chars": 45408
}