{
  "batch_id": "prd_009",
  "doc_type": "prd",
  "documents": [
    {
      "title": "PRD: Enabling One-Time-Purchase (OTP) Capabilities for HelloFresh Group",
      "doc_id": "1vZfz2cWRq-LJVHs8EYKfue42mN6lzLJFpdFEd34ZZXo",
      "link": "https://docs.google.com/document/d/1vZfz2cWRq-LJVHs8EYKfue42mN6lzLJFpdFEd34ZZXo/edit?usp=drivesdk",
      "content": "﻿Summary\n\n `\n\nEnabling One-Time-Purchase (OTP) Capabilities for HF Groups Customers\n\n\tSummary: One-time-purchases enable HelloFresh to address customer needs for order flexibility, accessibility and concerns around subscription commitment, while enabling new ways to engage with existing, new and past customers across a variety of different use cases. This PRD aims to consolidate all known use cases for OTP in 2025 for HFG to define a path forward towards implementation.\n\n\tCreated At: Jun 2, 2025\n\n\tLast Updated: Jul 7, 2025\n\n\tEditor(s): Deo Nathaniel – POC & Workflow\n\n\tStrategy: \n\nSeasonal boxes and one-off ordering capability 2024 & beyond proposalCross-Selling: Enable HF US customers to purchase single order(s) or recurring Factor meals through a “Market Integration” experienceNV-2025-01: Good Chop: Move Towards Ecommerce ExperienceTwo-Way Marketplace: (Dropshipping Expansion) Leadership Steerco\n\n\tBC:  TBD\n\n\tDisclaimer: Some of the content, documents or research provided in this document might be generated by AI.\n\n\t\n\n\n\n[HOW TO READ] This document is structured based on three big parts:\n\n1. Summary & High-Level Overview Tab: These tabs serve as the central strategic hub. It outlines context and brief customer flows for each major use case (e.g., Good Chop, Seasonal Boxes) to give a quick understanding of the customer journey. It also synthesizes the Key Functionalities that need to be built across all these different use cases.\n\n2. Individual Use Case Tabs (e.g., \"Experience - Good Chop\", \"Experience - Seasonal Boxes\"): Each of these dedicated tabs dives deep into a specific product or initiative. They break down the requirements by Milestones (e.g., MVP - Milestone 1), providing a clear roadmap from a use case perspective. The requirements are listed with User Stories and Acceptance Criteria format.\n\n3. Dependency Tab: These tabs are used to identify and detail any specific work or information required from dependent Tribes and alliances.\n\n1. Summary View of the Solution Proposed\n\nThis initiative aims to deliver a One-Time-Purchase (OTP) capability experience across HelloFresh Group brands. As of June 2025, across HelloFresh, several use cases had been identified—such as event-themed seasonal boxes, curated selections of specialized items (e.g., premium meat and seafood from Good Chop), items from a broader marketplace of third-party CPG brands, or ready-to-eat meals from sister brands like Factor—as standalone purchases, without the necessity of an active weekly meal kit subscription for that particular transaction (though OTP may also complement existing subscriptions).\n\nThe solution involves creating a seamless OTP user flow within each participating brand's digital platform. This includes clear product discovery for OTP-eligible items, transparent pricing and benefits, distinct OTP cart[a] and checkout processes, appropriate order management for both new and existing customers (subscribed, paused, or cancelled), and downstream capabilities such as delivery management and data.\n\nThis foundational OTP capability will initially be piloted and rolled out for:\n\n1. 2025 Initiative Rollouts: \n\n   1. Seasonal Boxes across HelloFresh (similar to the ANZ model but integrated).\n\n   2. Good Chop offerings for both prospects and actives.\n\n   3. Factor Form item based OTP purchase\n\n2. 2026 Potential Targets:\n\n   1. A 2-Way Marketplace on a selected HelloFresh brand (e.g., Green Chef US pilot) (potential PoC in Q4 2025) \n\n   2. Cross-selling of Factor meals (as OTP) (iteration on the “Opt-in” Market Integration Model)\n\n   3. Further discovery might include Factor B2B using the new functionality.\n\n2. Problems Being Solved\n\nLimited purchasing flexibility of current HFG services discourages prospects looking to explore a new service for themselves and their household (OTP orders in funnel, trial boxes) or for past customers looking for greater flexibility without the subscription commitment (reactivation, one-time box offers). Further opportunities to capture new use cases in exploring non-box-add-on marketplace opportunities (Dropship expansion) as well as offering gift boxes (bundles, care packages) easily. \n\nToday, brands are resorting to either third-party tools (e.g. Shopify) or internal legacy systems (Evangelist), to enable these functionalities and consolidating them through OTP services would significantly lower costs and operational complexity. This OTP functionality is designed to cater to a variety of customer needs and scenarios across HFG brands, complementing existing subscription models. It is, including:\n\n* Seasonal Boxes: Enabling customers to purchase from special seasonal box offers on HelloFresh (eg. AU/NZ Christmas Box); on top of their existing subscription easily through the core HF experience. Past solutions have poor customer experience and technical challenges (being built through abusing existing subscription architecture). \n\n* Product Trial: Allowing new customers to experience a brand's quality and service (e.g., Good Chop, Factor meals) before committing to a recurring plan. \n\n* One-off/ Unplanned Needs: Enabling existing or past subscribers to make additional purchases outside their subscription cycle for special occasions, to stock up, to try specific items without altering their core subscription, or to supplement their meal kits with ready-to-eat options or other grocery staples.\n\n* Expanded Assortment & Discovery: Providing access to a wider range of products, including those from third-party vendors via a 2-way marketplace (e.g., snacks, pantry items, specialty goods) and cross-sold items from other HelloFresh Group brands (e.g., Factor meals).\n\n* Gifting: Providing an easy mechanism for customers to purchase products (bundled items, care packages, etc.) as gifts for others.\n\n3. Business Value of Solving This Problem (Combined OTP)[b]\n\nOTP unlocks customers not wanting subscriptions, for trial, gifts, or special occasions. Good Chop OTP experiments in Funnel estimate a potential €2.7M-€3M in TCVA Seasonal box OTP is estimated at €16.5M-€21.5M net revenue potential. The 2-Way Marketplace PoC (limited scope) projects ~$2.5M-$4.3M TCVA. The overall OTP opportunity is projected at €24.7M-€28.8M in incremental TCVA.[c][d][e]\n\nThis capability allows existing subscribers to add OTP items, Factor meals, or marketplace products to their regular orders or make additional purchases, boosting overall spend and engagement. Factor cross-sell alone projects an AOV increase of 0.8-1.2pp and potential AOR increase of ~5%. \n\n4. High Level Solution Breakdown (Here for more detail)\n\n* Core Purchase & Checkout Experience (P0 - Must Have): Enabling customers to easily select one-time purchase (OTP) products, understand their full cost upfront, and complete their orders.\n\n* Operational & Backend Integration (P0 - Must Have): Ensure that customers' OTP orders are processed efficiently behind the scenes, from inventory management to delivery.\n\n* Enhanced Flexibility for OTP (P1 - High Priority): Offering greater convenience and more flexible options, such as guest checkout, basic customization, and the ability to manage their OTP orders.\n\n* Marketplace & Cross-Sell Specifics (P1 - High Priority): Providing customers with access to a wider variety of products, including those from third-party vendors (marketplace) and sister brands like Factor, for one-time purchase.\n\n* Advanced Customization for OTP (P2 - Medium Priority): Giving more control to both customers and internal teams, such as enabling customized boxes, real-time updates on product availability and marketing tools to create unique OTP offerings.\n\n* Future Enhancements (P3 & P4 - Low Priority): Enhance post purchase experience, including easy reorder and combining OTP orders with existing subscriptions.\n\n\n\n\n\n\n\n\n\nWays of Working\n\nOne-time Purchase: Ways of Working\n\nOTP Project RACI\n\nIn order to avoid overlap between team members and ensure parallelization of efforts, these are the main PIC for the overall OTP project and completion of all dependent workstreams. There are other dependencies across tribes, but these groups of people can point you to the right direction.\n\nResponsible\n\n* Main Product/ Project PIC: Deo Nathaniel\n\n* Main Front End PIC: Alexander Matlin\n\n* Main Back-end PIC: Vladyslav Valt Ahmed ElSebaei\n\nAccountable/ Consulted\n\n* TAM: Nikita Gorshkov Wellney Yarra Daniel Arias\n\n* Consumer Core: Abdelrahman Hussein Adam Ghanem\n\nInformed\n\n* Jama Musse Cho Hwang\n\n\n\n\n\nProject Overview (2025)\n\nThe overarching one-time purchase strategy includes several core initiatives for 2025, with an initial focus on:\n\nGood Chop (goodchop.com) One-Time Purchase (OTP):\n\n* Goal: Address customer feedback about subscription hesitation and improve reactivation rates by integrating on-demand purchasing as a core offering.\n\n* Planned Launch: ETA W46\n\n* Milestone 1 (MVP - ETA W46): One-off boxes for prospect customers, providing a one-time purchase option with value differentiation (less to no discounts). This includes the ability to discover and browse OTP products, complete checkout, receive order confirmation and tracking, customer care support, internal operations/logistics/finance processing, and conversion to subscription.\n\n* Milestone 2 (ETA Q1 ’26): One-off boxes for active customers, encouraging additional box orders outside their regular cadence.\n\n* POC: Deo Nathaniel Alexander Matlin\n\nHelloFresh Seasonal Boxes (example: ANZ 2024 Christmas Box):\n\n* Goal: Integrate seasonal boxes directly into the core HelloFresh experience to overcome limitations of past offerings (declining sales, poor UX, operational overhead).\n\n* Planned Launch: LIVE - 29th October\n\n* MVP (ETA W44): Ability to discover and browse OTP products (via direct landing page/microsite, in-app, CRM), complete checkout (account creation/login, clear pricing, fixed delivery window, all HF payment methods), receive order confirmation and tracking (email, no \"My Deliveries\" section), customer care support, and internal operations/logistics/finance processing.\n\n* POC: Sameer Doda (current; see TAM Q2 QAR) Tamas Szilagyi Elyse Hill Tiffany Zhu\n\nOTP for Formers (HF/Factor):\n\n* Goal: Enable one-time purchase for reactivating formers on HF/Factor\n\n* Planned Launch: LIVE - 14th October\n\n* Key Functionalities: Offer customers who have canceled their subscriptions the ability to make one-time purchases without needing to reactivate\n\n* POC: Shay Ben Yacov\n\nFactor Form (factor75.com/factorform) One-Time Purchase (OTP):\n\n* Goal: Enable one-time purchase of VMS items on the Factor platform.\n\n* Planned Launch: Nov Q4 ’25 (following Good Chop’s launch).\n\n* Key Functionalities: Ability to discover OTP option on the Product Page, SKU & Menu management for OTP items, distinct pricing and benefits for OTP vs. subscription, account creation/login, delivery options (potential combined delivery with subscription), checkout/payment, post-checkout & order management, and customer care support.\n\n* POC: Wellney Yarra Jordon Smith \n\n\n\n\n\nProject Management - Comms\n\nTo ensure delivery velocity, dedicated, focused steercos will be developed to maintain reporting and communication for each of the current initiatives within the one-time purchase strategy.\n\n1. Main Slack Channel: #one-time-ordering-core-capability\n\n   * This channel will be used for all project updates, decisions, and next actions; please use threads for discussions to keep the channel organized and ensure all project members are informed.\n\n2. Meeting Cadences:\n\n   * OTP Weekly: Notes - OTP Weekly check-in - Every Tuesday, 5 PM Berlin time. This meeting is mandatory for core team members to update on project progress and serves as a forum for dependencies to discuss blockers offline.\n\n   * TAM Internal OTP Weekly: Notes - [TAM Internal] OTP Weekly - Every Monday, 3:30 PM Berlin time. This cadence is specifically for the TAM team to discuss requirements and front-end implementations.\n\n   * Async Meetings: \n\n3. Documentations:\n\n   * PRD: PRD: Enabling One-Time-Purchase (OTP) Capabilities for HelloFresh Group - Provides high-level context and requirements for specific use cases.\n\n   * Project Tracker: [Project Tracker] One Time Purchase - Used to maintain the project timeline and decision log.\n\n   * Document Folder: One Time Purchase - Google Drive folder to consolidate all documents related to OTP.\n\nHigh-Level Flow Overview\n\nStatus: Approved\n\n\n\n\n\nOverview\n\n\n\nTarget Market: HelloFresh (Global), Good Chop, VMS\n\nTarget Timeline: Jul 31, 2025\n\nEngineering Estimations: N/A\n\n\n\n\n\n[HOW TO READ] This document is structured based on three big parts:\n\n1. Summary & High-Level Overview Tab: These tabs serve as the central strategic hub. It outlines context and brief customer flows for each major use case (e.g., Good Chop, Seasonal Boxes) to give a quick understanding of the customer journey. It also synthesizes the Key Functionalities that need to be built across all these different use cases.\n\n2. Individual Use Case Tabs (e.g., \"Experience - Good Chop\", \"Experience - Seasonal Boxes\"): Each of these dedicated tabs dives deep into a specific product or initiative. They break down the requirements by Milestones (e.g., MVP - Milestone 1), providing a clear roadmap from a use case perspective. The requirements are listed with User Stories and Acceptance Criteria format.\n\n3. Dependency Tab: These tabs are used to identify and detail any specific work or information required from dependent Tribes and alliances.\n\n1. Project Overview (2025)\n\nThe overarching one-time purchase strategy includes several core initiatives for 2025, with initial focus on:\n\n* Good Chop One-Time Purchase (OTP):\n\n   * Goal: Address customer feedback about subscription hesitation and improve reactivation rates by integrating on-demand purchasing as a core offering.\n\n   * Milestone 1 (MVP - ETA W46 2025): One-off boxes for prospect customers, providing a one-time purchase option with value differentiation (less to no discounts). This includes the ability to discover and browse OTP products, complete checkout, receive order confirmation and tracking, customer care support, internal operations/logistics/finance processing, and conversion to subscription.\n\n   * Milestone 2 (ETA Dec ’25): One-off boxes for active customers, encouraging additional box orders outside their regular cadence.\n\n   * Owner: Deo Nathaniel\n\n* HelloFresh Seasonal Boxes:[f][g]\n\n   * Goal: Integrate seasonal boxes directly into the core HelloFresh experience to overcome limitations of past offerings (declining sales, poor UX, operational overhead).\n\n   * MVP LIVE - 29th October: Ability to discover and browse OTP products (via direct landing page/microsite, in-app, CRM), complete checkout (account creation/login, clear pricing, fixed delivery window, all HF payment methods), receive order confirmation and tracking (email, no \"My Deliveries\" section), customer care support, and internal operations/logistics/finance processing.\n\n   * Owner: Sameer Doda\n\n* OTP for Formers (HF):\n\n   * Goal: Enable one-time purchase for reactivating formers on HF/Factor\n\n   * Planned Launch: LIVE - 14th October\n\n   * Key Functionalities: Offer customers who have canceled their subscriptions the ability to make one-time purchases without needing to reactivate\n\n   * Owner: Shay Ben Yacov\n\n* Factor Form One-Time Purchase (OTP):\n\n   * Goal: Enable one-time purchase of VMS items on the Factor platform.\n\n   * Planned Launch: Dec 2025.\n\n   * Key Functionalities: Ability to discover OTP option on the Product Page, SKU & Menu management for OTP items, distinct pricing and benefits for OTP vs. subscription, account creation/login, delivery options (potential combined delivery with subscription), checkout/payment, post-checkout & order management, and customer care support.\n\n   * Owner: Wellney Yarra\n\n\n\n\n\n2. MVP Functionalities for One-Time Purchase (OTP) Capabilities Across HelloFresh Group Brands:[h][i]\n\nBased on the detailed user stories and acceptance criteria for Good Chop, Seasonal Boxes and VMS; here are the key functionalities the technical team needs to build:\n\n1. SKU Management:\n\n   * Explanation: The system needs to allow for the creation and management of distinct OTP products (SKUs) that can have different sizes, prices.\n\n2. Menu Configuration:\n\n   * Explanation: The system needs the ability to differentiate menus (e.g., specific cuts for Good Chop, pre-set menu for seasonal box, no individual recipe purchases for seasonal boxes).\n\n3. Account Creation & Login:\n\n   * Explanation: The system needs to handle various user states – new customers requiring registration, existing non-subscribed customers logging in, and active/paused subscribers using existing credentials – to facilitate a smooth flow into the OTP purchase journey. \n\n4. Distinct OTP Checkout Process:\n\n   * Explanation: A dedicated checkout flow for OTP orders is required to ensure clarity on one-time costs for prospects, actives and cancelled. This includes displaying transparent, itemized final pricing (box, shipping, discounts, taxes) and supporting all existing payment methods. \n\n5. Delivery & Address Management:\n\n   * Explanation: The system must support configurable delivery dates and windows specific to OTP orders[j], which may differ from subscription cut-off times. It needs to handle new address inputs, pre-fill addresses for existing customers, and perform zip code validation for delivery eligibility. \n\n6. Automated Order Confirmation & Tracking:\n\n   * Explanation: The platform needs to automatically send comprehensive order confirmation emails with full OTP order details, pricing, and delivery information. It must also provide subsequent notifications with tracking information once items ship, and enable logged-in users to view OTP order status and history. [k][l]\n\n7. Customer Care & Internal Order Management (BOB & OWL Integration):\n\n   * Explanation: Customer care agents require access to OTP order details through their backend system (BOB) to perform various actions like order cancellation, delivery rescheduling, address changes, and voucher adjustments. There should also be accessible FAQ content for OTP orders. \n\n8. Backend Operational & Financial Data Integration:\n\n   * Explanation: All OTP order data must be accurately captured, categorized, and integrated into backend systems (e.g., Katana) for inventory management, fulfillment differentiation (e.g., identifying OTP orders to avoid attaching subscription freebies), logistics, and financial reporting, ensuring proper revenue recognition. \n\n9. Data & Analytics Capabilities:\n\n   * Explanation: Frontend and backend data for OTP orders need to be correctly captured and categorized on data tables, and then included in major Tableau dashboards with identifiable filters, to enable insights and performance monitoring. \n\n10. CRM (list of events):\n\n   * Explanation: CRM are able to read OTP orders and send transactional emails such as order confirmation and delivery tracking.\n\n11. Subscription Conversion Flow:\n\n   * Explanation: For Good Chop, the system should facilitate a seamless process for OTP users to convert to a subscription, allowing a subscription order to be created alongside the OTP order without impacting it, and potentially applying specific conversion benefits.\n\n12. [Decided not for MVP] Benefit Application:\n\n   * Explanation: The platform must support discounts for OTP products versus subscriptions. This involves the capability to auto-apply vouchers based on entry points or allow manual entry, with benefits configurable for single box discounts or free shipping, ensuring no interference with existing subscription benefits.\n\n13. [Decided not for MVP] Multiple Order Capability:\n\n[m]\n\n   * Explanation: The system needs to support multiple orders at the same time, whether that’s a combination of OTP and Subscription order, or multiple OTP orders.\n\n   * For VMS only : Customers can checkout a combination of OTP and subscription product at one go \n\n3. Customer Experiences for OTP MVP requirements[n][o][p][q]\n\nKey Requirements\n\n\tGood Chop for Prospects (Flow)\n\n\tSeasonal Boxes (Flow)\n\n\tVMS\n\n\tAbility to discover and browse OTP products as a prospect on Good Chop pre-checkout funnel\n\n\t* I land in Good Chop's plans page and am able to see and choose the one-time purchase (OTP) options alongside subscription plans.\n\n* I can also choose different one-time purchase box sizes and see their specific prices and descriptions.\n\n* If a discount is available for OTP, I expect the voucher to be automatically applied based on how I arrived at the page, or I can manually enter a code.\n\n* After selecting a box size, I proceed to choose my specific cuts (recipes) for my one-time box. I can see what cuts are available for OTP, which might be different from what subscribers see.\n\n\t* I discover the Seasonal Box experience through various channels, including in-app links.\n\n* On the Seasonal Boxes microsite, I see a clear list of available pre-set seasonal box sizes and variants (All one-time purchases only).\n\n* I can choose one of the multiple Seasonal Box options. \n\n* I cannot customize individual recipes\n\n* If there's a specific voucher for Seasonal Boxes, it's either automatically applied based on my entry point, or I can manually enter a discount code.\n\n\t* Every product offered on the product page can be purchased as a subscription as well as one-time purchase\n\n* I can see the benefits of subscription vs one-time purchase, with one-time purchase being more flexible but also more expensive\n\n* If a discount is available for OTP, I expect the voucher to be automatically applied based on how I arrived at the page\n\n   * If my discount is not applicable for OTP, I expect to be informed about it and can go back to the subscription product to keep my discount\n\n\tAbility to complete checkout for OTP orders on Good Chop pre-checkout funnel\n\n\t* Once I'm happy with my selections, I proceed to sign up or log in.\n\n* On the checkout page, I see a total one-time price for the box\n\n* I select my preferred delivery date and time\n\n* I then choose my payment method and it's clear that I will only be charged once.\n\n\t* I need to either create a new HelloFresh account, or log in with my existing credentials (skip if logged in the app/ web)\n\n* On the checkout page, I see a total one-time price for the box.\n\n* The system validates my zipcode to ensure that Seasonal Boxes can be delivered.\n\n* The delivery window for these boxes is fixed to a specific timeframe, I cannot choose a different delivery date/ time.\n\n* If I'm an existing HelloFresh customer, my most recent delivery address is pre-filled and my previously used payment option is visible.\n\n\t* Once I'm happy with my selections, I proceed to sign up or log in.\n\n* On the checkout page, I see a total one-time price for the box\n\n* I select my preferred delivery date and time\n\n* I then choose my payment method and it's clear that I will only be charged once.\n\n\tAbility to receive order confirmation and track delivery\n\n\t* After a successful checkout, I'm redirected to an order confirmation page and receive an order confirmation email\n\n* I can view but cannot directly edit, reschedule, or cancel my one-time order from my Good Chop dashboard (My Deliveries section).\n\n* Once my order is shipped from the warehouse, I expect to receive a delivery tracking number.\n\n\t* After a successful checkout, I'm redirected to an order confirmation page and receive an order confirmation email\n\n* My Seasonal Box order will not appear in the \"My Deliveries\" section of my HelloFresh app or website, and I cannot directly edit, reschedule, or cancel it online.\n\n* Once my order is shipped from the warehouse, I expect to receive a delivery tracking number via email.\n\n\t* After a successful checkout, I'm redirected to an order confirmation page and receive an order confirmation email\n\n* I can view but cannot directly edit, reschedule, or cancel my one-time order from my Factor Form dashboard (My Deliveries section).\n\n* Once my order is shipped from the warehouse, I expect to receive a delivery tracking number.[r]\n\n\tAbility for customer care to support OTP orders\n\n\tAt any point, if I have questions or issues, I know I need to reach out to Customer Care and expect them to have access to my one-time order details to help me with inquiries, changes, or cancellations.\n\n\tAbility for internal operations, logistics, and finance teams to process and manage OTP orders\n\n\tThis capability is inferred by the successful execution of the customer journey steps. As a customer, I experience the result of these internal teams' work: my order is correctly fulfilled, shipped, and charged accurately. The product arrives as expected, and any issues I have can be resolved by customer care because internal systems accurately reflect my order.\n\n\tAbility to convert OTP users to a subscription\n\n\t* I might also be presented with an opportunity to easily convert my one-time purchase into a subscription, potentially with additional discounts, using my existing address and payment details. \n\n* This new subscription order would be separate and wouldn't affect my current one-time delivery.\n\n\tN/A\n\n\t* I might also be presented with an opportunity to easily convert my one-time purchase into a subscription, potentially with additional discounts, using my existing address and payment details. \n\n* This new subscription order would be separate and wouldn't affect my current one-time delivery.\n\n\t\n\n\n\n\n\n\n\n\n\n\n\nPost MVP Requirements\n\nPost MVP Scope\n\nThe overarching one-time purchase strategy includes several core initiatives for 2025, with initial focus on:\n\n* Good Chop One-Time Purchase (OTP) for Actives:\n\n   * Goal: Address customer feedback about subscription hesitation and improve reactivation rates by integrating on-demand purchasing as a core offering.\n\n   * Milestone 2 (ETA Q4 ’25): One-off boxes for active customers, encouraging additional box orders outside their regular cadence.\n\n* Factor Form One-Time Purchase (OTP):\n\n   * Goal: Enable one-time purchase of VMS items on the Factor platform.\n\n   * Planned Launch: TBD - Q4 ’25 (following Good Chop’s launch).\n\n   * Key Functionalities: Ability to discover OTP option on the Product Page, SKU & Menu management for OTP items, distinct pricing and benefits for OTP vs. subscription, account creation/login, delivery options (potential combined delivery with subscription), checkout/payment, post-checkout & order management, and customer care support.\n\n\n\n\n\n\n\n\n\nPriority\n\n\tI want to...\n\n[s]\t\n\nUse Case Applicability\n\n\tDescription (Acceptance Criteria)\n\n\tDependencies\n\n\tImage Reference\n\n\tP0\n\n\t[Benefit] Create, apply and validate benefits for OTP orders\n\n\tAll\n\n\t* OTP Benefits creation\n\n   * In CUI, stakeholders are able to input a validation whether the discount settings is applicable to an OTP order\n\n* Benefits application\n\n   * Customer can apply vouchers to the OTP orders the same way they apply it for subscription orders (UX flow depending use cases)\n\n* Benefits validation\n\n   * Wallet is able to validate vouchers for OTP orders (without a subscription_id)\n\n   * Wallet is able to save benefits for OTP orders - post order creation\n\n\tCustomer Benefits\n\n\t\n\n\n\n\tP0\n\n\t[Conversion to Subscription] Easily purchase a subscription during/ after the OTP order processing\n\n\tAll\n\n\tOTP customer can convert their OTP order into a subscription\n\n   * Subscription is created starting on the next box\n\n   * Plan selection and meal choice from OTP replicated for the subscription\n\n   * Promotion/ vouchers for subscription can be applied to the next box[t]\n\n\tNVS, Consumer Core, Payments, Cross-selling\n\n\t\n\n\n\n\tP0\n\n\t[Combined Checkout] Checkout OTP and subscription together within the same payment[u]\n\n\tVMS\n\n\t* Cart to handle OTP item and Subscription item together\n\n   * Promo: Able to apply >1 voucher depending on the number of orders. For eg. 1 voucher for OTP + 1 voucher for Subscription[v][w]\n\n* Checkout to handle OTP and Subscription items together\n\n   * Shipping price: shipping will be separate based on the SKU shipping price setup, no consolidation[x][y]\n\n   * Payment[z]: consolidate total price into one payment\n\n      * Edge case: if one order fails, then the whole payment fails\n\n* Post-purchase\n\n   * Order confirmation:[aa] send a single order confirmation email  with both OTP and Subscription information\n\n   * Invoice[ab]: Have a single invoice with both OTP and Subscription information\n\n\t\n\n\n\n\t  \n\n\n\n\tP1\n\n\t[Combined Delivery Cost] Combine OTP and Subscription orders within one delivery and with a single delivery cost\n\n\tAll\n\n\tCheckout/ Delivery to combine OTP and Subscription orders into one box\n\n   * Delivery cost: Single delivery cost for the combined orders\n\n   * Tracking: Single tracking number for the combined box\n\n   * Box configuration: Pick and pack based on a combined packing list\n\n\t\n\n\n\n\t\n\n\n\n\tP1\n\n\t[Stock Management] See clear, real-time availability of OTP items and be informed if an item is sold out, with (optional) information on potential restocking.\n\n\tAll\n\n\tProduct detail pages clearly display stock status. If an OTP item is sold out, this is prominently displayed. – currently cannot be handled due to system limitation\n\n\t\n\n\n\n\t\n\n\n\n\tP1\n\n\t[Repurchase] Easily reorder a past OTP product or a similar selection from my order history.\n\n\tAll\n\n\tOTP customers can have an option to \"reorder\" or \"buy again\" \n\n   * Plan selection and meal choice replicated to the next OTP box\n\n   * Customer can make changes on plan, meals and delivery preferences before checkout\n\n\t\n\n\n\n\t\n\n\n\n\tP2\n\n\t[Guest Checkout]Purchase an OTP product using a guest checkout process if I prefer.\n\n\tAll\n\n\tOffers a guest checkout path for OTP orders, without having to create an account\n\n   * Required: delivery information and payment information\n\n   * Having an option to create an account post-purchase\n\n\t\n\n\n\n\t\n\n\n\n\tP2\n\n\t[Cancellation] Be able to cancel my OTP order online (or modify limited aspects) before a clearly communicated cut-off time.\n\n\tAll\n\n\tProvides a self-service option for customers to edit or cancel their OTP orders before a specific cut-off time (currently can only be done through customer care)\n\n\t\n\n\n\n\t\n\n\n\n\tP2\n\n\t[Delivery Consolidation] For customers with OTP and Subscription orders within the same day, operations have the capability to consolidate their order to one delivery\n\n\tAll\n\n\tWarehouse management system to combine OTP and Subscription orders into one box\n\n   * Tracking: Single tracking number for the combined box\n\n   * Box configuration: Pick and pack based on a combined packing list\n\n\t\n\n\n\n\t\n\n\n\n\tP2\n\n\t[Gifting] Easily purchase an OTP product and have it shipped directly to a different recipient, with an option to indicate it's a gift.\n\n\tAll\n\n\tAllows the customer to specify a different shipping address from their billing address during OTP checkout.\n\n\t\n\n\n\n\t\n\n\n\n\t2026 Plans\n\n[DRAFT] One-Time Purchase (OTP): Scaling Plan for Q4’25 - 2026\n\nUpdated Nov 20, 2025\n\n________________\n\n\n\n\n\n1. Where We Are: Current Launch Status, Markets, and Use Cases for 2025\n\nInitiative\n\n\tStatus & Scope\n\n\tKey Data / Findings\n\n\tLaunched\n\n\tOTP for HF Formers (US) (MVP Test)\n\n\tLaunched and Currently Running. Targets US canceled customers via the web flow (mobile web and desktop). This experience is pure e-commerce, requiring manual menu selection before checkout at a premium, non-discounted price.\n\n\tLaunched Oct 14th. The entry point showed strong user interest with a 11%+ clickthrough rate. Of these, 30% interact with the meal choice features, and 10% complete a purchase. There is a 30% drop-off between order submission and successful payment, highlighting an opportunity to streamline the payment process. We are investigating the causes. So far, we see no incremental impact on users with at least one order or on net revenue. (full result)\n\n\tOccasional Boxes (ANZ)\n\n\tLaunched in Australia (AU) and New Zealand (NZ): Leverages the new OTP backend architecture to offer occasional boxes (e.g., Christmas boxes). These are configured as pre-set menus where recipes cannot be customized.\n\n\tLaunched Oct 30th. On track to hit the 5k order target by the end of month, with relatively high conversion rate (~15%). (Dashboard)\n\n\tCross-Selling (HF Active → Factor)\n\n\tLaunched (HelloFresh active customers purchasing Factor ready-to-eat meals) as an experiment; still running. This is viewed as an “OTP use case for active users”.\n\n\tTraction is observed with 700 initial conversions, 10.5% of the converted cohort placing additional recurring x-sell orders and 23% of exposed customers ordering both meal kits and RTE in a given week as of W44. The experiment is still running and numbers will continue to update.\n\n\n\nNote: This functionality does not leverage the core OTP technology built for formers but it’s a similar experience for customers. \n\n\tUpcoming CRM Test (HF Formers)\n\n\tPlanning Follow-up Test (Target: Early November): Using pure CRM campaigns to route canceled users directly to the OTP flow, bypassing the standard reactivation page.\n\n\tLaunched on Thu, 13th November. The goal is to gather directional demand reads and engagement from low-intent/inactive users via a lean test without disrupting the standard reactivation flow.\n\n\tOccasional Boxes (CA)\n\n\tLaunching Holiday Boxes in Canada, with similar setup to the Christmas Box launch in Australia and New Zealand.\n\n\tLaunched on Fri 14th November. Gathering early results.\n\n\tPlanned in Q4 2025\n\n\tOTP for HF Formers (UK[ac]) (New Launch)\n\n\tMVP Test Launching/Imminent. The UK market is a high priority due to competitive urgency against Gusto, which generates approximately 10% of its volume from one-time purchases. The UK team is \"very keen\" to run this test. This test leverages the same flow/infrastructure as the US MVP.\n\n\tPlanned for W50\n\n\tFactor Form\n\n\tLaunching One Time Purchase option for Factor Form to expand total addressable market (TAM) and capture customers who prefer transactional purchases over recurring subscriptions.\n\n\tPlanned for W51\n\n\tGood Chop\n\n\tGood Chop has previously explored One-Time Purchase (OTP) experiments showing significant short-term conversion lifts despite lower long-term retention. The new Good Chop experience aims to expand market share by integrating on-demand purchasing as a core offering. \n\n\tPlanned for W51\n\n\tQ4 2025 Constraint: There are no plans for HelloFresh OTP pre-defined boxes for active users in Q4. Current efforts focus on addressing foundational technical dependencies.\n\n________________\n\n\n\n\n\n2. Where We Want to Be: The Grand Vision and Plan to Scale OTP\n\nThe long-term vision is to transition to an enhanced single-tier model anchored by flexibility, expanding our offerings to all customer states.\n\nA. Redefining Customer Engagement\n\nWe are working toward blurring the distinction between \"active\" and \"canceled\" status, viewing customers as simply \"ordering in a given week\" or \"not ordering in a given week\". This recognizes that OTP purchases and subscriptions should be considered at the same level in the future.\n\nB. Scaling Audience and Use Cases (The Plan to Scale OTP)\n\nThe One-Time Purchase initiative is structured around three key strategic use cases designed to maximize customer lifetime value and expand market reach:\n\n1. Integrate OTP into Core HelloFresh Journeys: Establish OTP as a core, complementary offering alongside the subscription box. This pillar focuses on making the flexible purchase option available across all customer states: Prospects, Actives, and Former customers.\n\n2. Unlock New Consumption Occasions: Expand the OTP platform to support non-subscription purchase opportunities. This includes high-value, complementary use cases like Occasion-Based Boxes (e.g., holiday or seasonal boxes), VIP/Gifting Orders, and Donation Boxes.\n\n3. Expand Across the Brand Portfolio: Leverage the foundational OTP architecture to enable transactional purchasing for other HelloFresh brands. The initial focus will be on Factor Form and Good Chop as the MVPs, with plans to extend the capability to other brands like Chefs Plate and Youfoodz in 2026.\n\nCurrently working with the Global Strategy team and Growth team to finalize use cases and markets.\n\nAudience\n\n\tTarget Experience (Use Cases)\n\n\tTiming (Target)\n\n\tQ1 2026\n\n\tCanceled Customers (Formers)\n\n\tIntent Based Routing: launch a new home page for cancelled users across mobile AND native app to replace the Reactivation page as the current start flow for formers\n\n\tQ1’2026\n\n\tProspects (New Customers)[ad]\n\n\tGuest Ordering/Trial Box: OTP as an alternate low-commitment activation path. This flow, similar to Good Chop's \"graduation flow,\" will nudge users to subscribe after their first box.\n\n\tEarly 2026 (Q1)[ae]\n\n\tHF DACH & FR (All Customers)\n\n\tLaunch Easter occasional box. With a similar setup to the Christmas Box in AU/NZ. These occasion based boxes can be bought by all customer types.\n\n\tFeb, Mar\n\n\tChefs Plate OR Youfoodz\n\n\tOffering One Time Purchases on the Chefs Plate or Youfoodz main experiences. Currently in discussion to decide the best use case between Formers, Prospects or Actives.\n\n\tLate Q1[af]\n\n\tQ2 2026\n\n\tActive Customers\n\n\tOTP for Actives: Allowing active subscribers to place additional, separate orders in the same week. Use cases include \"second box\" (for guests), gifting, or express delivery.\n\n\tQ2/Q3 2026 (Foundational work)\n\n\t________________\n\n\n\n\n\n3. What’s Missing & Critical Blockers\n\nA. Key Features and Technical Infrastructure Gaps\n\nScaling OTP globally and enabling rich feature sets depends on solving critical technical and data infrastructure gaps.\n\nPrio\n\n\tMissing Capability\n\n\tImpact & Context\n\n\tWhen Will We Work On It\n\n\tDependencies\n\n\tP0\n\n\tMarketing Data & Attribution (CAC/CVA)\n\n\tCRITICAL GAP: The core marketing attribution asset (MAC) is built on plan_id. When users convert via OTP, we lose attribution data, preventing accurate tracking of CVA, CC, and CAC.\n\n\tImmediate Focus (Q4 2025): Identified as needing immediate attention. Acceleration requires support from the marketing tech team.\n\n\tPlatform/ Marketing Tech\n\n\tP0\n\n\tCRM Communications (Non-Subscription Emails)\n\n\tWe lack proper, non-subscription-language transactional email templates (order confirmation, payment confirmation). Sending existing templates risks confusing OTP buyers.\n\n\tImmediate Focus (Q4 2025): A decision split is being implemented by Paul Larcara to prevent sending confusing subscription emails to OTP customers. A new dedicated template will be developed.\n\n\tCRM\n\n\tP0\n\n\tLogistics/SCM Infrastructure Scalability\n\n\tGlobal scalability is blocked because local logistics systems (like Demeter in the UK) require dedicated updates to recognize the new \"order grouping ID\" instead of the legacy subscription ID for fulfillment.\n\n\tOngoing (Market by Market): US implementation is complete. UK integration requires dedicated local team effort. Global scaling requires building the functionality into Odin (the global order enrichment system).\n\n\tSCM\n\n\tP1\n\n\tSupporting Add-ons & Surcharges\n\n\tThe initial solution lacks support for ordering surcharge recipes or add-ons. This limits menu diversification and key use cases (e.g., celebrity boxes).\n\n\tA follow-up release to fix this gap is scheduled for the end of November.\n\n\tConsumer Core\n\n\tP1\n\n\tCart Consolidation\n\n\tCurrently OTP is not using the global cart service, this creates some issues and non-standardized processes downstream. \n\n\tProposed to be Q1 Focus\n\n\tShopping Foundations\n\n\tP0\n\n\tCDP Integration\n\n\tA new customer status is required for customers who make one-time purchases. This status will exist alongside the current classifications of \"Prospects,\" \"Actives,\" and \"Formers,\" which are based on subscription status.\n\n\tProposed to be Q1 Focus\n\n\tConsumer Data\n\n\tP1\n\n\tBenefits\n\n\tVouchers can only be applied when a plan_id or subscription_id is linked. The Benefits team needs to enable voucher application at the order level.\n\n\tProposed to be Q1 Focus\n\n\tCustomer Benefits\n\n\tP2\n\n\tForecasting\n\n\tIntegrate One-Time Purchase orders into the existing forecasting data model. This integration will directly influence box order forecasting and purchasing decisions across all markets.\n\n\tDiscuss on mitigation plan for Q1, and tackle within Q2\n\n\tSCM Analytics\n\n\tP2\n\n\tMorpheus\n\n\tOne-Time Purchase data is currently not included in Morpheus, which may affect Morpheus's accuracy rate.\n\n\tDiscuss on mitigation plan for Q1, and tackle within Q2\n\n\tGlobal AI\n\n\t\n\n\n\nB. Marketing & Collaboration Strategy (Scaling Initiatives)\n\nCollaboration with marketing and CRM is critical for scaling OTP, ensuring that the technology enables sophisticated targeting and conversion pathways.\n\nMarketing/CRM Initiative\n\n\tGoal & Context\n\n\tTimeline (Target)\n\n\tDedicated/Smart CRM Campaigns (Query 1)\n\n\tLaunch dedicated campaigns that route low-intent/inactive formers directly to the OTP flow, bypassing the subscription-focused reactivation.... This test assesses engagement from segments hard to convert to subscription. Long-term vision includes campaigns that land users directly on either the subscription or OTP path\n\nplan\n\n\tFirst MVP Test:\n\nNov 10th, 2026\n\n\tFixing Marketing Data Attribution\n\n\tCRITICAL: Fix the core marketing attribution asset , currently built on plan_id, which causes us to lose attribution data (CAC/CVA) when users convert via OTP.... This capability needs prioritization from the marketing tech team.\n\n\tTBD\n\n\tCross-Conversion Triggers\n\n\tImplement triggers to upsell OTP customers to a subscription, and vice-versa (e.g., subscription customers can be offered OTP if they show intent to cancel... The long-term plan is to build new pathways to upsell OTP in the product.\n\n\tTBD\n\n\tGeneral Communication Strategy \n\n\tDevelop distinct CRM emails (transactional and marketing) to treat OTP customers differently, avoiding confusing subscription language. Post-purchase emails for OTP users should focus on order confirmation and building excitement for future menus, rather than explicitly pushing re-subscription.\n\n\tTBD\n\n\tEnabling Discount/Promo Support\n\n\tIntegrate technical support for vouchers, benefits, and discounts for OTP orders to enable targeted marketing efforts (e.g., offering discounted OTPs, similar to Gousto's occasional use)....\n\n\tTBD\n\n\t________________\n\n\n\n\n\n4. Appendix \n\nA. Market Expansion Roadmap\n\nThe focus shifts immediately from the US test to targeted international expansion leveraging the existing infrastructure.\n\nPriority\n\n\tMarket / System\n\n\tRationale & Status\n\n\tNext Step / Timeline\n\n\t1 (Immediate)\n\n\tHelloFresh US (Katana)\n\n\tTest running (formers). Validating demand, refining the flow, and measuring cannibalization.\n\n\tOptimize MVP flow based on data and immediately fix the critical marketing attribution gap.\n\n\t2 (High Priority)\n\n\tUK (Demeter)\n\n\tCritical market due to competitor success (Gusto sees 10% volume from OTP). Launching the MVP test for formers is high priority.\n\n\tEngage the local Demeter team (UK local operations) to implement the \"order grouping ID\" for fulfillment.\n\n\tGlobal Scale\n\n\tOdin Markets (AU, Nordics, DE)\n\n\tIntegrating OTP functionality into Odin, the upcoming global system, provides the best path for long-term scalability across all new and migrating markets.\n\n\tPrioritize Odin feature integration with Bulma. Germany (DE) is launching Odin soon.\n\n\tB. Foundational Platform Roadmap (Focusing on Backlog for Q1 2026)\n\nFoundational work is necessary to enable the full spectrum of monetization levers and customer experiences planned for 2026.\n\nCapability Lever (Focus Areas)\n\n\tKey Missing Components (Backlog)\n\n\tOwnership & Timing\n\n\tData & Tracking\n\n\tImplement fix for CAC/CVA attribution tracking (high priority). Investigate forecasting and demand planning for OTP orders.\n\n\tPlatform/Marketing Tech (Q4 2025 / Q1 2026)\n\n\tProduct Customization\n\n\tEnable support for surcharge recipes and add-ons (ETA End of Nov). Enable support for vouchers, discounts, and benefits.\n\n\tPlatform (Q4 2025 / Q1 2026)\n\n\tPricing Strategy\n\n\tUnlock recipe-level pricing to allow for price differentiation within the core menu without relying on surcharges.\n\n\tPlatform (Post-Q4 2025, after current pricing KR)\n\n\tFlexibility\n\n\tIntroduce native non-weekly delivery frequencies (e.g., biweekly/monthly) for active and returning customers.\n\n\tPlatform/Growth (Q4 2025)\n\n\tAcquisition/Prospects\n\n\tFoundational work to support \"Guest Ordering\" (Trial Flow).\n\n\tPlatform/Activation (Early 2026)\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n🥩 Experience: Good Chop\n\n[HOW TO READ] This document is structured based on three big parts:\n\n1. Summary & High-Level Overview Tab: These tabs serve as the central strategic hub. It outlines context and brief customer flows for each major use case (e.g., Good Chop, Seasonal Boxes) to give a quick understanding of the customer journey. It also synthesizes the Key Functionalities that need to be built across all these different use cases.\n\n2. Individual Use Case Tabs (e.g., \"Experience - Good Chop\", \"Experience - Seasonal Boxes\"): Each of these dedicated tabs dives deep into a specific product or initiative. They break down the requirements by Milestones (e.g., MVP - Milestone 1), providing a clear roadmap from a use case perspective. The requirements are listed with User Stories and Acceptance Criteria format.\n\n3. Dependency Tab: These tabs are used to identify and detail any specific work or information required from dependent Tribes and alliances.\n\nGood[ag] Chop One Time Purchase\n\nGood Chop has previously explored One-Time Purchase (OTP) options to address customer feedback about subscription hesitation and to improve reactivation rates, with past experiments showing significant short-term conversion lifts despite lower long-term retention compared to traditional subscriptions. Recognizing that many customers are skeptical of commitments and seek greater flexibility and control, the new Good Chop experience aims to expand market share by integrating on-demand purchasing as a core offering. \n\nGood Chop OTP Milestones:\n\n* [MVP - Milestone 1] [ETA W51’ 25] One-off boxes for prospects customers. Good Chop would be offering prospects who do not want a commitment upfront, one time purchase options with value differentiation (with less to no discounts).\n\n   1. Ability to discover and browse OTP products as a prospect on Good Chop pre-checkout funnel\n\n   2. Ability to complete checkout for OTP orders on Good Chop pre-checkout funnel\n\n   3. Ability to receive order confirmation and track delivery\n\n   4. Ability for customer care to support OTP orders\n\n   5. Ability for internal operations, logistics, and finance teams to process and manage OTP orders\n\n   6. Ability to convert OTP users to a subscription\n\n\n\n\n\n* [Milestone 2] [ETA Q4’ 25] One-off boxes for active customers. Good Chop would be encouraging orders from Actives who might want an additional box outside of their regular cadence (e.g. last minute bbq box for a specific weekend)\n\n[MVP - Milestone 1] Requirements for One-off boxes for prospects customers\n\nNote: MVP for prospects is not using the new OTP end point yet. It’ll be used on subsequent milestones for better scoping\n\nUser Stories\n\n\tAcceptance Criteria\n\n\tDesign/ Notes (Figma)\n\n\tTechnical Notes\n\n\t1. Ability to discover and browse OTP products as a prospect\n\n\t1.a. OTP option on Plans Page\n\nAs a prospect customer, I want to compare the one time purchase vs subscription options, so that I can decide the most suitable option for me. \n\n\t* Customer can choose the same box size (M, L, XL) and then toggle between\n\n   * Subscription option (with cadences)\n\n   * One time purchase (OTP) option\n\n* If customer choose the OTP option, then\n\n   * The price of the boxes changes to the OTP prices[ah]\n\n   * [Note] On CCM, the OTP options are setup with different SKU, hence toggle to the OTP SKUs when they choose this\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t  \n\n\n\n\tThere will be multiple variants to the experiment in Statsig\n\n* Each variant has its set of OTP SKU to differentiate the base box price\n\n* All variants have the same box size options (M, L, XL)\n\n\n\n\n\nFor example:\n\n* Variant A\n\n   * MR-OTP-6-A: $149\n\n   * MR-OTP-12-A: $269\n\n   * MR-OTP-18-A: $399\n\n* Variant B\n\n   * MR- OTP-6-B: $119\n\n   * MR-OTP-12-B: $229\n\n   * MR-OTP-18-B: $359\n\n\n\n\n\nDo not need to return cadence for new OTP end point[ai][aj]\n\n\t1.b. Exclude Voucher Application\n\nAs a prospect customer, I understand if I cannot get the voucher benefits if I am choosing OTP, so that I can make comparisons and informed decisions\n\n\t* IF has an active voucher attached AND customer choose the OTP option on Plans (req 1.a.), then detached the benefit of the vouchers which includes\n\n   * Not applying the price discounts to the main OTP box price\n\n   * Not offering the free add-on items\n\n   * The benefit banner will also disappears\n\n* However, if they toggle back to the Subscription option, the voucher benefits re-apply without any additional action from the customers\n\n\n\n\n\n* Components:\n\n   * \"$50 off in your first delivery\" --> Dynamic value based on voucher attached. Remove when no voucher\n\n   * \"Save up to $500 per year\" --> Hard coded value for all boxes, but hide when no voucher attached\n\n   * \"Free cut on every delivery\" --> Hide when no free cut voucher attached\n\n   * Other components are static\n\n\n\n\n\n\tInvestigate in CUI if we can exclude OTP SKU (part of different product family)\n\n\n\n\n\n\t1.d. Select Cuts (Recipe) Menu\n\nAs a prospect customer, I want to select specific cuts and see any free or surcharge items based on my chosen OTP box size, so that I can customize my order and understand the full contents and potential extra costs before checkout.\n\n\t* The Select cuts experience are the same with subscription WITHOUT all the benefits applied\n\n   * Free add-on component\n\n   * Discount on Order Summary\n\n   * Hide Benefit banner\n\n\t\n\n\n\n\tMenu can be differentiated between OTP vs subscription\n\n* OTP menu setup on CCM related to OTP SKUs\n\n* Hide Surcharge items is visible and can be added to cart (setup through CCM)\n\n\t2. Ability to complete checkout for OTP orders on Good Chop pre-checkout funnel\n\n\t2.a. Account Creation\n\nAs a prospect customer, I want to be able to create an account or log in with an existing account (without a subscription) after selecting my cuts, so that I can proceed with my one-time purchase.\n\n\t* Main function of account pages is the same for OTP\n\n   * [Status quo] Customer proceeds to /signup after choosing cuts\n\n   * [Status quo] Customer creates account with eligible email\n\n   * [Status quo] Customer with an account (without subscription) can login without creating a new account\n\n* Remove information related to benefits\n\n   * Hide Benefit banner (below header)\n\n   * Hide Free add-on banner (below sign up fields)\n\n   * Discount on Order Summary\n\n\tHide this banner:\n\n  \n\n\n\n\t\n\n\n\n\t2.b. OTP Pricing on Order Summary\n\nAs a prospect customer, I want to see a clear and itemized summary of my OTP order on the checkout page, including box price, shipping, applied discounts, and all taxes, so that I understand the final cost before payment.\n\n\t* /checkout pages, Order summary displays \n\n   * Box pricing for OTP box based on the one chosen on /plans (req 1.a.)\n\n   * Shipping price\n\n   * Remove discount and benefit applied\n\n* Shipping price is the same with subscription order, but can be configured manually\n\n\t\n\n\n\n\t\n\n\n\n\t2.c. Delivery Options\n\nAs a prospect customer, I want to easily input my address and phone number, and see available delivery dates and times specifically for my OTP order, so that I can ensure my delivery is scheduled conveniently.\n\n\t* Main function of account pages is the same for OTP\n\n   * [Status quo] Customer needs to input address details and phone number\n\n   * [Status quo] Customer is defaulted to a delivery time after filling in the address → Look at technical notes for Delivery Options\n\n* Change copy on (refer to figma for source of truth)\n\n   * Copy on “Delivery Day” component\n\n* Remove information related to benefits\n\n   * Free add-on banner (below header)\n\n   * Discount & FFL on Order Summary\n\n   * Hide the Voucher Input field\n\n\t  \n\n\n\n\tDelivery Options for OTP are the same for Subscription, however\n\n* Since customers do not choose cadence on Plans, default them to the 4WEEK option[ak]\n\n* This is relevant on the graduation flow req 4.a\n\n\n\n\n\nDo not need to return cadence for new OTP end point[al][am]\n\n\t2.d. Payment & Checkout\n\nAs a prospect customer, I want to see all available payment methods and clearly see that my order is a one-time purchase that will only be charged once, so that I can complete my transaction confidently.\n\n\t* Main function of checkout pages is the same for OTP\n\n   * [Status quo] All payment methods are available for OTP orders\n\n   * [Status quo] Customer needs to input eligible payment details\n\n* Remove/ change payment information related to Subscription\n\n   * Change the Subscription T&C\n\n   * Remove the Checkbox \n\n* Remove information related to benefits\n\n   * Free add-on banner (below header)\n\n   * Discount & FFL on Order Summary\n\n   * Hide the Voucher Input field\n\n* Handle cart de-duplication (thread)[an][ao]. \n\n   * Whenever a customer clicks on “Place order”, we should not always create a new cart ID - we should always send just a single cart ID per session. Even if a customer updates their cuts, we should patch the same cart ID so that we only send one cart ID to the new OTP endpoint. \n\n\tHide this:\n\n  \n\n\n\nChange copy and remove checkbox\n\n  \n\n\n\n\tUse the new OTP end point\n\n\n\n\n\nNote: To handle deduplication, aside from the FE change to send a single cart ID, Puneet Joshiwill implement that if COS receives the same cart ID while it is still processing, it wouldn't create 2 separate orders. Thread\n\n\t2.e. Payment Loading State[ap]\n\nAs a prospect OTP customer, I want to understand if my payment is still being processed, so I can wait and know for sure that my order is placed.\n\n\t* If customer fill up the payment correctly and click on “Place Order”\n\n   * Processing Order State → Show this state when waiting for the payment to be processed and orders to be created on the backend\n\n   * Processing Order State → Show this state after the order creation and payment charging is successful \n\n      * Bring customers to Order confirmation page within x seconds\n\n   * Error state → Show this state if the payment OR order creation is unsuccessful\n\n      * Bring customers back to payment page with error message\n\n\tRefer to figma for latest design\n\n  \n\n\n\n\t\n\n\n\n\t3. Ability to receive order confirmation and track delivery\n\n\t3.a. Order Confirmation Page\n\nAs an OTP customer, I want to see a clear order confirmation page after my OTP purchase, displaying all correct pricing, selected cuts, delivery date, and confirmation that it's a one-time delivery, so that I have immediate assurance of my order details.\n\n\tAfter a successful OTP order checkout\n\n* Customer redirects to /subscription-loading pages, Order confirmation page displays \n\n   * Correct prices box price, shipping price, (if any) discount and benefit applied, (if any) taxes and fees (eg, GST)\n\n   * Correct cut selection information\n\n   * Correct delivery date information\n\n* Hide the “Pre cut-off change box” information\n\n* Additional information that this is an OTP order and will only be delivered once\n\n\tHide ticker information:\n\n  \n\n\n\n\tImages might not work?[aq][ar]\n\n\n\n\n\nIn order to show selected cuts, BE change needs to happen to fetch public menu instead of my-deliveries menu which needs sub_id (thread). Ticket to be done by X-Flex: XSELL-419: [Post Checkout] [Order Summary] Modify fetch menu function in reactivations bff\n\n\t3.b. Order Confirmation email\n\nAs an OTP customer, I want to receive a detailed order confirmation email for my OTP purchase, including correct pricing, cut selections, delivery date, and explicit mention of it being a one-time delivery, so that I have a record of my order.\n\n\tAfter a successful OTP order checkout\n\n* Customer receives an Order Confirmation email (list here) from CRM with:\n\n   * Correct prices box price, shipping price, (if any) discount and benefit applied, (if any) taxes and fees (eg, GST)\n\n   * Correct cut selection information\n\n   * Correct delivery date information\n\n* Additional information that this is an OTP order and will only be delivered once\n\n\t\n\n\n\n\tOrder confirmation event is available in SF as expected, CRM manager needs to:\n\n* Create a separate email template for OTP SKUs to differentiate the content\n\n\t3.c. Dashboard Order Management\n\nAs an OTP customer, I understand that I cannot directly edit, reschedule, or cancel my OTP order from my dashboard, so that I know to contact customer care if I need assistance with my order.\n\n\t* The OTP dashboard is newly created only for OTP orders\n\n   * Customers can see multiple OTP orders\n\n   * The latest OTP order will be expanded, the rest are hidden under a chevron\n\n   * Customers can see the Order details and order summary\n\n   * Customers can click “view order” to open the order summary modal (similar to subscription)\n\n\tRefer to figma for latest design\n\n  \n\n\n\n\tThe OTP dashboard is newly created page under Whitelabel repo – (/my-deliveries/otp) url TBD\n\n\n\n\n\nIn order to show selected cuts, BE change needs to happen to fetch public menu instead of my-deliveries menu which needs sub_id (thread). Ticket to be done by X-Flex: XSELL-419: [Post Checkout] [Order Summary] Modify fetch menu function in reactivations bff\n\n\t3.d. Tracking\n\nAs an OTP customer, I want to access my delivery tracking number from my dashboard or an order tracking email once my OTP order has shipped, so that I can monitor its delivery status.\n\n\tOnce the order is being shipped from the warehouse, customers can access the delivery tracking number from:\n\n* CTA from OTP Dashboard\n\n   * Clicking on the CTA opens the Delivery tracking in a new tab\n\n* Order tracking email from CRM (list here)\n\n\t1. To check: will tracking work out of the box or we need to change something? Thread\n\n\n\n2. Note to CRM for OTP Order Confirmation email:\n\n→ inform customers that they will get a separate delivery tracking email / link on the website\n\n\t3.e. Order States\n\nAs an OTP customer, I want to understand if my order is still on delivery or already delivered, so that I can decide what to do next.\n\n\tThe order statuses for OTP are similar to subscription orders\n\n   * Pre cut-off: No pre cut-off state for OTP because after checkout the order is directly on post cut-off state\n\n   * Post cut-off: This is the default state after order created, the title of the box will say “Arriving on xx date” \n\n   * On Delivery: Once delivery is triggered, the “Track delivery” CTA will be visible\n\n   * Finished/ Delivered: The OTP completed orders are still shown on the page with “Delivered on xx date” as the order title\n\n   * Note: This state also applies for cancelled box\n\n\t\n\n\n\n\t3.f. OTP Dashboard Entry Points[as]\n\nAs an OTP customer, I want to access the OTP dashboard, so that I can check my ongoing or past OTP orders.\n\n\n\n\n\n\tThere is no redirection logic to bring customers to the OTP Dashboard page. (In status quo, subscription customers are always redirected to dashboard after login)\n\n\n\n\n\nTo access the OTP Dashboard, customers can find the entry points from multiple places. These pages will check if the logged in customers has an ongoing OTP order\n\n   * [P0] Customers with no subscription\n\n   * /Plans\n\n   * /checkout\n\n   * [P1] Customers with Active OR Inactive subscription\n\n   * /my-deliveries (Active state) [P1]\n\n   * /settings/plan/reactivate (Formers state, Reactivation page) [P1]\n\n   * /my-deliveries (Formers state) [P2 - since CTA leads to /reactivate anyway]\n\n\n\n\n\nWhen customer click on entry point then:\n\n   * Open a new tab\n\n   * The new tab opens the OTP Dashboard\n\n\tRefer to figma for latest design\n\n  \n\n\n\n\t\n\n\n\n\t4. Ability to convert OTP users to a subscription\n\n\t4.a.[at] Offer for converting to a Subscription\n\nAs a customer converting to a subscription, I want to receive clear additional discounts or benefits for my new subscription orders, so that I am incentivized to continue with the service.[au]\n\n\t   * On the OTP Dashboard, customers with OTP orders will see a “Subscription Graduation” section:\n\n   * Show discounts on their next subscription benefits\n\n   * Show Free add-on on their next subscription benefits (if applicable)\n\n   * CTA: if clicked, will bring them to the “Graduation page” which is our current reactivation page with some tweaks\n\n   * The “Graduation Section” disappears if customers have a subscription attached to their account (either Active or Inactive)[av]\n\n\t  \n\n\n\n\tSubscription voucher is created in advance and hard coded based on statsig experiment variant[aw], for example:\n\n   * Code ABC → variant A = $50 + Bacon\n\n   * Code 123 → variant B = $30 + Wings\n\n   * Code XYZ → variant C = $20 + Ribeyes\n\nConfirm we don’t need to experiment, just hardcode 1 voucher\n\n\n\n\n\nVoucher code details [TBD]\n\n\t4.b. Subscription Graduation Page (Plans Page)\n\nAs a customer, I want to easily create a subscription order using my existing OTP address and payment details, so that I can seamlessly transition to a recurring service after trying a one-time purchase.\n\n\t   * Customer is redirected to /plans with the OTP variation as default\n\n   * Customer can purchase another OTP order, OR a new subscription\n\n   * Customer goes to /plans with a predefined “graduation” voucher\n\n\t\n\n\n\n\tNote: customers is redirected to /plans\n\n\t4.c Successful Graduation to Subscription\n\n\n\n\n\nAs a customer that subscribes, I want to know if I have successfully subscribed with all the benefits that are offered, so that I can be sure and manage my next Good Chop box.\n\n\tAfter successful “graduation” to subscription, the normal subscription experience is triggered.\n\n   * Customers got order confirmation email\n\n   * Customers redirected to /my-deliveries to see their subscription order\n\n\t\n\n\n\n\t\n\n\n\n\t4.d. Entry point to Subscription dashboard[ax]\n\nAs an OTP customer with a subscription (active or inactive), I want to go back to my subscription dashboard, so that I can manage my subscription, not just my OTP orders.\n\n\n\n\n\n\t   * IF OTP customer has a subscription_id, then remove the graduation component (req 4.a) and show entry point to subscription dashboard.\n\n   * Customer will be redirected to /my-deliveries – applicable for both active or inactive subscription\n\n\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t5. Ability for customer care to support OTP orders\n\n\t4.a. Customer Care Access\n\nAs a customer, I want to easily reach Good Chop Customer Care and find relevant FAQ content, so that I can get support for my OTP order.\n\n\t   * Customer can reach out to Good Chop Customer care and be routed to appropriate support based issues\n\n   * Available FAQ content around OTP orders\n\n\t\n\n\n\n\t\n\n\n\n\t4.a. OTP Order Management in BOB & OWL (migration to OWL by EOY)\n\nAs a Customer Care agent, I want to access and manage OTP orders in BOB, so that I can effectively assist customers with their OTP order inquiries.\n\n\t   * Customer Care agents can access OTP orders through BOB\n\n   * Make changes to OTP orders from BOB\n\n   * Order cancellation and Refund\n\n   * Delivery Rescheduling\n\n   * Edit cuts/ recipe selections\n\n\t\n\n\n\n\t\n\n\n\n\t6. Ability for internal operations, logistics, marketing and finance teams to process and manage OTP orders\n\n\t5.a. Internal Operations & Logistics\n\nAs a warehouse team member, I want one-time purchase orders to be clearly identifiable, so that I know not to attach freebies or other subscription-specific items to them.\n\n\tOne time purchase orders need to be identifiable for SCM so they know not to attach things like freebies to the order\n\n\t\n\n\n\n\t\n\n\n\n\t5.b. Finance\n\nAs a Finance team member, I want OTP orders to be clearly differentiated and their revenues recognized in our financial tools, so that we can accurately track and report on one-time purchase sales.\n\n\tOTP orders can be differentiated and recognized the revenues on the financial tools\n\n\t\n\n\n\n\t\n\n\n\n\t5.c. Data & Analytics\n\nAs an internal team, I want OTP order data to be captured correctly, categorized on relevant tables, and identifiable on dashboards, so that I can easily gain insights and monitor performance without extensive manual effort.\n\n\t   * Backend and Frontend data for OTP orders are captured and categorized correctly on HF tables, and included on major Tableau dashboards with filters. \n\n   * OTP orders must be identifiable among orders.\n\n\t\n\n\n\n\t\n\n\n\n\tAds attribution\n\nAs the marketing team, I want OTP orders to still be captured as conversions in our marketing platforms, so that the marketing algorithms continue to optimize for subscriptions.\n\n\t\n\n\n\n\t\n\n\n\n\tThread\n\n\n\n\n\nSale event in BAU already sends checkout_type parameter so current infrastructure should handle this similarly\n\n\n\n\n\nNext step: AdTech to test once Staging OTP order can be created.\n\nNote: AdTech code freeze on Dec 18, 2025\n\n\tOther \n\n   * Legal threads\n\n   * Thread 1: Review of legal requirements in OTP funnel and graduation copy: remove timer; copy approved\n\n   * Thread 2: Footer should be present in dashboard. T&C content does not need to be updated.\n\n[Milestone 2] Requirements for One-off boxes for Active and Former customers\n\nUser Stories\n\n\tAcceptance Criteria\n\n\tDesign\n\n\tTechnical Notes\n\n\t1. Ability to discover One Time Purchase for Actives and Formers \n\n\t1.a. OTP Entry point on Actives Dashboard\n\nAs a xxx\n\n\tOTP Component on Actives Dashboard /my-deliveries:\n\n   * Position below the main subscription box order\n\n   * Explanation of a one time order\n\n   * Main CTA to “order OTP” → if click opens the OTP purchase flow (requirement 2 below)\n\n\t  \n\n\n\n\t\n\n\n\n\t1.b. OTP Entry point on Actives Cancellation Deflection\n\nAs a xxx\n\n\tOTP Component on Cancellation deflection page /cancellation:\n\n   * Position below all of the benefits of subscription\n\n   * Explanation of one time order vs cancelling\n\n   * Main CTA to “order OTP” → if click opens the OTP purchase flow (requirement 2 below)\n\n\t\n\n\n\n\t\n\n\n\n\t1.c. OTP Entry point on Formers Dashboard\n\nAs a xxx\n\n\tOTP Component on Formers Dashboard /my-deliveries:\n\n   * Position below the Subscription option\n\n   * Explanation of one time order vs subscribing\n\n   * Main CTA to “order OTP” → if click opens the OTP purchase flow (requirement 2 below)\n\n\t  \n\n\n\n\t\n\n\n\n\t1.d. OTP repurchase entry point for OTP MVP customers (related to Milestone 1)\n\nAs a xxx\n\n\tOTP Component on OTP customers (from MVP) Dashboard /my-deliveries:\n\n   * Position below the “Graduation” option\n\n   * Explanation of one time order vs subscribing\n\n   * Main CTA to “reorder OTP” → if click opens the OTP purchase flow (requirement 2 below)\n\n\t  \n\n\n\n\t\n\n\n\n\t2. Ability to order One Time Purchases for Actives and Formers\n\n\t2.a. Meal Selection/ Select Cuts page\n\nAs a xxx\n\n\t   * \t\n\n\n\n\tTBD\n\n\t2.b. OTP Review Page\n\nAs a xxx\n\n\t   * \t\n\n\n\n\tTBD\n\n\t2.c. OTP Confirmation Page\n\nAs a xxxx\n\n\t   * \t\n\n\n\n\tTBD\n\n\t3. Ability to view and track OTP orders\n\n\t3.a. OTP Order Management on Dashboard\n\nAs a xxx\n\n\tAfter a successful OTP order checkout\n\n   * Customer redirects to /subscription-loading pages, Order confirmation page displays \n\n   * Correct prices box price, shipping price, (if any) discount and benefit applied, (if any) taxes and fees (eg, GST)\n\n   * Correct cut selection information\n\n   * Correct delivery date information\n\n   * Additional information that this is an OTP order and will only be delivered once\n\n\t\n\n\n\n\tTBD\n\n\t3.b. Order Tracking\n\nAs a xxx\n\n\tAfter a successful OTP order checkout\n\n   * Customer receives an Order Confirmation email (list here) from CRM with:\n\n   * Correct prices box price, shipping price, (if any) discount and benefit applied, (if any) taxes and fees (eg, GST)\n\n   * Correct cut selection information\n\n   * Correct delivery date information\n\n   * Additional information that this is an OTP order and will only be delivered once\n\n\t\n\n\n\n\t\n\n\n\n\t3.c. Invoice and Payment details\n\nAs a xxx\n\n\t   * Customers CANNOT edit, reschedule or cancel their orders directly on the Dashboard (/my-deliveries)\n\n   * IF needed, customers can reach out to customer care for order management → go to requirement 4.a.\n\n\t\n\n\n\n\tTBD\n\n\t3.d. Past Orders\n\nAs a xxx\n\n\tOnce the order is being shipped from the warehouse, customers can access the delivery tracking number from:\n\n   * CTA from Dashboard (/my-deliveries)\n\n   * Order tracking email from CRM (list here)\n\n\t\n\n\n\n\tTBD\n\n\t4. Ability for customer care to support OTP orders\n\n\t4.a. Customer Care Access\n\nAs a customer, I want to easily reach Good Chop Customer Care and find relevant FAQ content, so that I can get support for my OTP order.\n\n\t   * Customer can reach out to Good Chop Customer care and be routed to appropriate support based issues\n\n   * Available FAQ content around OTP orders\n\n\t\n\n\n\n\tTBD (FAQ)\n\n\t4.a. OTP Order Management in BOB & OWL (migration to OWL by EOY)\n\nAs a Customer Care agent, I want to access and manage OTP orders in BOB, so that I can effectively assist customers with their OTP order inquiries.\n\n\t   * Customer Care agents can access OTP orders through BOB\n\n   * Make changes to OTP orders from BOB\n\n   * Order cancellation\n\n   * Delivery Rescheduling\n\n   * Add and remove voucher benefits\n\n   * Edit cuts/ recipe selections\n\n\t\n\n\n\n\t\n\n\n\n\t5. Ability for internal operations, logistics, and finance teams to process and manage OTP orders\n\n\t5.a. Internal Operations & Logistics\n\nAs a warehouse team member, I want one-time purchase orders to be clearly identifiable, so that I know not to attach freebies or other subscription-specific items to them.\n\n\tOne time purchase orders need to be identifiable for SCM so they know not to attach things like freebies to the order\n\n\t\n\n\n\n\t\n\n\n\n\t5.b. Finance\n\nAs a Finance team member, I want OTP orders to be clearly differentiated and their revenues recognized in our financial tools, so that we can accurately track and report on one-time purchase sales.\n\n\tOTP orders can be differentiated and recognized the revenues on the financial tools\n\n\t\n\n\n\n\t\n\n\n\n\t5.c. Data & Analytics\n\nAs an internal team, I want OTP order data to be captured correctly, categorized on relevant tables, and identifiable on dashboards, so that I can easily gain insights and monitor performance without extensive manual effort.\n\n\t   * Backend and Frontend data for OTP orders are captured and categorized correctly on HF tables, and included on major Tableau dashboards with filters. \n\n   * OTP orders must be identifiable among orders.\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t   * \tActive Customers - [Milestone 2] Requirements for One-off boxes for active customers\n\n\n\n\n\n2. P0 (must have) requirements\n\n2.1 Milestone 1 (GoodChop, September 2025)\n\n\n\n\n\n[Checkout]\n\nSystem allows logged-in users with paused subscriptions to access an OTP purchasing section/flow, select items, and checkout without triggering full subscription reactivation. Order confirmation and delivery are specific to this OTP order.\n\n\n\n\n\n[Checkout]\n\nSystem allows active subscribers to place an OTP order as a distinct transaction. The OTP order should have its own delivery scheduling options (if different from the regular subscription) and payment process. It should not interfere with their regular subscription unless an explicit choice is made by the user to combine or replace (future feature).\n\n\n\n\n\n\n\n\n\n3. P1-3 requirements\n\n\n\n\n\n\n\n\n\n[Cancellation]\n\nSystem provides a self-service option for customers to manage their OTP orders up to the defined OTP cut-off time for that specific product/campaign.\n\nPriority: P1, All\n\n\n\n\n\n[Repurchase]\n\nFor logged-in customers, the system provides a clear order history that includes OTP purchases. An option to \"reorder\" or \"buy again\" for a previous OTP product should be available if that product is currently available for OTP.\n\nPriority: P1, All\n\n\n\n\n\n[Checkout as a customer - App, Web (x3) - reuse checkout details]\n\n\n\n\n\n[Gifting]\n\nSystem allows the customer to specify a different shipping address from their billing address during OTP checkout. A simple \"this is a gift\" checkbox could hide pricing on the packing slip.\n\nPriority: P2, All\n\n(Is it really a P1?)\n\n\n\n\n\n[Gifting]\n\nDuring the OTP gifting flow, after specifying the recipient's address, the system provides an option to type a short personalized message. This message would be printed on the packing slip or a separate small card.\n\nPriority: P3, All\n\n\n\n\n\n[Guest Checkout]\n\nSystem offers a guest checkout path for OTP orders, collecting only essential information required to process and fulfill the order. Option to create an account post-purchase should be available.\n\nPriority: P3, All\n\n\n\n\n\n\n\n\n\n\n\n\n\nBenefits:\n\n   * Benefits creation\n\n   * To apply you need a subscription\n\n   * Wallet needs to handle OTP (4-6 weeks)\n\n   * Old end point Voucher Validation Service – Hacky solution, could break something else\n\n   * Cannot commit for September, start around October\n\n   * Pricing\n\n🎁 Experience: HF Seasonal Boxes\n\nHello Fresh Seasonal Boxes\n\nHelloFresh Group's seasonal box offerings, traditionally sold as one-off purchases through separate microsites and unconnected operational flows, have historically faced significant challenges including declining sales, a poor user experience requiring customers to re-enter details and preventing seamless order tracking, and substantial operational overhead due to disconnected systems. Recognizing the significant market opportunity for festive and occasion-based offerings, the new One-Time-Purchase (OTP) initiative aims to overcome these limitations by integrating seasonal boxes directly into the core HelloFresh experience.\n\n\n\n\n\nUseful resources:\n\n   * Seasonal boxes and one-off ordering capability 2024 & beyond proposal\n\n   * ANZ Christmas Box: https://christmas.hellofresh.com.au/\n\n   * [ANZ] Christmas Box Kick-Off_2025\n\n[MVP] Requirements for Hello Fresh Seasonal Boxes\n\n   1. Ability to discover and browse OTP products for Seasonal Boxes\n\n   2. Ability to complete checkout for OTP orders for Seasonal Boxes\n\n   3. Ability to receive order confirmation and track delivery\n\n   4. Ability for customer care to support OTP orders\n\n   5. Ability for internal operations, logistics, and finance teams to process and manage OTP orders\n\n\n\n\n\nUser Stories\n\n\tAcceptance Criteria\n\n\tDesign (WIP)\n\n\t1. Ability to discover and browse OTP products\n\n\t1.a. Seasonal Boxes Entry points\n\nAs a new or existing HF customer, I want to easily find and access the Seasonal Boxes experience through various entry points, so that I can easily discover and start exploring the seasonal box options.\n\n\t   * Seasonal box experience is accessible via a direct landing page/microsite\n\n   * External entry points\n\n   * CRM communications\n\n   * SEO \n\n   * Paid advertisements\n\n   * In-app entry points\n\n   * In-app banners\n\n   * Notification Center\n\n\t\n\n\n\n\t1.b. Seasonal Boxes Microsite – example\n\nAs a new or existing HF customer, I want to access the Seasonal Boxes microsite, and see a list of available box options, so that I can easily choose a suitable seasonal box and understand its availability.\n\n\t   * Microsite is web-only (non native app) \n\n   * If open through an in-app link, then it’ll open a web-app within the HF app\n\n   * Homepage list the available pre-set seasonal box sizes and variants (e.g., classic, seafood, different portion sizes)\n\n   * All boxes presented are One Time Purchase only\n\n   * The products are purchasable for a limited period only, (for eg. from Oct to Dec, for Christmas)\n\n   * If customer access during off period, a generic message on off-season is presented\n\n\t\n\n\n\n\t1.c. Product/ Box Selection\n\nAs a new or existing HF customer, I want to be able to choose from multiple Seasonal Box options, so that I can select a seasonal box that fits my needs and preferences.\n\n\t   * Customer can choose one from multiple Seasonal Box options[ay][az][ba]\n\n   * Each box has a different size, price and pre-set menu content\n\n   * Customers cannot purchase individual recipes; they must choose a set menu.\n\n   * Each box option is setup as as separate SKU_id on CCM[bb][bc]\n\n   * Size, definition and price dynamically follows the SKU input from CCM\n\n\t\n\n\n\n\t1.d. Voucher Application\n\nAs a new or existing HF customer, I want vouchers to be applied to Seasonal Boxes, so that I can take advantage of available discounts when purchasing a seasonal box.\n\n\t   * Voucher is auto-applied at homepage depending on entry point, or customers can enter voucher/discount codes manually\n\n   * Voucher is specifically setup for Seasonal Boxes only, and not interfere with any subscription benefits\n\n   * Benefits are setup through CUI:\n\n   * Single box discount\n\n   * Free shipping\n\n\t\n\n\n\n\t2. Ability to complete checkout for OTP orders for Seasonal Boxes\n\n\t2.a. Account Creation or Login\n\nAs a new or existing HF customer, I want to be able to create an account, log in, or automatically continue if I'm already logged in, so that I can complete my seasonal box purchase.\n\n\t   * Customer needs to have an account before proceeding to checkout\n\n   * Account use cases:\n\n   * If customer is not a HF user, then account creation is needed[bd][be]\n\n   * If customer is a HF user and was not logged in, then they need to login with registered credentials\n\n   * If customer is a HF user and is logged in (web or app), then automatically continue with the logged in credentials\n\n\t\n\n\n\n\t2.b. Pricing on Checkout\n\nAs a logged in customer, I want to see a clear display of the total price on the checkout page, so that I understand the final cost of my seasonal box order.\n\n\t   * The checkout pages displays \n\n   * Box pricing for OTP box\n\n   * Shipping price\n\n   * (if any) Discount and benefit applied\n\n   * (if any) Taxes and fees (eg, GST)\n\n   * Shipping price is configurable on per SKU level\n\n\t\n\n\n\n\t2.c. Delivery Options\n\nAs a logged in customer, I want to see a clear delivery window and be able to input my address (or have it pre-filled if I'm an existing user), so that I can schedule my seasonal box delivery.\n\n\t   * The delivery window is fixed to a specific timeframe around the event date (e.g., 21.12 to 22.12 for Christmas)\n\n   * The cutoff time for ordering is xx days before delivery window, configurable through the system\n\n   * New customers needs to input address details and phone number\n\n   * Existing HF customers has their address pre-filled with their most recent delivery address\n\n   * A validation based on customer Zipcode to check if Seasonal Boxes is able to deliver to their area[bf]\n\n\t\n\n\n\n\t2.d. Payment & Checkout\n\nAs a logged in customer, I want to be able to use all available HelloFresh payment methods or use previous options if I'm an existing user, so that I can easily and securely pay for my seasonal box.\n\n\t   * All payment methods that are currently available for HF purchase are available for Seasonal Boxes\n\n   * New customers needs needs to input eligible payment details\n\n   * Existing HF customers has their previously used payment option visible\n\n\t\n\n\n\n\t3. Ability to receive order confirmation and track delivery\n\n\t3.a. Order Confirmation Page\n\nAs a Seasonal Box customer, I want to see a clear order confirmation page after purchasing a Seasonal Box, displaying correct pricing, delivery date, and confirmation that it's a one-time order, so that I have assurance of my order details.\n\n\tAfter a successful Seasonal Box order checkout\n\n   * Customer redirects to Order confirmation page displays \n\n   * Correct prices box price, shipping price, (if any) discount and benefit applied, (if any) taxes and fees (eg, GST)\n\n   * Correct delivery date information\n\n   * Additional information that this is an OTP order and will only be delivered once\n\n\t\n\n\n\n\t3.b. Order Confirmation email\n\nAs a Seasonal Box customer, I want to receive a detailed order confirmation email for my Seasonal Box purchase, including correct pricing, delivery date, and confirmation that it's a one-time delivery, so that I have a record of my order.\n\n\tAfter a successful Seasonal Box order checkout\n\n   * Customer receives an Order Confirmation email (list here) from CRM with:\n\n   * Correct prices box price, shipping price, (if any) discount and benefit applied, (if any) taxes and fees (eg, GST)\n\n   * Correct delivery date information\n\n   * Additional information that this is an OTP order and will only be delivered once\n\n\t\n\n\n\n\t3.c. Order Management\n\nAs a Seasonal Box customer, I want to understand that my Seasonal Box order will not appear in the \"my deliveries\" section and that I cannot directly edit, reschedule, or cancel it, so that I know to contact customer care for assistance.\n\n\t   * The seasonal box order DOES NOT appear in the \"my deliveries\" section within the app or website\n\n   * Customers CANNOT edit, reschedule or cancel their orders directly on the app or website\n\n   * IF needed, customers can reach out to customer care for order management → go to requirement 4.a.\n\n\t\n\n\n\n\t3.d. Tracking\n\nAs a Seasonal Box customer, I want to receive a delivery tracking number via CRM email once my Seasonal Box order has shipped, so that I can monitor its delivery status.\n\n\tOnce the order is being shipped from the warehouse, customers can access the delivery tracking number from a CRM email (list here)\n\n\t\n\n\n\n\t4. Ability for customer care to support OTP orders\n\n\t4.a. Customer Care Access\n\nAs a Seasonal Box customer, I want to easily reach HelloFresh Customer Care for support and find relevant FAQ content regarding Seasonal Boxes, so that I can get help with any issues or questions I may have.\n\n\t   * Customer can reach out to Hello Fresh Customer care and be routed to appropriate support based issues\n\n   * Available FAQ content around Seasonal Boxes\n\n\t\n\n\n\n\t4.a. OTP Order Management in BOB\n\nAs a Customer Care agent, I want to be able to access and manage Seasonal Box orders through BOB, including making changes, cancellations, rescheduling deliveries, and adjusting addresses or voucher benefits, so that I can effectively assist customers with their Seasonal Box order inquiries.\n\n\t   * Customer Care agents can access Seasonal Box orders through BOB\n\n   * Make changes to OTP orders from BOB\n\n   * Order cancellation\n\n   * Delivery rescheduling\n\n   * Change addresses\n\n   * Add and remove voucher benefits\n\n   * Edit cuts/ recipe selections[bg]\n\n\n\n\n\nQuestions:\n\n   * Do we need payment details (token) in BOB?\n\n\t\n\n\n\n\t5. Ability for internal operations, logistics, and finance teams to process and manage OTP orders\n\n[bh][bi][bj][bk][bl][bm]\t\n\n5.a. Internal Operations & Logistics\n\nAs a warehouse team member, I want Seasonal Box orders to be clearly identifiable, so that I know if there are special handling required.[bn]\n\n\tSeasonal box orders need to be identifiable for SCM so they know not to attach things like freebies to the order\n\n\t\n\n\n\n\t5.b. Finance\n\nAs a Finance team member, I want Seasonal Box orders to be clearly differentiated and their revenues recognized in our financial tools, so that we can accurately track and report on one-time purchase sales.\n\n\tSeasonal Box orders can be differentiated and recognized the revenues on the financial tools\n\n\t\n\n\n\n\t5.c. Data & Analytics\n\nAs an internal team, I want Seasonal Box order data to be captured correctly, categorized on relevant tables, and identifiable on dashboards, so that I can easily gain insights and monitor performance without extensive manual effort.\n\n\t   * Backend and Frontend data for Seasonal Box orders are captured and categorized correctly on HF tables, and included on major Tableau dashboards with filters. \n\n   * Seasonal Box orders must be identifiable among orders.\n\n\t\n\n\n\n\t\n\n\n\nQuestions:\n\n   1. Can customers check out 2 SKUs (at once, or separately)? \n\n   1. No for multi order checkout\n\n   2. Modularity in SKU offering – creating different SKUs\n\n   2. Voucher management\n\n   1. Limitation to apply voucher for OTP purchase\n\n   2. Blanket discounts based on time (eg. Black Friday deal)\n\n   3. How do we collect GST and Taxes at ANZ right now?\n\n   1. No need to show on separate line → to be checked\n\n   2. NZ 15% GST\n\n   3. AU certain products\n\n   4. Customer Care and BOB & OWL details\n\n   1. Last minute cancellation → refunds\n\n   2. Offering discounts → depending on discount setup\n\n   3. Visibility on customer orders (identification for Seasonal Box order)\n\n   4. Error handling on recipes (waste)\n\n   5. Order processing flow (fulfillment and delivery)\n\n   1. Elyse will share a deck\n\n   6. SKU management\n\n   1. Create menu for Seasonal Box\n\n   2. Preference strings, ordering the menu and pushing to CCM\n\n   7. Forecasting\n\n   1. No for Christmas Box\n\n   2. Seasonal boxes maybe\n\n\n\n\n\n\n\n\n\nNotes HF UK use cases\n\n   * Gusto - 10% comes from OTP on reactivation\n\n   * 💊 Experience: Factor Form\n\nNote: Factor Form OTP is planned to launch later in the year (December 2025) following Good Chop’s launch in Q3\n\n\n\nPRD:Factor Form | One Time Purchase\n\nFigma: https://www.figma.com/design/rfbEDEqTFGKJvJyBOuwUxk/F-Form---OTP?node-id=2-31&t=1XjrX53VXovT9LcP-1\n\n📦 Experience: HF Formers\n\nRefer to the document here\n\nOne-Time Purchase for HF Formers\n\nAppendix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n________________\n\n\n\n\n\nOld Notes\n\n________________\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tGood Chop (Due Sept ‘25)\n\n\tSeasonal Boxes (Due Oct ‘25)[bo][bp][bq]\n\n\tVMS (TBD Q4 ‘25)\n\n\tDiscovery/ Entry Point\n\n\t   * Use case focuses on Prospect Customers on the pre-checkout funnel.\n\n   * Two discovery approaches are being considered:\n\n   * Introduce OTP as the first decision point on plans selection page.\n\n   * Postpone the OTP decision until the Delivery page, after choosing plans and cuts.\n\n\t   * Customers access these Seasonal boxes experience through separate landing pages/microsites[br] (example).\n\n   * In-app banners, CRM, SEO and paid ads serve as entry points to the microsite.\n\n   * Seasonal boxes are offered for a limited period, typically from September to December for holidays like Thanksgiving and Christmas.\n\n\t   * Customers identified the OTP option on the Product Page within the regular VMS customer experience.\n\n\tSKU & Menu\n\n\t   * The possibility of offering a limited menu for OTP compared to the subscription menu is a way to potentially incentivize customers to opt for a subscription.\n\n   * In the early funnel approach, the box and menu can be differentiated.\n\n   * In the later funnel approach, the same plan and menu as the subscription would be offered for OTP.\n\n\t   * Seasonal boxes consist of pre-defined boxes that are separate from the regular HF boxes.\n\n   * Customers cannot purchase individual recipes.\n\n   * Boxes are offered in various sizes. There is an option to add add-ons in some cases.[bs][bt][bu][bv]\n\n\t   * OTP option is set on an item level.\n\n   * Customers can:\n\n   *  add to cart two or more items with some of them set to be One time and other as a subscription.[bw][bx]\n\n   * Add one or more item and have all of \n\n   * them as one-time purchase order\n\n\tPricing & Benefits\n\n\t   * Distinct pricing and distinct discounts are required for OTP vs subscription.\n\n   * Subscription is offered with higher box discounts (or a lower box price), as well as free for life cut benefits.\n\n\t   * Pricing is defined based on the box size\n\n   * Discounts are available specifically for the Seasonal Boxes, and does not affect the HF regular subscription discount (if any).[by]\n\n\t   * Pricing is set on an item level, with price differentiation expected for OTP vs Subscription option\n\n   * Shipping fee differentiation expected for OTP vs subscription option (free shipping for subscription)\n\n   * Differentiation on the benefit level as well for OTP vs subscription[bz][ca]\n\n\tAccounts\n\n\t   * If a customer is not a current Good Chop user, they are required to register.\n\n   * If a customer is a Good Chop user, then they can use their Good Chop account login.\n\n\t   * If a customer is not a current HelloFresh user, they are required to register.\n\n   * If a customer is a HelloFresh user, then they can use their HelloFresh account login.\n\n\t   * If a customer is not a current Factor user, they are required to register.\n\n   * If a customer is a Factor user, then they can use their Factor account for a faster checkout.\n\n\tDelivery\n\n\t   * Similar delivery day options for OTP without cut-off date.\n\n   * No changes on filling in address details\n\n\t   * The delivery window is fixed on one time-frame around the date near the holiday depending on region or line haul (eg. 22-23 Dec for Christmas).\n\n   * The cutoff time for ordering is 14 days before delivery, which is longer than the standard 3-4 day cutoff for regular boxes.\n\n   * Have the option to add shipping fee \n\n   * Existing customers have a pre-filled delivery details from their main HF account.\n\n   * Address validation before proceeding to checkout (exclude certain regions).\n\n\t   * If a customer checks out with a combination of OTP + subscription products in the same session, the customer should receive all the products together in the first order, while subsequent orders only contain subscription products\n\n   * If a customer checks out multiple times in the same cutoff week - regardless whether OTP only or OTP and subscription -, the customer may receive these orders separat[cb]ely\n\n\tCheckout/ Payment\n\n\t   * The payment process is the same experience for regular subscription.\n\n   * Customers should see clear, transparent, and final pricing with information that it’s a one time cost.\n\n   * A confirmation email is sent after purchase.\n\n\t   * Additional GST[cc][cd] charge for ANZ.\n\n   * The checkout process uses the same experience for new customer signups.[ce]\n\n   * Existing customers have a pre-filled payment details from their main HF account.[cf]\n\n   * A confirmation email is sent after purchase (separate from regular HF).\n\n\t   * Payments can be combined for multiple items together regardless of OTP or subscription.\n\n   * All current payment functions[cg][ch] should work for OTP.\n\n\tPost Checkout & Order Management\n\n\t   * One-off customers see a tailored order summary on the dashboard.\n\n   * OTP customers are able to track its delivery from the dashboard.\n\n   * The order history and invoice should be reflected on the past order page.\n\n   * However, from the dashboard, one-off customers are unable to change plan size or delivery frequency.\n\n   * Cancellations and changes to the order can only be made by contacting customer care.\n\n\t   * The seasonal box order DOES NOT appear in the \"my deliveries\" section within the app or website.\n\n   * Tracking and invoicing is sent separately through emails and text messages.\n\n   * Cancellations and changes to the order can only be made by contacting customer care.\n\n\t   * Cancellations and changes to the order can only be made by contacting customer care.\n\n   * Tracking, invoice (?)\n\n\tGraduation/ Conversion to Subscription\n\n\t   * Graduation flow to convert OTP users to a subscription [important]\n\n\tN/A\n\n\t\n\n\n\n\tOps & Delivery Management\n\n\t   * The OTP order works with the current technical and operational flow.\n\n   * The fulfillment team can differentiate Seasonal Box vs regular subscription boxes.\n\n   * Integrated delivery route planning.\n\n\t   * The seasonal box order works with the current technical and operational flow.\n\n   * The fulfillment team can differentiate Seasonal Box vs regular subscription boxes.\n\n   * Recognize revenue[ci]\n\n\t   * One time purchase orders need to be identifiable for SCM so they know not to attach things like freebies to the order.\n\n\tCRM\n\n\t   * Customers who have made an OTP purchase should get BAU transactional email related (i.e. order confirmation, delivery tracking, etc.).\n\n\t   * HelloFresh Customers will receive communication aimed at buying Seasonal Boxes.[cj]\n\n   * Customers who have made a Seasonal Box purchase should get BAU transactional email related (i.e. order confirmation, delivery tracking, etc.).[ck]\n\n\t   * Customers who have made an OTP purchase should get BAU transactional email related (i.e. order confirmation, delivery tracking, etc.).\n\n   * If the customer combines OTP and subscription items in the same checkout, these would be placed as separate orders and trigger separate transactional emails by default.\n\n\tCustomer Care\n\n\t   * Good Chop customer care to support OTP orders including making changes, cancellations and other general inquiries.\n\n\t   * HelloFresh customer care to support Seasonal Box orders including making changes, cancellations and other general inquiries.\n\n   * Change address, change box size, add discounts[cl]\n\n\t   * Factor customer care to support OTP orders including making changes, cancellations and other general inquiries.\n\n\t\n\n\n\n\n\n\n\n2. P0 (must have) requirements\n\n2.1 Milestone 1 (GoodChop, September 2025)\n\n\n\n\n\n[Browse OTP Products as a prospect]\n\nProduct detail pages for OTP items must clearly list all contents. Seasonal Boxes: set menus, sizes. Good Chop: cuts, sourcing, weights. Marketplace items: brand, ingredients, allergens, nutritional info. Factor meals: ingredients, nutritional info, heating instructions, dietary tags (Keto, Calorie-Smart).\n\n(Breakdown into separate requirements per use-case, for example, “extend GoodChop plans page” + “Build seasonal box plans page”, to lay down the basement for FE requirements)\n\n\n\n\n\n[Menu Differentiation]\n\nSystem provides clear options for available customizations (e.g., dessert choice for seasonal box, specific cuts in a Good Chop bundle, meal selection for Factor OTP) or add-ons. Selections update configuration and price transparently.\n\nPriority: P0, Seasonal Boxes, Good Chop, Cross-Sell Factor\n\n(breakdown by use-cases - GoodChop, Seasonal Box, VMS)\n\n\n\n\n\n[OTP Entry points for customers?]\n\n\n\n\n\n[Browse OTP Products as a customer]\n\n\n\n\n\n[Login and SignUp adjustments - Web]\n\n\n\n\n\n[Pricing]\n\nSystem clearly displays pricing for OTP items, including all taxes[cm][cn] and fees (eg, GST) on product pages and in the cart. The final checkout page shows an itemized breakdown of all product costs, specific OTP shipping fees (which might differ from subscription shipping, and may vary for marketplace items), and all applicable taxes before the customer confirms payment.\n\n(rephrase to point to the fact of price, shipping, etc differentiation)\n\n\n\n\n\n[Benefit][co][cp]\n\nCheckout process includes a clearly visible and functional field for entering voucher/discount codes. System validates codes against the specific OTP product, customer eligibility, and campaign rules.\n\nPriority: P1, All\n\n(Make it more detailed.)\n\n\n\n\n\n[Checkout]\n\nSystem allows a user (guest or via a streamlined account creation) to browse OTP-eligible products, view detailed product information, add to cart, and complete a one-off purchase. A clear distinction must be maintained between OTP and subscription pathways.\n\n\n\n\n\n[Checkout]\n\nSystem allows logged-in users with paused subscriptions to access an OTP purchasing section/flow, select items, and checkout without triggering full subscription reactivation. Order confirmation and delivery are specific to this OTP order.\n\n\n\n\n\n[Checkout]\n\nSystem allows active subscribers to place an OTP order as a distinct transaction. The OTP order should have its own delivery scheduling options (if different from the regular subscription) and payment process. It should not interfere with their regular subscription unless an explicit choice is made by the user to combine or replace (future feature).\n\n\n\n\n\n[OTP meal choice]\n\n\n\n\n\n[Delivery dates, cutoffs, etc]\n\n\n\n\n\n[Order Confirmation[cq] & Tracking[cr]]\n\nSystem sends an automated order confirmation email with full OTP order details (itemizing separately shipped items if applicable) and estimated delivery window(s). Subsequent notification(s) provide tracking information once item(s) ship. Logged-in users can view OTP order status and history.\n\n(Mention that the email(s) are specific to the flow. Extract “Delivery Tracking” as a separate requirement?)\n\n\n\n\n\n[Conversion to Subscription][cs][ct]\n\nSystem allows a subscription order to be created alongside the OTP order. The subscription order will have its own cut-off, delivery date, menu and invoice. It should not impact the current OTP order, \n\n(And what are the details?)\n\n\n\n\n\n[Internal Operations, Logistics, & Finance teams]\n\nBackend systems ensure data from all OTP orders (including those fulfilled by third-party marketplace vendors or other HF brands like Factor) [cu]is sent to Katana and processed.\n\n\n\n\n\n[Data & Analytics][cv][cw]\n\nBackend and Frontend data for OTP orders are captured and categorized correctly on HF tables, and included on major Tableau dashboards with filters. OTP orders must be identifiable among orders.\n\n\n\n\n\n[OTP management in Bob]\n\n\n\n\n\n[Other?][cx]\n\n…\n\n\n\n\n\n2.2 Milestone 2 (Seasonal Boxes, October 2025)\n\n\n\n\n\n[Plan Differentiation][cy]\n\nSystem clearly presents available pre-set seasonal box sizes and main variants on the product page. Selection should be straightforward and update pricing dynamically. P0 requirement to customize portion size for seasonal box.\n\n\n\n\n\n[OTP Entry points for customers - Web, App]\n\n\n\n\n\n[Browse OTP as a prospect - Web, App]\n\n\n\n\n\n[Browse OTP as a customer - Web, App]\n\n\n\n\n\n[Login and SignUp adjustments - Web, App]\n\n\n\n\n\n[Checkout as a prospect - Web, App]\n\n\n\n\n\n[Checkout as a customer - Web, App]\n\n\n\n\n\n[OTP meal choice - Web, App]\n\n\n\n\n\n[Delivery tracking - Web, App]\n\n\n\n\n\n[Validation by DC (zipcode)]\n\n\n\n\n\n2.3 Milestone 1 (VMS, December 2025)\n\n\n\n\n\n[OTP Entry points for customers - Web, App]\n\n\n\n\n\n[Browse OTP as a prospect - Web, App]\n\n\n\n\n\n[Browse OTP as a customer - Web, App]\n\n\n\n\n\n[Checkout as a prospect - Web, App]\n\n\n\n\n\n[Checkout as a customer - Web, App]\n\n\n\n\n\n[Delivery tracking - Web, App]\n\n\n\n\n\n[OTP meal choice - Web, App]\n\n\n\n\n\n[Subscription + OTP fused checkout]\n\n\n\n\n\n[Multi-product cart and subscription]\n\n\n\n\n\n[SKU amount limits]\n\n\n\n\n\n[Singular delivery for simultaneous OTP+subscription orders]\n\n\n\n\n\n3. P1-3 requirements\n\n\n\n\n\n[Delivery]\n\nSystem presents available delivery dates/windows specific to the OTP product during checkout. This is crucial for time-sensitive seasonal items.\n\nPriority: P1, Both (esp. Seasonal)\n\n(breakdown by use-case)\n\n\n\n\n\n[Cancellation]\n\nSystem provides a self-service option for customers to manage their OTP orders up to the defined OTP cut-off time for that specific product/campaign.\n\nPriority: P1, All\n\n\n\n\n\n[Repurchase]\n\nFor logged-in customers, the system provides a clear order history that includes OTP purchases. An option to \"reorder\" or \"buy again\" for a previous OTP product should be available if that product is currently available for OTP.\n\nPriority: P1, All\n\n\n\n\n\n[Checkout as a customer - App, Web (x3) - reuse checkout details]\n\n\n\n\n\n[Gifting]\n\nSystem allows the customer to specify a different shipping address from their billing address during OTP checkout. A simple \"this is a gift\" checkbox could hide pricing on the packing slip.\n\nPriority: P2, All\n\n(Is it really a P1?)\n\n\n\n\n\n[Gifting]\n\nDuring the OTP gifting flow, after specifying the recipient's address, the system provides an option to type a short personalized message. This message would be printed on the packing slip or a separate small card.\n\nPriority: P3, All\n\n\n\n\n\n[Guest Checkout][cz]\n\nSystem offers a guest checkout path for OTP orders, collecting only essential information required to process and fulfill the order. Option to create an account post-purchase should be available.\n\nPriority: P3, All\n\n\n\n\n\n3. Priorities for User Stories\n\nPriorities are assigned above within the user story table (P0 - P4).\n\n   * P0 - Must Have: Core functionalities essential for launching a basic, viable, and legally compliant OTP service across all initial use cases. Includes fundamental purchase flows, clear pricing, order fulfillment integration (including basic drop-ship and cross-brand logic), and handling of different customer states.\n\n   * P1 - High Priority: Features that significantly enhance the customer experience, operational viability, or initial commercial success. Includes guest checkout, basic customization/gifting, self-service order management, and core functionality for marketplace discovery and Factor OTP purchase.\n\n   * P2 - Medium Priority: Important features for expanding customization, improving discoverability, providing better marketing/merchandising tools, and enabling core vendor/cross-brand operational capabilities.\n\n   * P3 - Low Priority: Valuable additions for customer convenience, repeat OTP business, enhanced gifting, and more robust marketplace/cross-sell support.\n\n   * P4 - Nice to Have: Complex features offering incremental benefits but are not critical for the core OTP value proposition and require significant cross-functional effort.\n\n\n\n\n\n________________\n\n\n\n\n\nOLD STUFF BELOW\n\n________________\n\n\n\n\n\n\n\n\n\n\n\n\n\nID\n\n\tPriority\n\n\tAs a...\n\n\tI want to...\n\n\tSo that I can...\n\n\tUse Case Applicability\n\n\tDescription (System Reaction)\n\n\tDependencies\n\n\tI. Core Purchase & Checkout Experience (P0 - Must Have)\n\n\tUS-OTP-C-P0-001\n\n\tP0\n\n\tCustomer browsing OTP products\n\n\t[Browse] View detailed and accurate information about the OTP product, including contents, quantity, portion sizes/weights, ingredients, allergens, and relevant quality indicators.\n\n\tMake an informed decision about the products I am purchasing and ensure they meet my expectations and dietary needs.\n\n\tAll\n\n\tProduct detail pages for OTP items must clearly list all contents. Seasonal Boxes: set menus, sizes. Good Chop: cuts, sourcing, weights. Marketplace items: brand, ingredients, allergens, nutritional info. Factor meals: ingredients, nutritional info, heating instructions, dietary tags (Keto, Calorie-Smart).\n\n\t\n\n\n\n\tUS-OTP-C-P0-002\n\n\tP0\n\n\tCustomer purchasing any OTP product\n\n\t[Pricing] See clear, transparent, and finalpricing for OTP items, including all taxes, shipping fees (if applicable), and the total cost, before I commit to payment.\n\n\tUnderstand the full cost upfront and make an informed purchase decision without surprises at the final checkout step.\n\n\tAll\n\n\tSystem clearly displays the price of OTP items on product pages and in the cart. The final checkout page shows an itemized breakdown of all product costs, specific OTP shipping fees (which might differ from subscription shipping, and may vary for marketplace items), and all applicable taxes before the customer confirms payment.\n\n\tConsumer Core\n\n\tUS-OTP-C-P0-003\n\n\tP0\n\n\tPotential new customer interested in a HelloFresh Group brand/offering\n\n\t[Checkout] Purchase a specific product (e.g., seasonal box, Good Chop box, marketplace item, Factor meal) as a one-time order without a recurring subscription.\n\n\tTry the brand's/product's quality and service for a specific occasion or need before committing to a plan, or simply buy what I need one-off.\n\n\tAll\n\n\tSystem allows a user (guest or via a streamlined account creation) to browse OTP-eligible products, view detailed product information, add to cart, and complete a one-off purchase. A clear distinction must be maintained between OTP and subscription pathways.\n\n\tConsumer Core\n\n\tUS-OTP-C-P0-004\n\n\tP0\n\n\tCustomer with a paused subscription on a HelloFresh Group brand\n\n\t[Checkout] Purchase an OTP-eligible product (seasonal box, Good Chop, marketplace item, Factor meal) without reactivating my full subscription.\n\n\tGet products for a specific need without restarting my regular deliveries.\n\n\tAll\n\n\tSystem allows logged-in users with paused subscriptions to access an OTP purchasing section/flow, select items, and checkout without triggering full subscription reactivation. Order confirmation and delivery are specific to this OTP order.\n\n\tConsumer Core\n\n\tUS-OTP-C-P0-005\n\n\tP0\n\n\tActive subscriber on a HelloFresh Group brand\n\n\t[Checkout] Order an additional OTP product (seasonal box, Good Chop, marketplace item, Factor meal) as a one-time purchase, distinct from my regular subscription.\n\n\tSupplement my regular order, get items for a special occasion, try new offerings, or add convenience items without altering my existing subscription plan.\n\n\tAll\n\n\tSystem allows active subscribers to place an OTP order as a distinct transaction. The OTP order should have its own delivery scheduling options (if different from the regular subscription) and payment process. It should not interfere with their regular subscription unless an explicit choice is made by the user to combine or replace (future feature).\n\n\tConsumer Core\n\n\tUS-OTP-C-P0-006\n\n\tP0\n\n\tCustomer purchasing a Seasonal Box\n\n\t[Plan Differentiation] Easily select different pre-defined sizes or variants of the Seasonal Box.\n\n\tChoose the seasonal offering that best fits my gathering size and core preferences for the event.\n\n\tSeasonal Boxes\n\n\tSystem clearly presents available pre-set seasonal box sizes and main variants on the product page. Selection should be straightforward and update pricing dynamically. P0 requirement to customize portion size for seasonal box.\n\n\t\n\n\n\n\tUS-OTP-C-P0-007\n\n\tP0\n\n\tCustomer who has completed an OTP order\n\n\t[Order Confirmation & Tracking] Receive a clear order confirmation and be able to easily track my OTP order's status through to delivery, even if items ship separately.\n\n\tBe assured that my order is processed correctly and know when to expect my delivery, especially for time-sensitive or perishable goods, or items from different vendors.\n\n\tAll\n\n\tSystem sends an automated order confirmation email with full OTP order details (itemizing separately shipped items if applicable) and estimated delivery window(s). Subsequent notification(s) provide tracking information once item(s) ship. Logged-in users can view OTP order status and history.\n\n\tConsumer Core (Delivery Planning)\n\n\tUS-OTP-C-P0-008\n\n\tP0\n\n\tCustomer who has completed an OTP order\n\n\t[Conversion to Subscription] Easily purchase a subscription during/ after the OTP order processing\n\n\tI gain the full benefit of a subscription order after I’m convinced with the service\n\n\tAll\n\n\tSystem allows a subscription order to be created alongside the OTP order. The subscription order will have its own cut-off, delivery date, menu and invoice. It should not impact the current OTP order, \n\n\tNVS, Consumer Core, Payments, Cross-selling\n\n\tII. Operational & Backend Integration (P0 - Must Have)\n\n\tUS-OTP-C-P0-009\n\n\tP0\n\n\tInternal Operations, Logistics, & Finance teams\n\n\tHave all OTP orders (incl. from marketplace vendors & cross-sold brands) integrated into relevant backend HF systems for order processing, fulfillment, and reporting.\n\n\tEfficiently manage inventory (where applicable), order routing, customer service, and financial reporting for all OTP products without extensive manual workarounds.\n\n\tAll\n\n\tBackend systems ensure data from all OTP orders (including those fulfilled by third-party marketplace vendors or other HF brands like Factor) is sent to Katana and processed.\n\n\tSCM\n\n\tUS-OTP-C-P0-0010\n\n\tP0\n\n\tData & Analytics\n\n\tHave all OTP orders captured correctly on data tables and analytics dashboard, including a differentiation between OTP vs subscription orders\n\n\tGet insights and monitoring for OTP orders correctly and easily without relying too much to Product Analytics\n\n\tAll\n\n\tBackend and Frontend data for OTP orders are captured and categorized correctly on HF tables, and included on major Tableau dashboards with filters. OTP orders must be identifiable among orders.\n\n\t\n\n\n\n\tIII. Enhanced Flexibility for OTP (P1 - High Priority)\n\n\tUS-OTP-C-P1-001\n\n\tP1\n\n\tNew or non-subscribed customer\n\n\t[Guest Checkout]Purchase an OTP product using a guest checkout process if I prefer.\n\n[da]\t\n\nMake a quick one-time purchase without the friction of mandatory full account creation.\n\n\tAll\n\n\tSystem offers a guest checkout path for OTP orders, collecting only essential information required to process and fulfill the order. Option to create an account post-purchase should be available.\n\n\t\n\n\n\n\tUS-OTP-C-P1-002\n\n\tP1\n\n\tCustomer purchasing an OTP product\n\n\t[Menu Differentiation] Have the option to customize recipes of the OTP product (if offered) or add optional items.\n\n\tTailor the OTP product more closely to my specific preferences or needs.\n\n\tSeasonal Boxes, Good Chop, Cross-Sell Factor\n\n\tSystem provides clear options for available customizations (e.g., dessert choice for seasonal box, specific cuts in a Good Chop bundle, meal selection for Factor OTP) or add-ons. Selections update configuration and price transparently.\n\n\t\n\n\n\n\tUS-OTP-C-P1-003\n\n\tP1\n\n\tCustomer purchasing an OTP product, especially a Seasonal Box\n\n\t[Delivery] Choose a specific delivery date for my OTP product from available dates relevant to that product.\n\n\tEnsure the product arrives conveniently for my event schedule.\n\n\tBoth (esp. Seasonal)\n\n\tSystem presents available delivery dates/windows specific to the OTP product during checkout. This is crucial for time-sensitive seasonal items.\n\n\t\n\n\n\n\tUS-OTP-C-P1-004\n\n\tP1\n\n\tCustomer who has placed an OTP order\n\n\t[Cancellation] Be able to cancel my OTP order online (or modify limited aspects) before a clearly communicated cut-off time.\n\n\tHave some flexibility if my plans change shortly after placing the order.\n\n\tAll\n\n\tSystem provides a self-service option for customers to manage their OTP orders up to the defined OTP cut-off time for that specific product/campaign.\n\n\t\n\n\n\n\tUS-OTP-C-P1-005\n\n\tP1\n\n\tCustomer with a valid promotional voucher or discount code\n\n\t[Benefit] Easily and successfully apply it to my OTP order during checkout.\n\n\tTake advantage of special offers or targeted discounts I am eligible for on OTP purchases.\n\n\tAll\n\n\tCheckout process includes a clearly visible and functional field for entering voucher/discount codes. System validates codes against the specific OTP product, customer eligibility, and campaign rules.\n\n\tCustomer Benefits\n\n\tUS-OTP-C-P1-006\n\n\tP1\n\n\tCustomer wanting to purchase an OTP product as a gift\n\n\t[Gifting] Easily purchase an OTP product and have it shipped directly to a different recipient, with an option to indicate it's a gift.\n\n\tSend a product as a present for a special occasion or as a thoughtful gesture.\n\n\tAll\n\n\tSystem allows the customer to specify a different shipping address from their billing address during OTP checkout. A simple \"this is a gift\" checkbox could hide pricing on the packing slip.\n\n\t\n\n\n\n\tIV. Marketplace & Cross-Sell Specifics (P1 - High Priority)\n\n\tUS-OTP-MKT-P1-001\n\n\tP1\n\n\tCustomer browsing the HelloFresh brand website/app\n\n\tEasily discover and browse items available for one-time purchase from third-party brands in a dedicated marketplace section.\n\n\tFind and purchase a wider variety of food items (snacks, pantry staples, specialty goods) beyond the brand's core meal kits.\n\n\t2-Way Marketplace\n\n\tSystem provides a clearly identifiable \"Marketplace\" or \"Shop\" section. Products are categorized, searchable, and filterable. Vendor information is displayed.\n\n\t\n\n\n\n\tUS-OTP-MKT-P1-002\n\n\tP1\n\n\tCustomer purchasing a 2-Way Marketplace item\n\n\tUnderstand that marketplace items are sold by third-party vendors and may ship separately with different delivery times/costs than my regular brand box.\n\n\tManage my expectations regarding fulfillment and delivery for items not directly from the primary brand.\n\n\t2-Way Marketplace\n\n\tProduct pages and checkout clearly indicate if an item is from a marketplace vendor, estimated shipping times, and if separate shipping fees apply. Order confirmation details separate shipments.\n\n\t\n\n\n\n\tUS-OTP-XSELL-P1-001\n\n\tP1\n\n\tHelloFresh US customer\n\n\tEasily discover and purchase Factor Ready-to-Eat (RTE) meals as a one-time order through the HelloFresh platform.\n\n\tTry Factor meals for convenience or specific dietary needs without committing to a separate Factor subscription.\n\n\tCross-Sell Factor\n\n\tHelloFresh platform (website/app) features Factor meals in a discoverable way (e.g., dedicated section, integrated into menu browsing). Customers can select Factor meals and add them to an OTP cart.\n\n\t\n\n\n\n\tUS-OTP-XSELL-P1-002\n\n\tP1\n\n\tHelloFresh US customer purchasing Factor meals via OTP\n\n\tSee clear product information for Factor meals, including ingredients, nutritional details, heating instructions, and dietary suitability (Keto, Vegan, etc.).\n\n\tMake informed choices about Factor meals that fit my dietary preferences and health goals.\n\n\tCross-Sell Factor\n\n\tFactor meal product pages within the HelloFresh experience display all necessary details, mirroring the information available on the native Factor platform.\n\n\t\n\n\n\n\tV. Advanced Customization for OTP (P2 - Medium Priority)\n\n\tUS-OTP-C-P2-002\n\n\tP2\n\n\tCustomer browsing OTP products\n\n\tSee clear, real-time availability of OTP items and be informed if an item is sold out, with (optional) information on potential restocking.\n\n\tAvoid frustration by not attempting to order an unavailable item and to manage my expectations regarding availability.\n\n\tAll\n\n\tProduct detail pages clearly display stock status. If an OTP item is sold out, this is prominently displayed. Optional: feature to register interest for restock notifications.\n\n\t\n\n\n\n\tUS-OTP-MKT-P2-001\n\n\tP2\n\n\tThird-party CPG brand/supplier\n\n\tEasily onboard my products onto the HelloFresh 2-Way Marketplace, providing necessary product information, inventory levels, and fulfillment capabilities.\n\n\tReach a new, high-value customer base and test a D2C model with minimal infrastructure investment.\n\n\t2-Way Marketplace\n\n\tSystem (or supporting processes) provides a clear onboarding path for approved vendors, including tools or APIs for product catalog submission, inventory synchronization (or manual updates), and order management integration for drop-shipping.\n\n\t\n\n\n\n\tUS-OTP-XSELL-P2-001\n\n\tP2\n\n\tHelloFresh US customer\n\n\t[Cross-selling] Have the option to add Factor meals to my existing HelloFresh subscription on a recurring basis, in addition to or instead of OTP.\n\n\tSeamlessly integrate regular RTE meal delivery into my weekly HelloFresh plan for ongoing convenience.\n\n\tCross-Sell Factor\n\n\tSystem allows customers to opt-into a recurring delivery of a set number of Factor meals alongside their HelloFresh subscription. This includes managing Factor meal selections weekly and pausing/cancelling the Factor add-on independently of the core HF subscription.\n\n\t\n\n\n\n\tVI. Future Enhancements (P3 - Low Priority)\n\n\tUS-OTP-C-P3-001\n\n\tP3\n\n\tLogged-in customer who previously made an OTP purchase\n\n\t[Repurchase] Easily reorder a past OTP product or a similar selection from my order history.\n\n\tQuickly repurchase items I enjoyed without extensive re-browsing.\n\n\tAll\n\n\tFor logged-in customers, the system provides a clear order history that includes OTP purchases. An option to \"reorder\" or \"buy again\" for a previous OTP product should be available if that product is currently available for OTP.\n\n\t\n\n\n\n\tUS-OTP-C-P3-002\n\n\tP3\n\n\tCustomer purchasing an OTP product as a gift\n\n\t[Gifting] Add a personalized gift message to be included with the OTP gift order.\n\n\tMake the gift more personal and special for the recipient.\n\n\tAll\n\n\tDuring the OTP gifting flow, after specifying the recipient's address, the system provides an option to type a short personalized message. This message would be printed on the packing slip or a separate small card.\n\n\t\n\n\n\n\tUS-OTP-MKT-P3-001\n\n\tP3\n\n\tCustomer who purchased a 2-Way Marketplace item\n\n\t[CC] Contact customer service for issues related to my marketplace order (e.g., delivery, product quality) and receive effective support.\n\n\tResolve any problems with my marketplace purchase efficiently, even if the item came from a third-party vendor.\n\n\t2-Way Marketplace\n\n\tCustomer service channels are equipped to handle inquiries related to marketplace orders. Clear processes exist for escalating issues to vendors if necessary, while maintaining a HelloFresh-branded support experience for the customer.\n\n\t\n\n\n\n\tUS-OTP-C-P4-001\n\n\tP3\n\n\tActive subscriber who is also placing an OTP order for the same brand\n\n\t[1 Box Delivery] Have an option to add my OTP items to my next scheduled subscription delivery, if logistically feasible and desired for convenience.\n\n\tConsolidate my deliveries from the same brand and potentially save on separate OTP shipping costs if applicable.\n\n\tGood Chop, Cross-Sell Factor (potentially)\n\n\tDuring OTP checkout, if the customer is an active subscriber with an upcoming delivery from the same brand, the system could present an optional feature to align/combine the OTP delivery with their next subscription box. This is highly dependent on operational feasibility and product types.\n\n\t\n\n\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[a]@nathaniel.deo@hellofresh.com Using existing cart?\n\n[b]A secondary value of OTP is that the pricing (likely more expensive than subscription) creates an anchor effect, making the subscription look more attractive.\n\n\n\n\n\nSo even if OTP itself doesn't have a high uptake rate, we've seen it push subscription uptake as well.\n\n1 total reaction\n\nEdwin Torres reacted with 👍 at 2025-09-15 18:17 PM\n\n[c]Do we have any business cases for these numbers we can link here?\n\n[d]+ 1\n\nis this relevant for HF as well?\n\n[e]hey folks, the BCs are in the respective WBDs linked above.\n\n[f]CC: \n\n- How is the compensation work for Seasonal boxes?\n\n- How is the reporting process?\n\n[g]@stephen@hellofresh.com @jr.payopanin@helloconnect.org\n\n[h]Hi @nathaniel.deo@hellofresh.com not all these requirements are actually in the scope of MVP. Items like:\n\n- Benefits Application\n\n- Multiple Order Capability\n\n- Subscription Conversion Flow\n\n\n\n\n\nCan you please update this to avoid confusion? \n\n\n\n\n\ncc: @nikita.gorshkov@hellofresh.com\n\n_Assigned to nathaniel.deo@hellofresh.com_\n\n[i]Updated, the Subscription conversion we're still discussing if its possible to just handle from the front end with current end point that we have.\n\n[j]is the intention to still utilise the LC for OTP also?\n\n[k]@nathaniel.deo@hellofresh.com This would then be tracking in existing subscription account?\n\n_Assigned to nathaniel.deo@hellofresh.com_\n\n[l]Yes, but we're not planning this for Seasonal Boxes since we don't want to touch the HF main flow\n\n[m]@nathaniel.deo@hellofresh.com Check on loyalty\n\n[n]Can we also discuss the actual upload of the boxes to the site - will this be covered by Digital ops teams locally and will this be integrated into CCM or will this require a different tool?\n\n[o]The plan is to handle the all through CCM (separate SKU created). Unless you think there are things CCM cannot satisfy? @elyse.hill@hellofresh.co.nz\n\n[p]That's perfect, the team would prefer a single system to minimise work load so CCM is the ideal. Assuming MPS will also be updated to create these menu items or will CCM be enabled to load these addon's manually?\n\n[q]@nathaniel.deo@hellofresh.com just wanted to flag that the local editorial team has raised that with XPS we are currently unable to export the Christmas Recipes for the photo studio briefing as they are one time recipes so we will need to add a workaround of getting MP to upload the Christmas offering into MPS in a future week > Editorial will export the data for a brief > MP will need to delete the recipes from MPS again. For OTP can we add this as a feature to solve the manual workaround for the teams? \n\n(cc: @sally.nolan@hellofresh.com.au )\n\n[r]Is this a BAU capability or is this new for OTP in VMS?\n\n[s]@nathaniel.deo@hellofresh.com \n\n\n\n\n\nnot high prio but i think we should also cover how OTP <> loyalty would behave in the future. Should it count towards box count and loyalty programs?\n\n\n\n\n\nMy initial thought is yes\n\n_Assigned to nathaniel.deo@hellofresh.com_\n\n[t]do we expect user interaction here (reentering voucher for subscription)? let's specify.\n\n[u]@wellney.yarra@hellofresh.com help check, these are based on my assumptions\n\n[v]isn't this rather a byproduct of current limitations?\n\n\n\n\n\nin a future scenario where stakeholders can define different values for the same voucher depending on sub/OTP, would we still want customers to enter more than one voucher for the same purchase?\n\n[w]I'm thinking 1 voucher per order, so if customer has 1 OTP and 1 subs, which means they can apply two vouchers\n\n[x]if the customer checks out with OTP and sub in the same flow, same address, then the expected behavior would be one delivery fee only.\n\n\n\n\n\nwe're not consolidating it today because shipping fee is contained within SKU price. I don't think we should continue this, though. In a world where we have multiple SKUs per sub (WIP), then shipping fee should belong to the order, not the SKU\n\n[y]oops never mind, just saw the P1 requirement to address this below\n\n[z]- OTP charged real time after checkout\n\n- Subscription charged later after cut off\n\n[aa]Needs to be handled by the brand\n\n[ab]Separate invoice if charged separately\n\n[ac]IE is keen on following UK footsteps here afaik! I believe as soon as we have some (positive) results from the UK test.\n\n[ad]1 total reaction\n\nTheresa Stolberg reacted with 🎉 at 2025-11-20 11:57 AM\n\n[ae]Potentially deprio for Q1\n\n[af]Focus on HF for now\n\n[ag]Where can I read about the commercial & marketing strategy of OTP?\n\ne.g. which channels will we sell them?\n\nhow will we market it vs. current subscription strategy? \n\nwhat will be the pricing?\n\nwhat will be the benefit strategy?\n\n[ah]This indicates a difference in pricing between the 2 options- is the assumption that the subscription price is lower?\n\n[ai]@himash.tehan@hellofresh.com\n\n[aj]added a ticket to remove cadence from OTP selection https://hellofresh.atlassian.net/browse/GOC-3379\n\nIts not a blocker, more of a cleanup\n\n[ak]@himash.tehan@hellofresh.com check what delivery option to use\n\n[al]@himash.tehan@hellofresh.com\n\n[am]added a ticket to remove cadence from OTP selection https://hellofresh.atlassian.net/browse/GOC-3379\n\nIts not a blocker, more of a cleanup\n\n[an]FYI added this here @himash.tehan@hellofresh.com \n\n\n\n\n\nis this clear enough as an AC for the de-duplication part?\n\n_Assigned to himash.tehan@hellofresh.com_\n\n[ao]Yes it's clear enough.\n\n\n\n\n\nI think there's also a case if a customer decides to switch the plan type entirely in the same session. This would also need a patch to the same cartID.\n\n[ap]Descope from OTP, combine with C@C\n\n[aq]@himash.tehan@hellofresh.com help to check\n\n[ar]we already validated that for images (and cut names) to show up we will need to fetch public menu right? so dependency on this ticket: https://hellofresh.atlassian.net/browse/XSELL-419\n\n\n\n\n\nor is this another question?\n\n[as]@himash.tehan@hellofresh.com @bdim@hellofresh.com to create the tickets after design is finalized\n\n[at]@himash.tehan@hellofresh.com @bdim@hellofresh.com to revisit claudia's ticket\n\n[au]In this scenario will the customer be considered new or reactivation in the system?\n\n[av]just noting that in the future if there's an inactive account, the CTA should actually be more about Reactivating\n\n\n\n\n\nif subscription is still active, then entrypoint should simply be to view existing plan from the OTP dashboard\n\n\n\n\n\nI don't think this needs to be a blocker for release though\n\n[aw]Keep in mind that after we launch the experiment, we can't change the voucher codes and their configurations\n\n[ax]@marina.guthmann@hellofresh.com @bdim@hellofresh.com to be added later, not P0 for MVP\n\n[ay]Hi @nathaniel.deo@hellofresh.com just to confirm will regionality be a feature within OTP? The option to have region specific boxes (i.e. Perth/SA require fumigation which makes some SKUs unavailable to use in our boxes so we would need to set up a Perth regional box with different SKUs just for customers with postcodes specific to that area.) ?\n\n_Assigned to nathaniel.deo@hellofresh.com_\n\n[az]I haven't checked on SKU regionality. I'll get back to you on this\n\n1 total reaction\n\nElyse Hill reacted with 👍 at 2025-07-01 22:34 PM\n\n[ba]Thanks! (FYI @tiffany.zhu@hellofresh.com.au )\n\n[bb]@nathaniel.deo@hellofresh.com just double checking if this will support add-ons like 'cheese box'?\n\n_Assigned to nathaniel.deo@hellofresh.com_\n\n[bc]If \"add-on\" is creating another box (SKU) with an additional Cheese menu, then yes.\n\n\n\n\n\nThe system cannot support the add-on definition that we're used to in HF, meaning the item based pricing on top of the box itself.\n\n[bd]@nathaniel.deo@hellofresh.com \n\nDoes this mean a non-HF user has to sign up for a subscription (at least short term) in order to get the one-off? i.e. he'd have to actively pause the subscription, if he doenst want the normal box, while being a one-off customer?\n\n_Assigned to nathaniel.deo@hellofresh.com_\n\n[be]Hi Theresa, apologies for the late reply. The user need to have an account but not an active subscription. This is similar to how first time customers needs to fill in their email first\n\n[bf]This can be done via CCM\n\n[bg]Also, a question if we can remove it from the MVP.\n\n@nathaniel.deo@hellofresh.com\n\n[bh]@nathaniel.deo@hellofresh.com would you be in a position to confirm this means that OTP orders will flow through standard HF tools? (SPS-CPS-MPS, D4 forecasting, Inventory Planner, OPE, cut-off handled by Odin/ Katana to mention a few?)\n\n_Assigned to nathaniel.deo@hellofresh.com_\n\n[bi]I haven't confirmed with all of the teams involved yet. What is your expectations from ops stand point? Happy to have a quick call about this.\n\n1 total reaction\n\nTamas Szilagyi reacted with 👍 at 2025-06-23 03:52 AM\n\n[bj]@nathaniel.deo@hellofresh.com The expectation is 'out of box integration' i.e. zero development need from SCM tech to ingest OTP order data CC @michelle.mapleston@hellofresh.com.au @elyse.hill@hellofresh.co.nz\n\n[bk]@nathaniel.deo@hellofresh.com just to confirm DPC is added to the cope of tools Tamas mentioned above?\n\n[bl]@nathaniel.deo@hellofresh.com where can I get more visibility of this topic & the \"Dependency: SCM/Katana\" section of this doc?\n\n[bm]Hey @michelle.mapleston@hellofresh.com.au What kind of visibility do you need from the SCM/ Katana team? We have some technical documents but not sure if that's helpful. For a start, I can add you to our main channel and you can post your questions there? Or else we can find time to sync\n\n[bn]Should be an option to either opt to integrate or not integrate OTP orders into weekly supply chain. ie rather than sending separate label files and delivery manifest, we may want fulfilment ops to integrate within existing process. Route both OTP and regular deliveries at the same time, and produce together\n\n\n\n\n\nThis will not always be the case such as XMB which may want to be produced separately from regular orders, but other scenarios may exist where we want to produce with regular orders\n\n1 total reaction\n\nMichelle Mapleston reacted with ➕ at 2025-07-25 04:45 AM\n\n[bo]Are these timelines concrete for XMB ANZ? We start selling in October so are currently still scoping Shopify for selling this year to ensure we hit this deadline. Keen to hear with what confidence we can plan on having this proposed solution in time?\n\n[bp]@elyse.hill@hellofresh.co.nz we'll be discussing with the larger tech group next week to know the possibility of this timeline. I promise @tamas.szilagyi@hellofresh.com.au to have this clarity by W1 July. Does that work?\n\n[bq]That sounds great thanks, @nathaniel.deo@hellofresh.com!\n\n[br]check to tech for a \"seasonal box' site or separate site for different occasions\n\n[bs]how will you model add-ons?\n\n[bt]Something to check with Tamas tomorrow, if this is a blocker, then Oct might not be a suitable timeline\n\n[bu]@tamas.szilagyi@hellofresh.com.au modeling options and add-ons through different SKUs\n\n[bv]@tamas.szilagyi@hellofresh.com.au we also need to consider modularity options as per XMB 2025 set up and in line with the flexibility our main competitors offer (i.e. My Food Bag)\n\n[bw]This sounds like a regular \"subscription + one-time addon\" experience. Why would we want OTP for that?\n\n[bx]Better customer experience. VMS experience is more e-commerce like. There are 3 main products (greens, hydration, protein) that come in different formats and flavors. As a customer I expect to be able to choose what I want to try once vs. subscribe to. I want to find all my products in the same place instead of having to understand what is a subscription vs one time purchase vs add-on. I also want to be able to convert my OTP into a subscription later (yes we can do this with subscribable add-on too, but why make it more complex for the customer and introduce another flow?)\n\n\n\n\n\nFrom an internal POV we should also not add extra complexity for other teams to onboard another SKU, create add-on menus, call another menu, etc. if we don't have to.\n\n[by]What about the other way around? Are we expecting an ability to use existing benefits (through loyalty program) for the seasonal boxes?\n\n[bz]What does it actually mean? Can you drop an example?\n\n[ca]wondering the same - @nathaniel.deo@hellofresh.com what did you have in mind?\n\n[cb]@mabu@hellofresh.com lmk if this is clearer now @nathaniel.deo@hellofresh.com\n\n[cc]What's \"GST charge\"?\n\n[cd]Goods and Service Fee - NZ is set at 15% and is normally baked into products sold and AU is 10% but there are different rules to consider in order to remain compliant.\n\n[ce]Assuming this would be a separate payment for customers who may also be ordering a regular subscription box? Similarly to how we charge HFM currently?\n\n[cf]Payment details are never stored in the HF system, hence, it is not possible to prefill payment details. What we can try doing is \"use existing payment\" which would be a reference to a payment token.\n\n[cg]What do we mean by this?\n\n[ch]@nathaniel.deo@hellofresh.com i assume you mean all the payment methods?\n\n[ci]Does it mean that the data of OTP should be a part of analytics and should be identifiable as OTP?\n\n[cj]essential to note that customers who have already purchased a seasonal box to be excluded from future CRM emails (i.e. if someone bought a Christmas box at full price, should not get a Black Friday discount email)\n\n[ck]check if this breaks given there are not recipes essentially.\n\n[cl]How will errors and NPS be measured?\n\n[cm]check for Taxes\n\n[cn]ask Daniel\n\n[co]Check with Benefits if they need subscription ID\n\n[cp]@mabu@hellofresh.com\n\n[cq]Check on Invoice\n\n[cr]@mabu@hellofresh.com to check\n\n[cs]Check if account, delivery and payment information can be prefilled\n\n[ct]Ask Leo\n\n[cu]I think we can simplify this to just talk about Katana\n\n[cv]Split between FE data and BE data\n\n[cw]@mabu@hellofresh.com to help check\n\n[cx]Forecasting? Or will we rely on business case assumptions to plan volumes. Concern here is waste and ordering accuracy.\n\n[cy]Will we have individual landing pages per seasonal offering or a page for \"gifting\" and a page for \"seasonal boxes\" which has all current boxes. (ref point https://www.myfoodbag.co.nz/shop/)\n\n[cz]what's the difference between a guest checkout and a normal checkout?\n\n[da]what's the difference between a guest checkout and a normal checkout?",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-01.md",
      "source_date": "2025-12-05",
      "doc_type": "prd",
      "matched_topics": [
        "good chop",
        "goodchop",
        "goc",
        "factor form",
        "vms",
        "market integration",
        "cross-selling",
        "otp",
        "one time purchase",
        "one-time purchase",
        "seasonal boxes",
        "seasonal box"
      ],
      "matched_people": [
        "jama",
        "deo",
        "yarra",
        "sameer",
        "ahmed",
        "daniel",
        "nikita"
      ],
      "filter_score": 19
    }
  ],
  "doc_count": 1,
  "total_chars": 130960
}