{
  "batch_id": "prd_016",
  "doc_type": "prd",
  "documents": [
    {
      "title": "Scope Proposal: External Engineering Augmentation for The Pets Table (TPT)",
      "doc_id": "1UiptyNxTPvqBvDKavC9B0v8brSHhr0FiSVvxr6xr5x4",
      "link": "https://docs.google.com/document/d/1UiptyNxTPvqBvDKavC9B0v8brSHhr0FiSVvxr6xr5x4/edit?usp=drivesdk",
      "content": "﻿Scope\n\nScope Proposal: External Engineering Augmentation for The Pets Table (TPT)\n\n\n\n\n\nProposed Scope of Work & Deliverables\n\nThe augmented engineering team's scope of work will encompass the following approved initiatives. All deliverables are expected to be delivered for Web and Mobile Web, fully tested, integrated into our existing tech stack, and accompanied by necessary documentation.\n\nNew copy and assets should be editable through new contentful entries.\n\nPriority\n\n\tHigh level designs \n\n(subject to adjustments)\n\n\tInitiative\n\n\tCustomer problem & goal\n\n\tRequirements\n\n\tIs design ready for development?\n\n\tGridDynamics Briefed?\n\n\t1\n\n\t  \n\n\n\nMultipet version (for users that have 2 or more dogs)  \n\n\n\n\n\n\tCheckout Confirmation Page \n\n[a]\t\n\nPost conversion, as a newly converted TPT user, I land on the “dashboard” page. Users face multiple problems: \n\n* They are struggling to understand that they converted\n\n* They are finding it hard to discover and interact with features that are available to them post-checkout. \n\n\n\n\n\nGoal: create a page that is shown after conversion, showing an order summary and a CTA to take on one of the recommended actions: Explore the  add-on store or add another pup (depending on the version. Ie: if a user mentioned they have multiple pets in checkout show the CTA to add another pup and if they didn’t, show addons store CTA)\n\n\n\n\n\n(Expected Impact: Increase take rate of Add-ons and Increased Retention, Increase Multipet penetration)\n\n\n\n\n\n\t* 2 versions of the checkout page are created (multipet, addons)\n\n* The order summary is shown as per the Checkout page \n\n* The user is shown the right version based on their pet profile data (number of pets) \n\n* This initiative is more than just this page UI. There's some logic involved on how this page is loaded, which differs from our current live state, as we want to remove the “frying pan” animation[b] - currently in prod (it gives the impression that the user needs to cook the food). The right flow is laid out on Figma.\n\n\t✅ Yes.\n\n\n\n\n\nAccess Figma.\n\n\n\n\n\nAccess Prototype to see the animation in this flow.\n\n\t✅ Yes (Jun 27, 2025)\n\n\t2\n\n\tCurrent component:  \n\n\n\n\n\nGoal: \n\n  \n\n\n\n\tDashboard improvements - Milestone 1: \n\nQuick Actions on Dashboard (Above Fold Repositioning)\n\n\tActive users are not aware of the options available to them to adjust their subscription, active users are struggling to navigate to features that they need to solve their problems. \n\n\n\n\n\nWe want to replace the current quick actions with a scalable component for subscription management, where users will be able to find the features they need on the dashboard.\n\n\n\n\n\n(Expected Impact: Increased user engagement with core functionalities, leading to mitigating the need of churning and improved retention, as well as reduction of empty reactivations)\n\n\t* Existing quick actions (currently placed on the bottom of the page) are redesigned to be placed above the fold as an accordion[c][d][e]\n\n* Solution is scalable and can be extended by new features in the future[f][g][h]\n\n* The header is formatted to the new design (UI changes only)\n\n* View order total button on mobile is changed to an icon\n\n* CTAs are reworked as per design - we show 2 CTAs below the meals change meals and feeding guide.\n\n\n\n\n\n\t✅ Yes. Design is ready to be implemented.\n\n\n\n\n\nAccess Figma.\n\n\t✅ Yes (Jun 27, 2025)\n\n\t3\n\n\t  \n\n\n\n\tDashboard improvements - Milestone 2: Reduced Size of Meals on Dashboard\n\n\tWhile the weekly menu is static, the presentation of meals takes a significant amount of TRE. \n\n\n\n\n\nWe want to optimize the display of meal information on the cust\n\n\n\n Fresh - 750, Dry - 750, Mixed - 750\n\n   * 50% portions: Fresh - 500, Dry - 500, Mixed - 500\n\n   * Important note: Not all calorie ranges will have a 50% or 75% option available, for smaller dogs this might not be available\n\n   * < 89 calories\n\n   * Between 89-149 - offer only 100% plan for dry and fresh \n\n   * This is handled by the NMPS API\n\n   * Between 150-225 - offer 100% and 75% plan for dry and fresh\n\n   * 226+ - offer mixed plan + 50% 75% and 100% percentages for dry and fresh\n\n   * This has to be implemented in the FE because the API returns mixed plan for 50/75% portions\n\n\n\n\n\nSwitching the user’s portion percentage requires 2 API calls:\n\n   * Patch the user’s subscription to update their plan - This is what’s actually responsible for changing the amount of food user’s get\n\n   * Patch the pet profile to update the `portionPercentage` field - This field doesn’t have any direct impact on the user’s plan size, but it’s used to be able to identify these users as well as communicate to them what portion they’re feeding. \n\n   * This is necessary because the plan alone isn’t enough since the same plan could be a 100% portion for another dog (E.g. Fresh 500 calories could be a 50% portion for a big dog but 100% portion for a small dog)\n\n\n\n\n\nImportant components:\n\n   * Portion % hook\n\n   * Portion % badge\n\n   * Quiz Steps\n\n   * Quiz Allergens experiment setup - This is an old experiment that had the same setup as we want for this, we should repurpose this for the new experiment\n\n[a]+ tracking\n\n[b]This loading state is waiting for async updates in the background. There is an ongoing initiative to replace this for pre-checkout service but not ready yet\n\n[c]@maria.chelminska@hellofresh.com I'm also noticing that there are changes to the CTAs under the header (Manage Delivery and Change Meals) are these included in this initiative?\n\n\n\n\n\nEspecially manage delivery because this functionality is covered by the Quick actions\n\n_Assigned to maria.chelminska@hellofresh.com_\n\n[d]Yes, you are correct, forgot to mention this\n\n[e]added\n\n[f]@maria.chelminska@hellofresh.com are we expecting anything specific here?\n\n_Assigned to maria.chelminska@hellofresh.com_\n\n[g]The component should be expandable - i.e. we can add more cards to the carousel. Should come out of the box, but I wanted to specify it.\n\n[h]got it\n\n[i]tracking\n\n[j]tracking + analysis\n\n[k]tracking\n\n[l]+ pre / post",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-17-.md",
      "source_date": "2025-12-17",
      "doc_type": "prd",
      "matched_topics": [
        "the pets table",
        "pets table",
        "tpt"
      ],
      "matched_people": [
        "maria"
      ],
      "filter_score": 4
    },
    {
      "title": "Ian:Nikita 1:1 (2w) - 2025/12/19 17:01 CET - Notes by Gemini",
      "doc_id": "1nXVpzdNNQaP1BRebSbOcr211_HxX7NJqkMoam8CppoQ",
      "link": "https://docs.google.com/document/d/1nXVpzdNNQaP1BRebSbOcr211_HxX7NJqkMoam8CppoQ/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 19, 2025\n\nIan:Nikita 1:1 (2w)\n\nInvited Nikita Gorshkov Ian Brooks\n\nAttachments Ian:Nikita 1:1 (2w) \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nNikita Gorshkov provided Samir and Allison with praise for the successful launch of the US factor form Shopify B2B store and discussed the technical requirements with Ian Brooks for replicating this store for a Canadian factor, including URL configuration and core infrastructure needs. They decided that the Canadian pilot should use static content and minimal initial integrations, estimating that the necessary work, including URL setup, some infrastructure, and basic tracking, would require one product resource and one engineering resource for about two weeks. Nikita Gorshkov suggested a B2B proof of concept with minimal integrations could cost less than $100k (USD) as a one-time charge from Anata, in addition to the $24,000 USD annual Shopify enterprise license fee, which Ian Brooks noted would significantly increase the pilot cost.\n\n\n\n\n\nDetails\n\n* B2B Shopify Store Launch and Technical Requirements Nikita Gorshkov mentioned the recent launch of the factor form Shopify B2B store, which was completed by Samir and Allison yesterday, giving them \"huge kudos\". Ian Brooks sought clarification on the technical requirements for setting up the B2B store for a factor in Canada, to which Nikita Gorshkov specified the need for technical support regarding URL configuration and core infrastructure (00:00:00). They also noted that if they replicate the US store setup, they would require a team to support catalog management, suggesting options for either weekly menu uploads or a technical resource to ensure integration between catalog and menu management systems (00:01:14).\n\n* Menu Management and Catalog Upload Efficiency Nikita Gorshkov and Ian Brooks discussed the effort required for menu uploads, with Nikita Gorshkov explaining that while text and images are relatively easy, nutritional information entry takes time, which is why automations were previously developed. They attempted to offshore this to Hello Connect two years ago, but the quality was poor, which surprised Ian Brooks, as Hello Connect handles a significant portion of their meal kit menu (00:02:28). Nikita Gorshkov argued that it would be more efficient to upload the entire catalog once and then manage which items are enabled weekly, which Ian Brooks considered \"super easy\" and achievable in a sprint (00:03:42).\n\n* Proposed Setup and Resource Requirements for Canadian B2B Store Discussing the setup for the Canadian pilot, Nikita Gorshkov agreed with Ian Brooks that they should not build complex integrations initially and suggested having static content with certain items visible or invisible. From a technical perspective, the required work includes setting up URLs, some infrastructure work, and tracking, noting that basic tracking is provided by Shopify, but connecting to any CRM would require CRM connectors (00:04:39). Nikita Gorshkov estimated that establishing the store, even with less automation and tracking than the original setup, would require one product resource and one engineering resource for about two weeks, assuming they can secure the engineering resource (00:05:41).\n\n* Cost Estimates and Operational Structure for Shopify Stores Nikita Gorshkov provided cost estimates for similar Shopify projects, noting that while VMS cost $400k (USD), they managed to get the good shop marketplace to $175k (USD) and suggested the B2B proof of concept, with minimal integrations and no subscription module, could be less than $100k \n\n\n\nt for either. I think both of them could provide a relatively good indication of where this product could be going.\n\nIan Brooks: Yeah.\n\nNikita Gorshkov: It's just um yeah, that's pretty much it. We can make the discussion in terms of what where are the pros and cons and maybe by when we have the dates when we're we have that meeting, I'll just prepare in terms of like here's the uh decision tree and here's how we get to the end state where we have both and these are the pros and cons and let's just hash it out there.\n\nIan Brooks: Yeah,\n\nNikita Gorshkov: Cool.\n\nIan Brooks: I'm good with that.\n\nNikita Gorshkov: Cool. Nice.\n\nIan Brooks: How can I help you, Nikita?\n\nNikita Gorshkov: Uh I'm good actually. Uh I'm excited that uh I have while I'm uh working next week, I have high hopes that uh there will be like two and a half uh poor sads across HelloFresh who are still going to be in the office.\n\n \n\n \n\n00:15:54\n\n \n\nNikita Gorshkov: So my email volume will go down. Uh this this week has been fun.\n\nIan Brooks: Yes,\n\nNikita Gorshkov: with everybody trying to cram everything into the last\n\nIan Brooks: I I find the same.\n\nNikita Gorshkov: week.\n\nIan Brooks: I generally have no recurring meetings. I try to have no recurring meetings. although now I have one with you and I have another one and whatever on Fridays. Um, and I always measure how things are going by how busy my meeting slate is for Friday by the time\n\nNikita Gorshkov: H\n\nIan Brooks: I get to Friday. And uh, this one's okay because a bunch of people have already left, but like I was double booked for parts of Friday, which is that's never a good sign.\n\nNikita Gorshkov: Yeah, true,\n\nIan Brooks: But thank you very much and please thank your teams.\n\nNikita Gorshkov: true enough.\n\nIan Brooks: I really appreciate it.\n\nNikita Gorshkov: Happy happy to help. I mean, look, uh we're here to solve fun uh problems and and build cool things that we're all proud of. I I think that's the that's the main goal. So, thank you. Like, it's been honestly like this year and also last year when we started sort of our interaction,\n\nIan Brooks: Yeah.\n\nNikita Gorshkov: it was always a blast actually talking and working with you.\n\nIan Brooks: Yeah. Likewise, man.\n\n \n\n \n\nTranscription ended after 00:17:19\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-19-01.md",
      "source_date": "2025-12-19",
      "doc_type": "prd",
      "matched_topics": [
        "factor form",
        "vms"
      ],
      "matched_people": [
        "allison",
        "nikita"
      ],
      "filter_score": 4
    },
    {
      "title": "PRD: Beam Integration for The Pets Table",
      "doc_id": "1k1YJwp5u1n1dNuQJlkkbTM7TAZCoDUxQDqt7ZTTNH08",
      "link": "https://docs.google.com/document/d/1k1YJwp5u1n1dNuQJlkkbTM7TAZCoDUxQDqt7ZTTNH08/edit?usp=drivesdk",
      "content": "﻿Beam Integration for The Pets Table\n\n________________\n\n\n\n\n\n\n\n\n\nBeam Integration for The Pets Table\n\n\tSummary: Beam is a social impact integration platform that enables companies to donate a percentage of a customer's purchase to a charity. Instead of the company choosing the cause, Beam allows the user to select the specific charity they want to support from a curated list. \n\nThe Pets Table plans to launch Beam as a conversion rate improvement tool and retention booster. \n\n\tCreated At: Dec 19, 2025\n\n\tLast Updated: Dec 19, 2025\n\n\tEditor(s): Maria Chelminska\n\n\tStrategy: xxx\n\n\tFigma: link\n\n\tBusiness Scoping Doc / Other documentation: link\n\n\tContext\n\nUser Problem\n\nAs a pet food subscription user, I am struggling with: \n\n* Choice Overload: Pet food subscription users are faced with a vast number of choices regarding food types and producers, making it difficult to decide which specific brand to commit to.\n\n* Lack of Purpose: Customers are looking for additional reasons or a sense of purpose when choosing a producer; they often feel \"powerless\" to make a real difference and want their \"consumer power\" to result in tangible social impact\n\nVision\n\nBy integrating with Beam, we want to transform the decision to subscribe to The Pets Table into a more emotional experience by providing users with a clear purpose. By allowing customers to choose a high-impact nonprofit to support at no extra cost, the brand shifts the relationship from a standard transaction to a mission-driven partnership\n\nSuccess Metrics:\n\n* Gross CVR improvement (define the breakeven?) \n\n* AOR improvement\n\n* CVA improvement\n\nScope\n\nV1 Focus: For the initial version, the integration will be limited to the conversion funnel.\n\n* Excluded Elements: V1 will not include the active experience component (the post-purchase subscriber dashboard in settings, impact tracking or cancelaltion deflection components).\n\n* Included funnel Touchpoints:\n\n   * Early Funnel Teasers: Informing users about the donation option during the quiz, meal selection, or registration steps.\n\n      * To be decided on which step, candidates: \n\n         * Loading between funnel and plans selection, \n\n         * popup message in the quiz (e.g. on the body condition question) - to make it more emotional \n\n         * registration page, \n\n   * Charity opt-in and selection on checkout: The primary interaction point where the user selects a curated charity. This component will be available on the /checkout/payment step. For mobile, this will sit below the Order Summary; for web, it will sit between the summary and the assurance message \n\n  \n\n\n\n   * Consider adding a Thank you message after the user interacts with the selection component\n\n\n\n   * V2 (if experiment is successful)\n\n   * API integration in order to automate data sharing between TPT and Beam and automate donation transfers. \n\nRequirements\n\nRequirement Area\n\n\tCurrent Problem or User Story\n\n\tRequirement\n\n\tPrio\n\n\tSolution / Visual Reference \n\n\tEarly Funnel Teaser\n\n\tAs an indecisive user, I want to be informed about the option to donate my money early.\n\n\tInclude a “teaser” about Beam in the upper funnnel. Options: \n\nLoading before meals\n\nInformation under one of the questions “Did you know…” \n\nRegistration (but already quite late)\n\n\tP1 \n\n\t\n\n\n\n\tCheckout Selection\n\n\tAs a user, I want to choose the specific cause my purchase supports.\n\n\tThe selection of charities is optional, but it is easily accessible to the user on the checkout pages\n\n\tP0\n\n\t\n\n\n\n\tSelection Acknowlegement / Confirmation\n\n\tAs a user, I want confirmation that my choice was recorded.\n\n\tThank You Page Impact: Display the selected charity and a reminder of the impact made.\n\n\tP2\n\n\t\n\n\n\n\tExperimentation\n\n\tAs a TPT team we are easily able to track the impact of Beam integration and calculate the ROI\n\n\t\n\n\n\n\tP0\n\n\t\n\n\n\n\t\n\n\n\nExperimentation\n\nSetup: \n\n   * A/B test\n\n   * A - control\n\n   * B - variation, allocation on the point of showing the “Teaser” \n\n   * 50/50 split\n\n   * Primary metric: gross CVR \n\n   * Secondary metrics:\n\n   * micro conversion rate from the allocation page to the next page (depending on allocation)\n\n   * CVR\n\n   * AOR \n\n   * Experimentation Platform: Statsig (Run and implemented by The Pets Table team)\n\nImplementation Details:\n\nFor V1\n\n   * For the duration of the test the Information about completed transactions will be shared manually, on a monthly basis we will be sharing the list of successful transactions along with the selected fondation, and user_id. \n\n   * Next Steps + Ownership\n\nWhat\n\n\tDetails\n\n\tBy when \n\n\tWho \n\n\tDesign \n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\tLegal notes\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\tFormat + Process of sharing the transaction data\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\tTechnical implementation\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\n\n\n\nOpen Questions: \n\n   1. What are the available charities you support? How should we design the list? Should we go beyond “food for dogs” and support also clinics / vets? What are the options?\n\n   1. TPT predefined charity - e.g. shelters for dogs in NYC (HQ) \n\n   2. Local shelter\n\n   3. State-level dog charity (based on API) \n\n   4. International, high credibility \n\n   2. What are your learnings from long funnels? What is in your opinion the best placement for the funnel?\n\n   3. Additional ideas: Have you ever tested a Thank you message (sth like “thank you for your contribution”)? \n\n   4. What are the best copywriting insights you have?\n\n   5. How important is ensuring that the donations will be made for every order, until the user cancels? \n\n   6. Legal - do you have an example of T&Cs? Where are T&Cs placed? \n\n   7. Who is responsible for designs? What is the split of ownership? \n\n   8. Any limitations we should be aware of given limiting the experiment to the funnel only? (the semi-manual solution? \n\nAppendix:",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-19-01.md",
      "source_date": "2025-12-19",
      "doc_type": "prd",
      "matched_topics": [
        "the pets table",
        "pets table",
        "tpt"
      ],
      "matched_people": [
        "maria"
      ],
      "filter_score": 4
    },
    {
      "title": "PRD: Dashboard Simplification and Excitement",
      "doc_id": "1C1YiiwpFc4bWE_dssCpA8Mi-1i_8CypmrKimqZ0h9p8",
      "link": "https://docs.google.com/document/d/1C1YiiwpFc4bWE_dssCpA8Mi-1i_8CypmrKimqZ0h9p8/edit?usp=drivesdk",
      "content": "﻿Dashboard Simplification and Excitement\n\n________________\n\n\n\n\n\n\n\n\n\nDashboard Simplification and Excitement (PRD)\n\n\tSummary: This document details the scope for the Dashboard Simplification and Excitement. The primary goal of the \"Dashboard Simplification and Excitement\" initiative is to streamline the subscription management experience for existing The Pets Table users while enhancing engagement and emotional connection\n\n\tCreated At: Dec 2, 2025\n\n\tLast Updated: Dec 18, 2025\n\n\tEditor(s): Maria Chelminska\n\n\tStrategy: xxx\n\n\tFigma: TBD\n\n\tBusiness Scoping Doc: Scoping document: improving actives dashboard experience\n\nActive UX Experience Initiative-Dec 2025\n\n\t\n\n\n\nGoal & Vision\n\nThe primary goal of the \"Dashboard Simplification and Excitement\" initiative is to streamline the subscription management experience for existing The Pets Table users while enhancing engagement and emotional connection.[a][b]\n\nThe current user Dashboard suffers from several usability issues, primarily stemming from inherited design elements from the HelloFresh Group (e.g., the multi-week calendar navigation, as seen in the screenshot) and poor information hierarchy. Key problems include:\n\n* Wasted Space: Excessive use of space for non-critical information (e.g., future week navigation) and poor mobile visibility.\n\n* Low Discoverability of the Pet Switcher for multi-pet households is difficult to locate.[c][d]\n\n* Low Excitement: The page is overly transactional, lacking personal elements (pet photos) and content (feeding tips) that foster an emotional connection.\n\n* Poor Add-on Visibility: Add-ons are not prominently featured, resulting in missed upsell opportunities, particularly on mobile devices.\n\nVision: A clean, intuitive, and emotionally engaging user dashboard that makes managing a The Pets Table subscription effortless and exciting:\n\nSuccess Metrics:\n\n* Increase AOR\n\n* Increase DAU (Daily Active Users)\n\n* Increase Clicks on Pet Switcher\n\n* Decrease Time to find next-delivery management options (e.g., \"Change meals\")\n\n* Increase Add ons take rate\n\n* Increase Engagement by launching new \"Excitement\" features (such as Pet Photo Upload)\n\n\n\n\n\nScope\n\nComponents that are not subject to change as part of this initiative  \n\n* Quick actions navigation \n\n* Pet Profile page (for now) - separate initiative, but we can reprioritize the roadmap and start with the pet profile improvement \n\n* Our products page - separate initiative\n\n\n\n\n\nThis initiative focuses on a complete overhaul of the Active User Dashboard experience across both desktop and mobile views. Ideas: \n\n1. Reworking the header / burger menu - improving navigation:\n\n   1. Deciding on the placement of different pages in Header / footer\n\n      1. Putting more emphasis on pages (Header)\n\n         1. Dashboard (consider changing name to “Home”) \n\n         2. Pet Profile (for now link to Settinfs, in the future take it out from Settings and create a separate page)\n\n         3. RAF (“Send free food” copy to draw more attention)\n\n         4. Contact Us\n\n      2. TBD\n\n         1. Add-ons Store - tbd, if header of exposing more on the dashboard (this would require to create a separate page as GoC is doing) [e][f]\n\n         2. Feeding Guide - are entry points on dashboard enough, or does it require additional? \n\n      3. Move to the footer: \n\n         1. FAQ\n\n         2. Our Kitchen\n\n         3. Why Switch\n\n         4. Reviews\n\n         5. About Us[g]\n\n   2. Aligning on the order of the pages \n\n   3. Changes in the UI \n\n      1. Changes in the UI will mean branching out from the WL code - additional overhead costs for ma\n\n\n\n025-12-23 09:55 AM\n\n[h]& removing if we think we need that for dog deaths\n\n[i]we have a process for dog death management - once dog is marked as passed away the profile is no longer visible, so I believe we should be good there\n\n[j]I think this only makes sense IF we do something with this data\n\n[k]check number of interactions\n\n[l]@maria.chelminska@hellofresh.com has this come up through customer feedback as an issue?\n\n_Assigned to maria.chelminska@hellofresh.com_\n\n[m]There are some comments about this in sprig. While we wont find comments like \"please add images\", showing more details about the delivery might improve the value perception. \n\n\n\n\n\ne.g. \n\n1. When you send an order, you should put on the website EXACTLY what was ordered, not just price. What exactly is \"4 weeks of food\"? How many bags of each flavor were sent? I want to be able to see each order in its entirety. I also would like an email stating that my order is getting ready to be sent and what is about to be sent to me. This is way too vague for my taste, and I don't want my info shared with other parties!\n\nWhat is the monthly price for each delivery\n\n2. Show price in cart. I tried to order for my 2nd dog, and overweight Italian Greyhound, and her pkg was not given the 50% off for her trial box...so 50+ for hers and 31 for Ginger. I feel that is not right, so I did nor order for Ginger.\n\n3. It is already great, but your prices are a over whelming.\n\n[n]May be also give an entry point to customers to provide feedback on the recent box or how much their pet liked it?\n\n[o]Overall I like the idea, but we do not support reviews on the website. This would need to be enabled\n\n[p]BB shows a video on the RAF page for \"why your friends will love BNB\" which is a product benefits video (which we also have) that could work well\n\n[q]@maria.chelminska@hellofresh.com I think this product marketing initiative should be expanded to:\n\n- % Stats\n\n- Social proof\n\n- Product claims\n\n\n\n\n\nThis needs more scoping & I don't have a clear plan on where it would go but I do think we need more content which drives repurchase and reminds people why the product is so good\n\n[r]agree, this should be our focus to think of these placements, but also find natural positioning of the product claims. \n\n\n\n\n\n@rena.zhou@hellofresh.com Could you help me with coming up with the list of our top product claims which we would like to expose?",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-23-.md",
      "source_date": "2025-12-23",
      "doc_type": "prd",
      "matched_topics": [
        "goc",
        "the pets table",
        "pets table"
      ],
      "matched_people": [
        "maria"
      ],
      "filter_score": 4
    },
    {
      "title": "PRD: Beam Integration for The Pets Table",
      "doc_id": "1k1YJwp5u1n1dNuQJlkkbTM7TAZCoDUxQDqt7ZTTNH08",
      "link": "https://docs.google.com/document/d/1k1YJwp5u1n1dNuQJlkkbTM7TAZCoDUxQDqt7ZTTNH08/edit?usp=drivesdk",
      "content": "﻿Beam Integration for The Pets Table\n\n________________\n\n\n\n\n\n\n\n\n\nBeam Integration for The Pets Table\n\n\tSummary: Beam is a social impact integration platform that enables companies to donate a percentage of a customer's purchase to a charity. Instead of the company choosing the cause, Beam allows the user to select the specific charity they want to support from a curated list. \n\nThe Pets Table plans to launch Beam as a conversion rate improvement tool and retention booster. \n\n\tCreated At: Dec 19, 2025\n\n\tLast Updated: Dec 19, 2025\n\n\tEditor(s): Maria Chelminska\n\n\tStrategy: xxx\n\n\tFigma: link\n\n\tBusiness Scoping Doc / Other documentation: link\n\n\tContext\n\nUser Problem\n\nAs a pet food subscription user, I am struggling with: \n\n* Choice Overload: Pet food subscription users are faced with a vast number of choices regarding food types and producers, making it difficult to decide which specific brand to commit to.\n\n* Lack of Purpose: Customers are looking for additional reasons or a sense of purpose when choosing a producer; they often feel \"powerless\" to make a real difference and want their \"consumer power\" to result in tangible social impact\n\nVision\n\nBy integrating with Beam, we want to transform the decision to subscribe to The Pets Table into a more emotional experience by providing users with a clear purpose. By allowing customers to choose a high-impact nonprofit to support at no extra cost, the brand shifts the relationship from a standard transaction to a mission-driven partnership\n\nSuccess Metrics:\n\n* Gross CVR improvement (define the breakeven?) [a]\n\n* AOR improvement\n\n* CVA improvement\n\nScope\n\nV1 Focus: For the initial version, the integration will be limited to the conversion funnel.\n\n* Excluded Elements: V1 will not include the active experience component (the post-purchase subscriber dashboard in settings, impact tracking or cancellation deflection components).\n\n* Included funnel Touchpoints:\n\n   * Early Funnel Teasers: Informing users about the donation option during the quiz, meal selection, or registration steps.\n\n      * To be decided on which step, candidates: \n\n         * Loading between funnel and plans selection, \n\n         * popup message in the quiz (e.g. on the body condition question) - to make it more emotional \n\n         * registration page, \n\n   * Charity opt-in and selection on checkout: The primary interaction point where the user selects a curated charity. This component will be available on the /checkout/payment step. For mobile, this will sit below the Order Summary; for web, it will sit between the summary and the assurance message [b]\n\n  \n\n\n\n   * Consider adding a Thank you message after the user interacts with the selection component\n\n\n\n   * V2 (if experiment is successful)\n\n   * API integration in order to automate data sharing between TPT and Beam and automate donation transfers. \n\nRequirements\n\nRequirement Area\n\n\tCurrent Problem or User Story\n\n\tRequirement\n\n\tPrio\n\n\tSolution / Visual Reference \n\n\tEarly Funnel Teaser\n\n\tAs an indecisive user, I want to be informed about the option to donate my money early.\n\n\tInclude a “teaser” about Beam in the upper funnnel. Options: \n\nLoading before meals\n\nInformation under one of the questions “Did you know…” \n\nRegistration (but already quite late)\n\n\tP1 \n\n\t\n\n\n\n\tCheckout Selection\n\n\tAs a user, I want to choose the specific cause my purchase supports.\n\n\tThe selection of charities is optional, but it is easily accessible to the user on the checkout pages\n\n\tP0\n\n\t\n\n\n\n\tSelection Acknowlegement / Confirmation\n\n\tAs a user, I want confirmation that my choice was recorded.\n\n\tThank Yo\n\n\n\non\n\nSetup: \n\n   * A/B test\n\n   * A - control\n\n   * B - variation, allocation on the point of showing the “Teaser” \n\n   * 50/50 split\n\n   * Primary metric: gross CVR \n\n   * Secondary metrics:\n\n   * micro conversion rate from the allocation page to the next page (depending on allocation)\n\n   * CVR\n\n   * AOR \n\n   * Experimentation Platform: Statsig (Run and implemented by The Pets Table team)\n\nImplementation Details:\n\nFor V1\n\n   * For the duration of the test the Information about completed transactions will be shared manually, on a monthly basis we will be sharing the list of successful transactions along with the selected fondation, and user_id. \n\n   * Next Steps + Ownership\n\nWhat\n\n\tDetails\n\n\tBy when \n\n\tWho \n\n\tDesign \n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\tLegal notes\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\tFormat + Process of sharing the transaction data\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\tTechnical implementation\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\n\n\n\nOpen Questions: \n\n   1. What are the available charities you support? How should we design the list? Should we go beyond “food for dogs” and support also clinics / vets? What are the options?\n\n   1. TPT predefined charity - e.g. shelters for dogs in NYC (HQ) \n\n   2. Local shelter\n\n   3. State-level dog charity (based on API) \n\n   4. International, high credibility \n\n   2. What are your learnings from long funnels? What is in your opinion the best placement for the funnel?\n\n   3. Additional ideas: Have you ever tested a Thank you message (sth like “thank you for your contribution”)? \n\n   4. What are the best copywriting insights you have?\n\n   5. How important is ensuring that the donations will be made for every order, until the user cancels? \n\n   6. Legal - do you have an example of T&Cs? Where are T&Cs placed? \n\n   7. Who is responsible for designs? What is the split of ownership? \n\n   8. Any limitations we should be aware of given limiting the experiment to the funnel only? (the semi-manual solution? \n\nAppendix: \n\n\n\n\n\n[a]Beam have their calculation for ROI which will also be used for contractual reasons for the money back guarantee element.\n\n\n\n\n\nThat said, we should form our own view of what the ROI of this initiative is\n\n[b]@maria.chelminska@hellofresh.com I think this makes sense but it's also quite late in the customer journey and we will have lost a lot of customers from the funnel. I wonder if it's better to have it earlier than this\n\n_Assigned to maria.chelminska@hellofresh.com_",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-23-.md",
      "source_date": "2025-12-23",
      "doc_type": "prd",
      "matched_topics": [
        "the pets table",
        "pets table",
        "tpt"
      ],
      "matched_people": [
        "maria"
      ],
      "filter_score": 4
    },
    {
      "title": "PRD: Beam Integration for The Pets Table",
      "doc_id": "1k1YJwp5u1n1dNuQJlkkbTM7TAZCoDUxQDqt7ZTTNH08",
      "link": "https://docs.google.com/document/d/1k1YJwp5u1n1dNuQJlkkbTM7TAZCoDUxQDqt7ZTTNH08/edit?usp=drivesdk",
      "content": "﻿Beam Integration for The Pets Table\n\n________________\n\n\n\n\n\n\n\n\n\nBeam Integration for The Pets Table\n\n\tSummary: Beam is a social impact integration platform that enables companies to donate a percentage of a customer's purchase to a charity. Instead of the company choosing the cause, Beam allows the user to select the specific charity they want to support from a curated list. \n\nThe Pets Table plans to launch Beam as a conversion rate improvement tool and retention booster. \n\n\tCreated At: Dec 19, 2025\n\n\tLast Updated: Dec 19, 2025\n\n\tEditor(s): Maria Chelminska\n\n\tStrategy: xxx\n\n\tFigma: link\n\n\tBusiness Scoping Doc / Other documentation: link\n\n\tContext\n\nUser Problem\n\nAs a pet food subscription user, I am struggling with: \n\n* Choice Overload: Pet food subscription users are faced with a vast number of choices regarding food types and producers, making it difficult to decide which specific brand to commit to.\n\n* Lack of Purpose: Customers are looking for additional reasons or a sense of purpose when choosing a producer; they often feel \"powerless\" to make a real difference and want their \"consumer power\" to result in tangible social impact\n\nVision\n\nBy integrating with Beam, we want to transform the decision to subscribe to The Pets Table into a more emotional experience by providing users with a clear purpose. By allowing customers to choose a high-impact nonprofit to support at no extra cost, the brand shifts the relationship from a standard transaction to a mission-driven partnership\n\nSuccess Metrics:\n\n* Gross CVR improvement (define the breakeven?) [a]\n\n* AOR improvement\n\n* CVA improvement\n\nScope\n\nV1 Focus: For the initial version, the integration will be limited to the conversion funnel.\n\n* Excluded Elements: V1 will not include the active experience component (the post-purchase subscriber dashboard in settings, impact tracking or cancellation deflection components).\n\n* Included funnel Touchpoints:\n\n   * Early Funnel Teasers: Informing users about the donation option during the quiz, meal selection, or registration steps.\n\n      * To be decided on which step, candidates: \n\n         * Loading between funnel and plans selection, \n\n         * popup message in the quiz (e.g. on the body condition question) - to make it more emotional \n\n         * registration page\n\n   * Charity opt-in and selection on checkout: The primary interaction point where the user selects a curated charity. This component will be available on the /checkout/payment step. For mobile, this will sit below the Order Summary; for web, it will sit between the summary and the assurance message [b]\n\n  \n\n\n\n   * Consider adding a Thank you message after the user interacts with the selection component\n\n\n\n   * V2 (if experiment is successful)\n\n   * API integration in order to automate data sharing between TPT and Beam and automate donation transfers. \n\nRequirements\n\nRequirement Area\n\n\tCurrent Problem or User Story\n\n\tRequirement\n\n\tPrio\n\n\tSolution / Visual Reference \n\n\tEarly Funnel Teaser\n\n\tAs an indecisive user, I want to be informed about the option to donate my money early.\n\n\tInclude a “teaser” about Beam in the upper funnnel. Options: \n\nLoading before meals\n\nInformation under one of the questions “Did you know…” \n\nRegistration (but already quite late)\n\n\tP1 \n\n\t\n\n\n\n\tCheckout Selection\n\n\tAs a user, I want to choose the specific cause my purchase supports.\n\n\tThe selection of charities is optional, but it is easily accessible to the user on the checkout pages\n\n\tP0\n\n\t\n\n\n\n\tSelection Acknowlegement / Confirmation\n\n\tAs a user, I want confirmation that my choice was recorded.\n\n\tThank You \n\n\n\nails:\n\nFor V1\n\n   * For the duration of the test the Information about completed transactions will be shared manually, on a monthly basis we will be sharing the list of successful transactions along with the selected fondation, and user_id. \n\n   * Next Steps + Ownership\n\nWhat\n\n\tDetails\n\n\tBy when \n\n\tWho \n\n\tDesign \n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\tLegal notes\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\tFormat + Process of sharing the transaction data\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\tTechnical implementation\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\n\t\n\n\n\nSensitive Data Shared:\n\n   * Would be processing data for us anyway so might need to go through it:\n\n   * What data is processed?\n\n   * IP address for geo localization of donations (deleted afterwards) - (3% of traffic is impossible to identify IP address)\n\n   * Email addresses (might be saved for CRM)\n\n   * Cart total\n\n   * Order ID\n\n   * Zipcode (might not be needed as have IP but zipcode is more reliable)\n\n \n\nOpen Questions: \n\n   1. What are the available charities you support? How should we design the list? Should we go beyond “food for dogs” and support also clinics / vets? What are the options?\n\n   1. TPT predefined charity - e.g. shelters for dogs in NYC (HQ) \n\n   2. Local shelter\n\n   3. State-level dog charity (based on API) \n\n   4. International, high credibility \n\n   2. What are your learnings from long funnels? What is in your opinion the best placement for the funnel?\n\n   3. Additional ideas: Have you ever tested a Thank you message (sth like “thank you for your contribution”)? \n\n   4. What are the best copywriting insights you have?\n\n   5. How important is ensuring that the donations will be made for every order, until the user cancels? \n\n   6. Legal - do you have an example of T&Cs? Where are T&Cs placed? \n\n   7. Who is responsible for designs? What is the split of ownership? \n\n   8. Any limitations we should be aware of given limiting the experiment to the funnel only? (the semi-manual solution? \n\nAppendix: \n\n\n\n\n\n[a]Beam have their calculation for ROI which will also be used for contractual reasons for the money back guarantee element.\n\n\n\n\n\nThat said, we should form our own view of what the ROI of this initiative is\n\n[b]@maria.chelminska@hellofresh.com I think this makes sense but it's also quite late in the customer journey and we will have lost a lot of customers from the funnel. I wonder if it's better to have it earlier than this\n\n_Assigned to maria.chelminska@hellofresh.com_",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-23-01.md",
      "source_date": "2025-12-23",
      "doc_type": "prd",
      "matched_topics": [
        "the pets table",
        "pets table",
        "tpt"
      ],
      "matched_people": [
        "maria"
      ],
      "filter_score": 4
    },
    {
      "title": "PRD: TPT Sign-up Page Revamp",
      "doc_id": "1VOx0gTwY6uxc3WsFBI8AqjEbWeTM6n_xZWEBese9oK4",
      "link": "https://docs.google.com/document/d/1VOx0gTwY6uxc3WsFBI8AqjEbWeTM6n_xZWEBese9oK4/edit?usp=drivesdk",
      "content": "﻿Memo: Signup Page drop off rates\n\nData reveals (chart below) that the registration page on ThePetsTable adds little friction to the customer journey to the address page. In 2025, the total “Visited Address” (12.25%) sessions is higher than “Visited Registration” (11.62%) sessions for PetsTable, this is in sharp contrast to the HelloFresh sessions data, where over 45% users are lost from registration to address page. The sessions drop off in PetsTable is significantly lower because of three reasons:\n\n\n\n\n\n1. The registration page is skipped entirely for customers who logged in a previous session, and are redirected to the checkout page directly by the site cookies. HelloFresh also has the same behavior but in the case of PetsTable, the customer is completing registration often and also coming back more often to a previously logged in session. \n\n\n\n\n\n2. The higher registration completion rate can also be attributed to high intent and cognitive investment of the customer, who before reaching the registration page has completed 9 steps of the quiz (which sometimes needs research - pup weight, dietary preference, allergies, goals) and selected the plan & recipe selection. The % session for HelloFresh, ThePetsTable and GoodChop remain the same to the Address page. \n\n\n\n\n\n3. Plus, increasing propensity to make more premium & health conscious choices for their pets over themselves, drives higher intent in completion of the PetsTable account registration, than that of HelloFresh. \n\n\n\n\n\nGiven that the registration step isn’t resulting in customer drop offs, the removal of the page is not likely to increase conversions. The registration page is in fact necessary[a][b][c][d] to verify whether a prospect already has an account, which helps in redirecting existing users to the reactivation page (and adjusting applicable discounts), and prevents them from redundantly navigating the entire signup funnel. After enabling email autopopulation on the registration page from WKND cookie, the friction on this page has declined further. Therefore, we advocate to keep the registration page, make minimal functional changes and improve the sign up CTA to increase the customer intent further to complete checkout.\n\n\n\n\n\nThe Pets Table (More sessions to Address page than the Registration page):\n\n  \n\n\n\n\n\n\n\nHello Fresh (Over 55% customers drop from Registration page to Address page):\n\n  \n\n\n\n\n\n\n\n  Current Experience:\n\nNote that the funnel data above captures conversions from the registration page before we started auto populating the customer email from the WKND cookie (link). In majority of the cases, customers will now see the email populated and are directly prompted to enter a password, which should be a delightful customer experience. \n\n\n\n\n\nGiven that we do not have any password rules or checks currently on the page, customers can set any password and can navigate to the address page. HelloFresh data also shows that only 3.4% users abandon[e] (link) the registration process without submitting a password after providing their email address. \n\n\n\n\n\nHowever, we can optimize this page UI to move away from a transactional tone to an emotional tone to further improve customer intent to complete the checkout. [f]\n\n\n\n\n\nWe should also note immediate 2 weeks conversions [g]post the improvements from WKND cookies for any adverse customer experiences. \n\n\t  \n\n\n\n\tSign up page Improvements:\n\nVision\n\nWhile not a major source of customer drop off, we still have the opportunity to improve the login experience for the first time visitors on the website to move them quickly through the\n\n\n\nbmitting a password after providing their email address. Therefore, the password itself is not a friction point but providing another way to login could help conversions. \n\n\n\n\n\nThough an innovative way to login may not result in a similar increase in conversions from older customer base, who are more accustomed to login/password UX, and are already comfortable completing registrations on the PetsTable.   \n\n\tP1 \n\n\n\n\n\nImpact: Medium\n\nEffort: 8 pts\n\n\n\n\n\n\tUse social logins\n\n\tProvide customers with social login options like  Apple, Google & Facebook to improve registration completion and improve conversions\n\n\tIn HelloFresh, adding social logins (statsig) increased the conversion rate by 2.66%. However, we hypothesize social logins will not have much impact on registration completion rate in the PetsTable (& thus conversions) as our customer demographics is much older (>50% customers are 50+ years old), who are less likely to use social logins.\n\n\tP2\n\n\n\n\n\nImpact: Low\n\nEffort: 8 pts\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Question: Do we remove the Add-ons promotions CTA?\n\nRationale for keeping the Add-ons banner:\n\n1. Two experiments that tested adding a seasonal promotional banner on the Sign up page resulted (in a similar location as the Add-ons promotional banner) in positive improvements in CVR. \n\n2. Customers hear about the Add-ons product for the first time in the sign up page and create intent to buy add-ons during checkout. \n\nRationale for removing Add-ons banner:\n\n1. Test moving one of the below the fold element (Social proof, product stat) on the banner location to further increase customer intent on checkout. \n\n\n\n\n\nGiven that we already prioritized an initiative (improve sign up CTA) to improve content and don't have experimental bandwidth, we recommend to keep the add-ons banner. \n\n\n\n\n\n\n\n\n\n  \n\n\n\n[a]OK, what's not clear for me - what's the customer problem; basically, reading this, my POV would be - why touch this at all? I am certain we have bigger fish to fry and the improvement that we caen get from here doesn't seem to be worth the investment even on a discovery level; no?\n\n[b]Yes … The CTA would have customer attention and we can optimize it and we can do some correct representation of reviews but the page is good as is.\n\n[c]_Marked as resolved_\n\n[d]_Re-opened_\n\n[e]~30% according to GA\n\n[f]but should we? Based on the data above?\n\n[g]not clear what do you mea by this?",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-29-.md",
      "source_date": "2025-12-29",
      "doc_type": "prd",
      "matched_topics": [
        "goodchop",
        "the pets table",
        "pets table",
        "tpt"
      ],
      "matched_people": [],
      "filter_score": 4
    },
    {
      "title": "Memo: TPT Sign-up Page Revamp",
      "doc_id": "1VOx0gTwY6uxc3WsFBI8AqjEbWeTM6n_xZWEBese9oK4",
      "link": "https://docs.google.com/document/d/1VOx0gTwY6uxc3WsFBI8AqjEbWeTM6n_xZWEBese9oK4/edit?usp=drivesdk",
      "content": "﻿Memo: Signup Page drop off rates\n\nData reveals (chart below) that the registration page on ThePetsTable adds little friction to the customer journey to the address page. In 2025, the total “Visited Address” (12.25%) sessions is higher than “Visited Registration” (11.62%) sessions for PetsTable, this is in sharp contrast to the HelloFresh sessions data, where over 45% users are lost from registration to address page. The sessions drop off in PetsTable is significantly lower because of three reasons:\n\n\n\n\n\n1. The registration page is skipped entirely for customers who logged in a previous session, and are redirected to the checkout page directly by the site cookies. HelloFresh also has the same behavior but in the case of PetsTable, the customer is completing registration often and also coming back more often to a previously logged in session. \n\n\n\n\n\n2. The higher registration completion rate can also be attributed to high intent and cognitive investment of the customer, who before reaching the registration page has completed 9 steps of the quiz (which sometimes needs research - pup weight, dietary preference, allergies, goals) and selected the plan & recipe selection. The % session for HelloFresh, ThePetsTable and GoodChop remain the same to the Address page. \n\n\n\n\n\n3. Plus, increasing propensity to make more premium & health conscious choices for their pets over themselves, drives higher intent in completion of the PetsTable account registration, than that of HelloFresh. \n\n\n\n\n\nGiven that the registration step isn’t resulting in customer drop offs, the removal of the page is not likely to increase conversions. The registration page is in fact necessary[a][b][c][d] to verify whether a prospect already has an account, which helps in redirecting existing users to the reactivation page (and adjusting applicable discounts), and prevents them from redundantly navigating the entire signup funnel. After enabling email autopopulation on the registration page from WKND cookie, the friction on this page has declined further. Therefore, we advocate to keep the registration page, make minimal functional changes and improve the sign up CTA to increase the customer intent further to complete checkout.\n\n\n\n\n\nThe Pets Table (More sessions to Address page than the Registration page):\n\n  \n\n\n\n\n\n\n\nHello Fresh (Over 55% customers drop from Registration page to Address page):\n\n  \n\n\n\n\n\n\n\n  Current Experience:\n\nNote that the funnel data above captures conversions from the registration page before we started auto populating the customer email from the WKND cookie (link). In majority of the cases, customers will now see the email populated and are directly prompted to enter a password, which should be a delightful customer experience. \n\n\n\n\n\nGiven that we do not have any password rules or checks currently on the page, customers can set any password and can navigate to the address page. HelloFresh data also shows that only 3.4% users abandon[e] (link) the registration process without submitting a password after providing their email address. \n\n\n\n\n\nHowever, we can optimize this page UI to move away from a transactional tone to an emotional tone to further improve customer intent to complete the checkout. [f]\n\n\n\n\n\nWe should also note immediate 2 weeks conversions [g]post the improvements from WKND cookies for any adverse customer experiences. \n\n\t  \n\n\n\n\tSign up page Improvements:\n\nVision\n\nWhile not a major source of customer drop off, we still have the opportunity to improve the login experience for the first time visitors on the website to move them quickly through the\n\n\n\nbmitting a password after providing their email address. Therefore, the password itself is not a friction point but providing another way to login could help conversions. \n\n\n\n\n\nThough an innovative way to login may not result in a similar increase in conversions from older customer base, who are more accustomed to login/password UX, and are already comfortable completing registrations on the PetsTable.   \n\n\tP1 \n\n\n\n\n\nImpact: Medium\n\nEffort: 8 pts\n\n\n\n\n\n\tUse social logins\n\n\tProvide customers with social login options like  Apple, Google & Facebook to improve registration completion and improve conversions\n\n\tIn HelloFresh, adding social logins (statsig) increased the conversion rate by 2.66%. However, we hypothesize social logins will not have much impact on registration completion rate in the PetsTable (& thus conversions) as our customer demographics is much older (>50% customers are 50+ years old), who are less likely to use social logins.\n\n\tP2\n\n\n\n\n\nImpact: Low\n\nEffort: 8 pts\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Question: Do we remove the Add-ons promotions CTA?\n\nRationale for keeping the Add-ons banner:\n\n1. Two experiments that tested adding a seasonal promotional banner on the Sign up page resulted (in a similar location as the Add-ons promotional banner) in positive improvements in CVR. \n\n2. Customers hear about the Add-ons product for the first time in the sign up page and create intent to buy add-ons during checkout. \n\nRationale for removing Add-ons banner:\n\n1. Test moving one of the below the fold element (Social proof, product stat) on the banner location to further increase customer intent on checkout. \n\n\n\n\n\nGiven that we already prioritized an initiative (improve sign up CTA) to improve content and don't have experimental bandwidth, we recommend to keep the add-ons banner. \n\n\n\n\n\n\n\n\n\n  \n\n\n\n[a]OK, what's not clear for me - what's the customer problem; basically, reading this, my POV would be - why touch this at all? I am certain we have bigger fish to fry and the improvement that we caen get from here doesn't seem to be worth the investment even on a discovery level; no?\n\n[b]Yes … The CTA would have customer attention and we can optimize it and we can do some correct representation of reviews but the page is good as is.\n\n[c]_Marked as resolved_\n\n[d]_Re-opened_\n\n[e]~30% according to GA\n\n[f]but should we? Based on the data above?\n\n[g]not clear what do you mea by this?",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-29-01.md",
      "source_date": "2025-12-29",
      "doc_type": "prd",
      "matched_topics": [
        "goodchop",
        "the pets table",
        "pets table",
        "tpt"
      ],
      "matched_people": [],
      "filter_score": 4
    }
  ],
  "doc_count": 8,
  "total_chars": 47778
}