{
  "batch_id": "meeting_080",
  "doc_type": "meeting",
  "documents": [
    {
      "title": "Influencer MP Sprint Review - 2025/12/04 16:24 CET - Notes by Gemini",
      "doc_id": "13B4nLGPHNDKiKoAoEWfmOpkEZ5GMMzozNYhzFijHDYE",
      "link": "https://docs.google.com/document/d/13B4nLGPHNDKiKoAoEWfmOpkEZ5GMMzozNYhzFijHDYE/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 4, 2025\n\nInfluencer MP Sprint Review\n\nInvited Annette MvdE Sameer Doda Shay Obaidullah Linnea Siersma Alison McMenemy Ian Brooks Melanie Schwindt Katheryn Eckles Cole Banning Jama Musse Marc Wanderley Teixeira Marina Kramer\n\nAttachments Influencer MP Sprint Review \n\nMeeting records Transcript Recording \n\n\n\n\n\nSummary\n\nAnnette MvdE led the meeting, focusing on the status of creator research, the plan for customer validation, and a critique of the validation prototype with Ian Brooks, Katheryn Eckles, Melanie Schwindt, Linnea Siersma, Sameer Doda, and Cole Banning participating. Katheryn Eckles reported on five creator interviews, with upcoming research moving into concept validation and a customer interview phase to understand the inspiration execution gap, marketplace value, and trust barriers. Participants discussed pricing models, with Ian Brooks and Linnea Siersma favoring a model where creators set their own margin, while Sameer Doda proposed a tiered, cost-plus approach, and Annette MvdE confirmed that the concept validation prototype will use a pitch deck to guide conversation and feature critique.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Meeting Context and Agenda Annette MvdE initiated the meeting, sharing the document link and planning to screen-share (00:00:00). The agenda focused on the status of creator research, the plan for the next customer validation round, and a prototype critique for the validation test (00:01:04). The goal was to cover everything in 60 minutes, though Ian Brooks noted they would try to keep their participation to 45 minutes (00:00:00).\n\n* Creator Research Status Katheryn Eckles reported five creator interviews completed, covering a mix of creator sizes up to 1.2 million followers, with generally consistent insights (00:01:56). They found that one cookbook author saw no conflict in using their cookbook recipes on the platform for exposure and was aligned with commission-based compensation. The research is transitioning to focus on cookbook authors and higher-level influencers, probing deeper into their use of trends and vetting expectations (00:03:06).\n\n* Creator Vetting and Data Needs The cookbook author interviewed acknowledged that customers might not fully understand if HelloFresh is not vetting recipes in an Amazon-style marketplace approach and might still blame the platform or the creator for bad recipes (00:04:20). Creators are interested in data points such as user interests, popular ingredients, cooking time, and site traffic (00:05:29).\n\n* Concept Validation and Next Steps for Creator Research Katheryn Eckles stated that the interviews are moving into concept validation next week to obtain deeper insights into how creators see the platform working (00:05:29). The expected outcomes include stronger indicators of desirability and feature prioritization (00:07:34). Recruitment is ongoing, focusing on larger influencers, with the option to re-engage previous participants (00:06:32).\n\n* Customer Research Plan The next phase of research will focus on customer interviews, building on signals from unmoderated tests and a survey that showed a significant inspiration execution gap (00:07:34). The goal is to understand how customers would use the service (e.g., for special occasions or daily purchases), the perceived value and trust in the influencer marketplace, and their needs and barriers related to trust and quality (00:08:49).\n\n* Customer Research Methodology and Focus The customer interviews will involve HelloFresh prospects actively engaging with food content on social media, using 30-minute interview slots for efficiency. The research will cover creator dynamics, cooking behavior, trust, vetting, accountability, and marketplace utility/workflow. Katheryn Eckles aims for a pilot by the end of the week, starting early this week. Ian Brooks confirmed the focus on prospects is for efficiency, as unmoderated results showed no major differences between prospects and active customers (00:11:02) (00:13:16).\n\n* Prototype Critique and Approach Annette MvdE presented the concept validation prototype, which was based on existing insights and secondary research (00:14:25). They explained that instead of a complete prototype, a pitch deck showing specific UI features will be used to guide conversation and answer research questions. They excluded a sign-up and storefront creation flow due to complexity and potential distraction (00:15:41).\n\n* Recipe Import Feature and Collaboration Melanie Schwindt inquired about collaboration with the cookbook team regarding the recipe import option (e.g., video to meal kit link). Annette MvdE confirmed connection with the DAU team, who has a strategist and researcher on their team, and mentioned that they are exploring reusing code from other teams, citing a specific initiative linked to Lisa Tupplot and Nikita (00:16:47).\n\n* Creator Onboarding Flow in Prototype Annette MvdE outlined the prototype flow: creators imagine scrolling through reels, seeing a CTA button to shop a meal kit, clicking through to a landing page, and then navigating to a page specifically for creators that briefly explains the platform idea (00:17:49). The flow then moves into features, starting with how creators would add recipes, either by importing existing content (URL, file upload, video) or starting from scratch using HelloFresh analytics/data for inspiration (00:18:55).\n\n* Ingredient Availability and Pricing Concerns Annette MvdE raised questions about ingredient availability, asking if they need to be in the warehouse when a recipe is published, and whether ingredients would need to be reserved for a specific time frame (00:21:27). Ian Brooks suggested testing the attributes of ingredients creators need to select (e.g., gram weight, form factor) (00:22:34). Melanie Schwindt and Linnea Siersma agreed that the ingredient selection interface should be intuitive, resembling online grocery shopping rather than internal specifications (00:23:38).\n\n* Creator Pricing Models Melanie Schwindt raised the need to determine the pricing approach, whether showing unit cost or a tiered pricing model (00:24:27). Annette MvdE questioned if the ingredient price would remain stable or change over time due to factors like shortages (00:25:27). Linnea Siersma suggested that ideally, the pricing should reflect the customer pricing as they build the recipe, acknowledging that subscription status and shipping costs will add nuance to the final customer price (00:26:20).\n\n* Core Pricing Approaches Discussion Ian Brooks proposed two core pricing approaches: one where HelloFresh charges a service fee and the creator sets the price to the customer, allowing them to determine their own margin; and a second model where HelloFresh sets the consumer price (cost plus) with a prescribed margin for the creator (00:27:15). Linnea Siersma favored the former model, seeing HelloFresh's role as offering its fulfillment engine as a service (00:28:26).\n\n* Tiered Pricing and Creator Incentive Sameer Doda compared the platform to the Amazon Marketplace, suggesting that high-following influencers should have flexibility in pricing (00:31:09). Sameer Doda proposed a middle path with tiered, cost-plus pricing (e.g., 80% premium cost plus for top tier, 30% for small following) to differentiate influencers and incentivize them to increase reach (00:32:08). Cole Banning argued against complexity, suggesting the incentive is simply that selling more equals making more money, and supported creators setting their own margins, comparing it to the Amazon Marketplace (00:33:06).\n\n* System Self-Correction and Pricing Testing Annette MvdE suggested that many pricing issues might resolve themselves, as high prices or low quality would deter buyers, making the system self-correcting (00:34:12). Katheryn Eckles asked if they should query creators about the potential pricing models, but Ian Brooks advised against it, stating their answer would only be \"as much as possible\" (00:35:24). Ian Brooks emphasized that the platform must align creator and HelloFresh incentives, initially giving creators a larger share of the profit (00:36:42).\n\n* Recipe Creation Workload and Quality Assurance Annette MvdE highlighted the need to show creators that building a recipe from scratch requires work and must be accurate for the meal kit format (00:36:42). Melanie Schwindt raised questions for Canada about the use of recipe cards, whether they should be printed or digital, and if technology like Concord should be used for translation (00:37:52). Annette MvdE mentioned exploring if the recipe card could be branded for the influencer (00:38:59).\n\n* Vetting and Quality Assurance Features Quality assurance features being considered include an AI tool to review recipes for issues like double ingredients or instructions, and the possibility of HelloFresh chefs vetting or even cooking the recipes (00:38:59). Melanie Schwindt suggested that \"vetted by HelloFresh\" could be a premium offering or incentive for top creators (00:40:03). Ian Brooks later suggested that vetting could become a paid service that creators buy to validate their recipe works for the meal kit format (00:41:05).\n\n* Managing Meal Kits and Creator Analytics The managing section of the prototype will explore offering creators opportunities to make more out of their content by creating menus or meal plans, to gauge if this is something they currently do or would be interested in. Creators are also interested in analytics like platform traffic, trends, and the performance and sales of their recipes (00:42:07). Annette MvdE considered starting with Shopify for analytics but decided it would be too overwhelming, aiming for the top-tier analytics tools creators truly need (00:43:13).\n\n* Customer Engagement and Community The engagement part of the prototype introduces features for customers who purchase a meal kit, allowing them to quickly create an account and engage with the creator via comments or communication (00:43:13). Ideas include having the community rate or modify a recipe, or the creator hosting live cooking events (00:44:19). Sameer Doda stressed that interaction would be highly valuable for influencers, and they might seek ways to increase customer feedback (00:47:43).\n\n* Prototype Concerns and Moving Forward Linnea Siersma expressed concern about moving too quickly towards building before establishing product-market fit, suggesting that testing multiple fake versions of the website to gauge stickiness might be more beneficial than building a fully functional prototype (00:51:44). Katheryn Eckles reassured that the designs are informed by initial creator feedback (00:53:07). Annette MvdE acknowledged the concern, noting the company's current focus on \"hands-on experiment\" over deep exploration and promised to discuss smoke testing and ABC testing possibilities with Andrea and Mark to address fears of a large, unsuccessful investment (00:54:57).\n\n* Final Sprint Planning and Recruitment For the final sprint, the team plans to finish the concept test research and provide recommendations, while continuing to act as a partner. Annette MvdE raised the critical concern of recruiting for the MVP, noting the need to identify who will drive this, involve legal for contract creation, and utilize existing relationships with chefs for the experiment (00:57:08). Melanie Schwindt noted that the revenue model will likely change over time, treating initial influencers differently, and that the model should not promise guaranteed income (00:48:47).\n\n* Influencer Onboarding Ownership Cole Banning noted that the ownership of managing influencers for the platform, including legal aspects and dealing with issues, needs to be addressed by Ian. Cole Banning's team can handle minor tasks, such as small tests with existing HelloFresh menu influencers who might be interested in migrating to the new program, but cannot commit to the broader influencer program without senior direction. Annette MvdE requested that Melanie Schwindt or Linnea Siersma bring this question to Ian (00:58:23).\n\n* Operations and Viability Update Annette MvdE inquired about the progress on the business case and operational side. Melanie Schwindt provided a brief summary, stating that they connected with the operations team and have a scrappy plan for fulfilling Minimum Viable Product (MVP) boxes. The Canada team will meet on Monday for a strategy brainstorming session to inform decisions on pricing and creator onboarding (00:59:29). Regarding potential test runs for influencers, Melanie Schwindt confirmed that influencers could buy their own meals, but the team needs to determine if a free test kit should be offered to everyone or only some people, as offering it to everyone would mean sending everyone free food (01:00:29).\n\n* Project Driving and Involvement Linnea Siersma expressed confusion about who is driving the different project pieces, specifically operations and marketing recruitment, and how to stay connected without overstepping, given that it is Annette MvdE's project (01:01:28). Annette MvdE clarified that the current structure is different from previous projects and they, along with the researcher Katie, are only owning the strategy side, with others like Wonderly, Samir, and Melanie Schwindt driving the tech, operations, and business aspects individually (01:02:29). Annette MvdE noted that they are not an expert in those areas and are willing to be included if needed, despite time zone challenges (01:03:25).\n\n* Moving Forward with the Project Linnea Siersma proposed that themself and Melanie Schwindt move forward at a pace appropriate for a Q2 test and keep Annette MvdE in the loop, allowing them to indicate if they want more or less involvement (01:03:25). Annette MvdE agreed with this approach, confirming that this is the new way of working, where everyone is encouraged to \"just run and make it happen\" (01:04:32). Annette MvdE also clarified that they believe the strategy team's role is primarily to help inform the MVP, which would have run anyway, to ensure they \"are not running completely against the wall\" (01:05:13).\n\n* Future Research Collaboration and Tech Alignment Melanie Schwindt informed the team that the Canada team’s strategy working session on the vision might generate specific topics that would require Annette MvdE's team's support for research (01:05:13). Annette MvdE acknowledged that the director, Mark, or research lead, Andrea, would have to decide if they continue supporting this work or move to other roles, such as the loyalty team (01:06:09). The team also discussed the need to align on tech deliverables—specifically, what will be built and when—to ensure clarity on operations and strategy adjustments (01:06:55). Katheryn Eckles suggested that future research needs would be based on the clarity of the strategy and confirmed that they could advocate to stay on longer for research support if clear needs arise (01:08:38).\n\n\n\n\n\nSuggested next steps\n\n* Shay Obaidullah will read the research plan again and add any additional comments by the end of today so Katheryn Eckles can incorporate them before the pilot tomorrow.\n\n* Annette MvdE will talk to Andrea and Mark about the possibility of implementing smoke testing and other options to quantify the product's resonance with customers and creators.\n\n* Ian Brooks will take an action from the Canada side to build out the core pricing approaches with numbers.\n\n* The group will figure out who will drive the topic of recruiting for the MVP (MVP squad, operation, or business side).\n\n* Melanie Schwindt or Linnea Siersma will provide guidance on what attributes of an ingredient should be selected by the creators, based on what would feel intuitive like an online grocery store.\n\n* Annette MvdE will talk to Mark or Andrea to figure out how Annette MvdE and Katheryn Eckles can help the Canada team on the path forward, especially with research support for specific topics identified in the strategy working session.\n\n* Kathryn Eckles will work with Melanie Schwindt and Linnea Siersma to figure out what kind of research is needed and bring that to Mark and Andrea to advocate for staying on longer to help derisk the project.\n\n* Melanie Schwindt and Linnea Siersma will move forward at an appropriate pace for a Q2 test and keep Annette MvdE in the loop regarding their involvement. Test\n\n\n\n\n\nYou should review Gemini's notes to make sure they're accurate. Get tips and learn how Gemini takes notes\n\nPlease provide feedback about using Gemini to take notes in a short survey.\n\n📖 Transcript\n\nDec 4, 2025\n\nInfluencer MP Sprint Review - Transcript\n\n00:00:00\n\n \n\nAnnette MvdE: So I'm going to share um the link to our document. You can all follow me there. Um but I will also at some point like share my screen uh because I think this is like easier for everyone. Um so thank you for being here. We have a little bit like one or two new joiners here like Shay wanted to be part which I'm excited that you are here as well. Um, as I said, like I'm excited that Cole um was able to join here very short notice um because like I wanted just to raise the topic of the recruitment for MVP and since he's like um coming from marketing um we can ask them questions here as well. I want to make it happen that we're going through everything in 60 minutes so I'm time boxing a bit. Um we have time for questions in between. Um, but just let uh I'm going to push you a little bit here and that we go through every section in time. Yes, Ian.\n\nIan Brooks: A and I'm even going to try to be shorter than 60 minutes because unfortunately I'm double booked at uh in 27 minutes from now.\n\n \n\n \n\n00:01:04\n\n \n\nAnnette MvdE: Oh, no.\n\nIan Brooks: So I will we go 45 minutes.\n\nAnnette MvdE: We But we recording so you can We push through.\n\nIan Brooks: I'll I'll I'll probably be able to stick for 45. Yeah, I'll ask fewer questions.\n\nAnnette MvdE: Yeah, we push through. Okay, let's get started. Perfect. Um so sprint review is today. Um we were able like what we want to talk today is like about the creators like the last expiration like the status we have today um and the plan for the next validation round also from the customer size expiration state and uh we plan to go even deeper like on some um gaps that we see. I want to show you the prototype that we want to use for the um validation test. we have first draft. Um, and I just want to get your feedback on some things before we just make it yeah the last pieces put putting the last pieces together and then most important like planning for next sprint because it's the last for this year. Um, we will have time in January.\n\n \n\n \n\n00:01:56\n\n \n\nAnnette MvdE: Uh but still there's some stuff I want to talk to you and I will hand it over directly um to Katie for the first section of the creators.\n\nKatheryn Eckles: Awesome. Yeah. Um, Annetta, did you want to share the screen or I can share for this bit?\n\nAnnette MvdE: I can do it.\n\nKatheryn Eckles: Okay. Awesome. Um, so I want to start off talking very quickly about the research that we're we're doing currently and what's upcoming in terms of research. Um, so starting off with the creator research that we've been doing. Um, we have five interviews completed. Um, and we've had a a mix of sizes of creators and their backgrounds and all of that. Um, with some having like 34,000 followers up to like 1.2 million. Um, and we're pretty finding pretty consistent insights across all of them. Um, there are some slight differences like in terms of vetting expectations or compensation expectations. Um, but overall their mindsets around it and things like that are are pretty consistent. um their evaluation of the of the um concept is is is very consistent.\n\n \n\n \n\n00:03:06\n\n \n\nKatheryn Eckles: Um so uh from here we're we're going to uh kind of transition into really focusing in on those um cookbook authors and those higher um higher level kind of influencers. Um, so last week we had one who um had or actually it was Monday. Um, we had one who who was a cookbook author and chef and had a larger following. Um, and we did kind of probe a little bit deeper into like how she would work with cookbook recipes. Um, and she really saw like no conflict there in terms of like using her cookbook recipes um, and listing those as recipes on this platform. um and she really thought of it as potentially good exposure um for her cookbook. Um her cookbook was a few years old, so she thought it might be a good thing there. Um and she was pretty aligned with the compensation expectations that we'd have of it being like um a commissionbased like share of of sales. Um and uh we probed in a little bit with her about trends because that was a bit of a conversation in our last sync that we had um of like how much these influencers are kind of relying on trends.\n\n \n\n \n\n00:04:20\n\n \n\nKatheryn Eckles: And for her um she really talked about using trends only as like when they really resonate with her and when she can put her own twist on them. So, I think um continuing on with these interviews, we're going to try to probe into that a little bit more and get that better idea to see how trend reactive these folks are. Um to to see if we're just going to get a bunch of trendy recipes that need these specific ingredients or if it's going to be a a people only really hopping on these trends when it's like something that's going to be really important for them um and resonate with their audience and their content. Um then in terms of the vetting um she kind of sees this as um both HelloFresh vetting approach um there's value in HelloFresh vetting these recipes um but kind of approached her with this Amazon style um marketplace approach to see how she would kind of react to that as an option um and kind of recogni in that she recognizes that customers may not really fully understand um that HelloFresh isn't vetting those recipes um and may still blame the the marketplace um for bad recipes or the creator.\n\n \n\n \n\n00:05:29\n\n \n\nKatheryn Eckles: Um and definitely feels like we need those types of, you know, reviews and ratings and things like that to really um ensure that that things will be um at least ensure that they're they're clear on the quality of of the meals that they'll be seeing. Um and from her um she was really interested in things that we've seen from other creators as well. um data on what users are interested in like um dishes, popular ingredients, um choosing recipes based off of how long it takes to cook um and what people are searching for, things like that. And then also some some traffic data um to understand how much uh traffic she's bringing in, how much traffic there is on the site in general, things like that. Um then for next steps with these interviews, um there's we're going to be moving next week into concept validation. So we're at a point where we feel like we are getting pretty consistent insights. Um and we'll continue to kind of probe into some of the spots where we have some open questions or want a little bit more data.\n\n \n\n \n\n00:06:32\n\n \n\nKatheryn Eckles: Um, but we're gonna transition the the um interviews into focusing more on looking at some of the concepts that we have so far and getting some um deeper insights into how they see this working. It'll kind of put them into a different mindset as well when they're seeing what these this um platform will look like, what features it'll have, things like that. Um that we can get more um uh detailed uh feedback from them. Um, and so recruitment for this is is still ongoing. Um, it takes a little bit longer with with the influencers since we're emailing all of them and all of that. Um, and currently we're focusing on those larger influencers. Um, and we have the option to reach back out to a lot of the influencers that we've talked to already. They were all um, open to coming back and looking at concepts. So, if we're in a pinch and we need to reach back out to them, um, we'll be able to do that as well to at least get their eyes on and their feedback on some of the concepts now that we have them ready for them to look at.\n\n \n\n \n\n00:07:34\n\n \n\nKatheryn Eckles: Um, and so the the outcome for the concept evaluation stuff, we're going to be really hoping for some stronger indicators of desiraability of this concept now that they see it. And then also prioritizing any kind of features or must haves there um that they would would need. Um, and also hopefully, um, it'll trigger some thoughts in terms of what what is missing, what what they like, what they don't like, and and anything that might bring up any concerns or anything like that for them. Um, and then, um, Annetta will share the prototype with you, but um, I I'll open it up to some, um, questions before, uh, we move on to our next phase of research.\n\nIan Brooks: 100.\n\nKatheryn Eckles: Any questions? Okay, I'll I'll move on to our next phase of research that we're going to be starting. Um, so uh we're going to focus our next phase on some uh customer interviews. Um, we already have some first signals from the unmodderated test that we've done and um, we did a quick survey. Um, and we're pretty clear on this significant inspiration execution gap um, with customers cooking behavior.\n\n \n\n \n\n00:08:49\n\n \n\nKatheryn Eckles: Um, and but we do see some gaps here still. Um, so there's a gap in understanding how they want to use this. um like what their behaviors are around um shopping for recipes online, how they're choosing influencers, things like that. But then also how would they want to use this service? Um would they see this as special occasions? What what meal occasions do they want to use it for? Um are is this something where they see themselves purchasing from this every day? Things like that. Um and then also understanding um the the focus on this like do they see value in this influencer marketplace? How can they work with this? What uh what approach do they want to have here? Do they feel like they trust these influencers? Things like that. Um and then another focus would be really on these needs and barriers. So um we've we have some understanding that we need to build and maintain trust here. Um, and with this, uh, influencers were seen as as reliable as traditional sources based off of our previous research.\n\n \n\n \n\n00:09:58\n\n \n\nKatheryn Eckles: Um, but there are still some barriers that came up in the research like um, recipe inaccuracy, um, some skepticism around like how are they making money? Are they just selling things to me? um and some fear of some social commerce scams, things like that that have really inhibited their engagement and um their their their purchase of the ingredients to make these meals. Um so for this, we'd really like to dive into trust and interest and quality needs. Um really understanding how they want to engage with this platform, what would make them feel more confident in engaging with this platform? And then also understanding their vetting expectations. Do they just automatically um assume that that we're going to be uh vetting all of these recipes? Um if we're not vetting, what would make them feel more comp confident in us not vetting these recipes? Um because from the influencer side of things, we have that assumption of what customers will feel, but we haven't actually asked them yet. So, we're going to get deep into that.\n\n \n\n \n\n00:11:02\n\n \n\nKatheryn Eckles: Um so with this um we're gonna talk with HelloFresh prospects um with the efficient inspired profile um that are actively engaging with food content on social media. Um and we're going to try to do these in 30 minute um interviews just so we can fit fit them in in and get through them pretty quickly um so we can get insights and be able to take action on those. Um and so the recruiting will start um next well starting early this week but um I'm ideally wanting some kind of pilot by the end of this week so as early as tomorrow. Um and the research focus here um again is going to kind of look at creator dynamics and cooking behavior, trust vetting and accountability and then the marketplace utility and and workflow there. really understanding how they want to how they currently save and plan and and use all these things and then how we can create tools and reminders, things like that to really help them um use this platform more efficiently. Um so again, with this phase of of the moderated testing, we're going to be doing this phased approach as we did before with the influencers.\n\n \n\n \n\n00:12:16\n\n \n\nKatheryn Eckles: So we're going to share out regular recaps at the end of each um interview day so everyone has all of the insights. Um and then based off of the learnings and feedback, we'll adapt the script um to get the insights that we need um to make sure that we're being flexible and and diving deep where where we see gaps. Okay, that was a lot of content.\n\nAnnette MvdE: Um yeah.\n\nKatheryn Eckles: Any questions?\n\nAnnette MvdE: Yeah. Sorry. I just wanted to also ask Chay because I saw your post on Slack um where you mentioned um that you're like deep in this topic right now as a product designer for the MVP. Is there anything like on your side at the moment like big questions that you have that you really like want to probe here?\n\nShay Obaidullah: Yeah, I just gave over a look over the research plan and it looked like it would be very helpful for what I was working on. Also, um I saw the request was by end of day yesterday, so I didn't want to add too much, but if it's okay, I'll give it another read and see if there's anything additional.\n\n \n\n \n\n00:13:16\n\n \n\nKatheryn Eckles: Yeah, for sure. Add add in comments. Um I'm as as long as they're done by end of day today because I'm going to try to get a pilot going tomorrow.\n\nShay Obaidullah: Okay.\n\nKatheryn Eckles: Um so as long as I can like incorporate those things um before that tomorrow, um I think that'd be great. Awesome.\n\nShay Obaidullah: Good. We'll do. Okay.\n\nAnnette MvdE: Okay. Any any other questions, concerns, um things you want to uh raise here before we are like we are so fast today. Amazing. Um Ian, you you can still give your pieces.\n\nIan Brooks: one one thing to slow us down. Um, why HelloFresh prospects?\n\nKatheryn Eckles: Um so right now um we when we were looking at the unmodderated results where we did activives and prospects we um didn't see large differences in terms of um like reactions to this or differences in opinions um between those two groups. Um so thinking about trying to get this um research done efficiently, it it'll be faster for us to recruit just prospects.\n\n \n\n \n\n00:14:25\n\n \n\nKatheryn Eckles: um because of our our um base there. And if we're expecting the insights to be very similar between prospects and activives, then um we would just focus on that group. If you feel a strong um need for activives as well, we can add those in. It'll just add a little bit more time onto the timeline.\n\nIan Brooks: It's okay. All right. Understood. Thanks.\n\nAnnette MvdE: more practic practical reason I would say. Yes. Okay. Cool. Um concept validation prototype. I want to do a little critique here. Um we were um getting everything out from the insights that we heard so far from uh our um interviews. Um also like what we learned from the service and secondary research put them into a first flow. Um you can also like find them um on our myro board that I think is available to all of you. I will uh share the link um again if you want to. And from there we extracted like the the main pain point like the main features we want to highlight and we want to talk with the um with the creators about the critique and I want you to focus on what um is about the vision like the priorized features list that we are having in this test.\n\n \n\n \n\n00:15:41\n\n \n\nAnnette MvdE: Um is something missing? Do you find like something redundant? um then the level of detail, the red flags, anything that you see also the overall story line uh flow that we um guiding this person through. I don't want to critique at the moment the copy because we are still in work in progress with Ellison uh here uh since we work very very fast on these prototypes right now. Um also I'm excluding a signup uh flow and also like setting up a storefront page because this is very complex and might come later. So this is more like we decided to not do a complete prototype because in our experience from past projects um people get distracted seeing a button I don't understand this or why what is following here. So what we're doing now is um creating a pitch deck uh where we really like just show a UI um from a specific um feature and talking with the research questions um program uh um towards the the the questions we want to answer. Um Melanie Yes,\n\nMelanie Schwindt: Yeah, just a quick question.\n\n \n\n \n\n00:16:47\n\n \n\nMelanie Schwindt: Um, so I know in I'm probably jumping way ahead here. In 3.2, I know that you have like the import option from like video to meal kit or like from like link to meal kit. Are we talking with the team that's working on the cookbook and like sharing that development? Okay, great.\n\nAnnette MvdE: good questions. Um, this is the DAU team. Um, one of the, um, strategists in there and one of the researchers, part of my team. Um, this is why I'm also like connected with them. Uh we have also like just as that you know we have in our little um document here um a tab called other teams initiatives. So there are more teams like working on something similar that could be uh valuable uh to us. Um so at the moment I linked this to Zamir already um to talk with um um with Lisa Tupplot um that we can maybe reuse their code um also like for the other ones which Nikita uh told me some weeks back um this is why it's included here.\n\n \n\n \n\n00:17:49\n\n \n\nAnnette MvdE: Yeah, and it's also part of the prototype. Okay, I've put it in here, but what I could also do is like just open Figma file and walk you through. But ah no, let's do it here for the uh I think for the recording is easier. So um we have thought about multiple ways of like bringing this person into this concept and one idea was like writing an advertising video but then uh when we graded it we were thinking okay maybe this is like it's super hard what we know and maybe Cole knows more about this um to really grade something that is like then only going to food food influencer like advertising or any like kind of real. Um, so what I was thinking is, um, I want them to the alarm clock. I want them to imagine they're scrolling through their reels because we heard from many of them that they're getting inspired by looking at other videos. They're scrolling through the reels and then they're not using a cooking video from a chef, but also seeing the CTA button of like shop a meal kit.\n\n \n\n \n\n00:18:55\n\n \n\nAnnette MvdE: uh which is maybe something they haven't noticed yet like never seen this before and getting um curious about this and want to click on this and the idea is that then uh a page opens um a landing page opens from this cook um showing like their me kits their recipes that are purchasable. So when they see this, we want to probe them to click then on the for creators uh navigation bar which would open then um a landing page purely for the creators that explains very briefly like a elevator pitch the idea with the main features. This is the only screen that is still work in progress um because there's more like like from the from the content uh writing coming um to really like um yeah make this uh make this really understandable. Then we would go like uh normally like there's then a pause where we talk about like what they understood, what they liked and so on like this is um uh coming from research and then we would go into different kind of features. We would say like want to go from starting with the recipes and this might be very very simple that they understand would they like start with like group like with everything that they have already done like they have thousands of videos I don't know like they have great a cookbook would they rather start with something like existing or would they start from scratch um if they would start like from something existing we could like offer them\n\n \n\n \n\n00:20:24\n\n \n\nAnnette MvdE: um uh things like importing from social media the same that the AU team is currently doing of like with the URL thing or like just uploading a file like a PDF or a document or even a video uh where we could just directly distract the information to already like fill out this me kit card of the things that we need in order to make it super easy for them. Samir make it happen. I think this is uh at the moment this might be the critical part. If they would start not from uh like if they want to start from scratch would be interesting if they even would consider to use our platform for this like if they need inspiration from maybe our analytics that we see like trending recipes or ingredients on the HelloFresh from the HelloFresh um data that we have um that they can look at or if if there are other things that they might be interested in. Um there is the question on um like how do you even start like uh with the recipes? Do you search first for ingredients?\n\n \n\n \n\n00:21:27\n\n \n\nAnnette MvdE: Are there are they available in the HelloFresh assortment? They could search for example for chili pepper and see that there are types available. What kind of information is uh needed for them? We heard a lot about quality towards ingredients. My biggest question here for operation later is also like in the future how could this even work with saying like they're planning something they would add something to their recipes but the moment they publish this and make this pursuable I guess we need already like the ingredients like in the warehouse. So I'm not sure do you reserve it for a specific time frame already um for ones that are not available can you request them and so on and in the testing here we just want to find out how they think about this do they think about costs uh because like ingredients cost money and in the end this mikit will um like be cost factor and they need to make sure it's like from our experience we can give this or normally a a meal serving would cost this and this and this uh Make sure to not go crazy here.\n\n \n\n \n\n00:22:34\n\n \n\nAnnette MvdE: Um, so just wanted to bring this in here. Yes, Ian.\n\nIan Brooks: I really like the idea. Um, I think the uh you should test what attributes of an ingredient you are going to want uh your creators to be able to select from.\n\nAnnette MvdE: Mhm.\n\nIan Brooks: Okay. Um, so for example, do you talk about gram weight? Do you talk about like form factor? Do you talk about um various things? Right. And I don't know between Mel or Lineia if they can give a little bit of guidance on, you know, this is what like a spec looks like for ingredients and maybe these are the three to five things that we think would translate to uh what a creator thinks about and what we could then use.\n\nAnnette MvdE: Yeah.\n\nIan Brooks: You know what I mean, Mel? like something from our our spec sheets or something like that that that allows somebody to say because if I see chili pepper here, do I mean a chili itself?\n\nAnnette MvdE: Heat.\n\nIan Brooks: Do I mean flakes?\n\n \n\n \n\n00:23:38\n\n \n\nIan Brooks: Do I mean, you know, what volume if it's packaged?\n\nAnnette MvdE: Yeah.\n\nIan Brooks: What size if it's a raw ingredient?\n\nAnnette MvdE: Yeah.\n\nMelanie Schwindt: Yeah, we'd probably need to like translate the ingredients in SPS to like what do normal people understand ingredients to be?\n\nLinnea Siersma: Well, I think yeah, I think it should feel like a grocery store. Um, because that's like the most like I think we should start with what is the most intuitive for the creators, which will probably look like online grocery shopping and then we can always modify ours to get there.\n\nMelanie Schwindt: I\n\nIan Brooks: Yeah, 100%.\n\nAnnette MvdE: Yeah.\n\nLinnea Siersma: I wouldn't use I wouldn't use like what it looks like today.\n\nIan Brooks: You're right.\n\nLinnea Siersma: Like I would I wouldn't want them to see what CPS looks like. That's for sure. Uh I would I would say like what what is the best way for them to you know grocery\n\nIan Brooks: But you're right. Steal Instacart's interface or steal like PC Express's interface or somebody like that as an\n\nMelanie Schwindt: Yeah.\n\n \n\n \n\n00:24:27\n\n \n\nAnnette MvdE: I was I was trying to to talk with the designers on the operation team but everybody is on vacation or not replying.\n\nMelanie Schwindt: And I think we were talking\n\nAnnette MvdE: I'm super happy if someone like me if you you can provide me just like an understanding how it's looking today in the for the for the recipe grade and HelloFresh uh when they're creating but it sounds already looks very different\n\nMelanie Schwindt: Yeah. And I think that it also like we started having a discussion with Jessica on pricing yesterday and I think we need to understand like what our approach is for the pricing piece. Um yeah because I I don't think we've decided on like do we actually show them like 250 per unit or 175 per unit or do we like do like a tiered pricing of like you can have x ingredients for this price and then if you want to add more it costs more. Like I think we need to understand how we approach that.\n\nAnnette MvdE: H not per me kit but more like in the amount of I want to serve five 5,000 uh from 5,000 me kits or something like that.\n\n \n\n \n\n00:25:27\n\n \n\nAnnette MvdE: Um yeah interesting this good to know. Um, I was even not sure if the price would change. Like if I create a recipe like this in a draft and then look at this in three weeks and open it and see then if I would publish it now, would the price change dramatically just because of a shortage or I don't know what's going on then? Um, is this a thing to think about or would you would we still try to give them just a like a stable price all the time and then we have to cover the costs?\n\nMelanie Schwindt: Yeah. Yeah. Like we do I think quarterly static pricing updates and so we would have to figure out how that looks for the creators. Um, and I think that's where like if we can remove some of the visibility to the creator, like I I feel like if we give the creators visibility to every skew and its cost, then we're opening ourselves up too much to them. Um, so yeah, we're trying to figure out what our strategy would be there.\n\n \n\n \n\n00:26:20\n\n \n\nAnnette MvdE: Okay. Okay. Cool. Um\n\nLinnea Siersma: We we also just like ideally the way that we're building this building this is that it the the pricing reflects the customer pricing as they're building it so that they can like feel confident in the product. But there's going to be some nuance there. Like if somebody purchases the creator recipe through and has a HelloFresh subscription, it might be cheaper versus if they don't. If they get one box, it'll be and they pay $10 of shipping on it, then that will be more expensive than if they get multiple. We probably also want to test like um some sort of like not subscription but membership where you get free shipping through the creator marketplace, which will also affect costing. So, I don't I don't know how to wrap my head around what we price the ingredients at if we want it to reflect like the customer price given that there's going to be a lot of like nuance on what that price looks like at the end in the end state.\n\n \n\n \n\n00:27:15\n\n \n\nLinnea Siersma: Maybe it's just Maybe that's not that hard. Maybe it's just the before shipping cost is what shows up here.\n\nAnnette MvdE: Yeah. Um I think for the creators is one one part but in the end I think this the test is also like towards them the customers like what that they even willing uh to pay for this or if they're willing to even subscribe to a marketplace like that. Um because there's lots of things they find or the meal people creating meal plans from dietitionian chefs or I don't know. Um this is what we want to find out also like to the customers. Yes. In.\n\nIan Brooks: we should consider two core pricing approaches. So there's lots of detail obviously to work through um but there's one price approach here where we charge a service fee and we let the creator set the price to the customer.\n\nAnnette MvdE: Ah. Mhm.\n\nIan Brooks: and there's another model and so they can set their own margin and we just charge a fulfillment fee, right?\n\nAnnette MvdE: Oh, interesting.\n\n \n\n \n\n00:28:26\n\n \n\nIan Brooks: And there's a second model where we set the price to the consumer in some respects or it's it's effectively like cost plus with a prescribed margin to the creator and creators may be able to earn their way into\n\nAnnette MvdE: Mhm.\n\nIan Brooks: higher margin tiers, right? So you think about like with Uber drivers for example, a diamond driver gets a higher per kilometer payment than a new driver.\n\nAnnette MvdE: Yeah.\n\nIan Brooks: I know this because my father-in-law was an Uber driver for 5 years. Um and uh so we want to think about probably validating both models and or or working through them. Exactly Samir. So because you want to have incentive for people to get to higher levels to earn more, right?\n\nLinnea Siersma: I I think that yeah I think my inclination is towards the former approach because like at the end of the day\n\nIan Brooks: But then also if they can price it themselves like that also like in both ways what we want is the creator should have the incentive to sell more through the platform.\n\nLinnea Siersma: why are we doing this and it's because we're taking the piece of our business that is like a unique strength to us which is like cold chain final mile fulfillment and having like a portioned ingredients meal kit, you know, engine and we're offering that as a service just like Amazon offers like AWS as a service that makes more money now.\n\n \n\n \n\n00:30:07\n\n \n\nLinnea Siersma: So, if we're taking that piece and we're actually just charging for that piece, I think the the former model makes sense. And then to your point, Ian, like how do we encourage people to sell, the other way that we can approach that is like as you like the more successful you are on your own creator marketplace opens up the ability for your your recipes to be featured in the HelloFresh menu, which then amplifies the like the reach of those recipes, which means you can make more affiliate dollars because it ends up on our page. So that's the way I I think we manage like encouraging good work is by by having giving them more opportunities to make affiliate dollars if that makes sense. Just like you can get ads on YouTube if you get enough views, you can get, you know, put on our our main recipe page if you have enough sales.\n\nSameer Doda: Um I would look at it a little differently though because I would compare it to Amazon marketplace rather than AWS because we're not just offering our ops uh to these influencers.\n\n \n\n \n\n00:31:09\n\n \n\nSameer Doda: We are actually offering them a customer base and a marketplace. So uh that that and which is why even if you look at let's look let's take a look at any product at Amazon marketplace right there are products which look almost exactly identical and sometimes are the same perform the same function but there are brands which are reputed brands which have a lot of ratings on Amazon marketplace and when then then they sell those products they charge a premium over some of the other uh some of the other sellers who are selling similar products right achieving the same outcome so in this case as as well because we will have a lot of differentiated um influencers. Some have very large followings, a lot of large fan base. They should at least have the flexibility to charge a little more than the other ones. Now, but I do also get your point of view. So maybe what we can do is that we can find middle path where we can actually have a little bit of constraint. We cannot just leave it as an open field on allowing influencers to charge whatever they want.\n\n \n\n \n\n00:32:08\n\n \n\nSameer Doda: Instead we could have a few different uh pricing tiers where we do still do cost plus but we when we do cost plus we do a premium cost plus for these very high following influencers where you know where we let's say charge cost plus I don't know 80%, for medium tier we charge cost plus 50%, and for influencers with very small followings we do cost plus 30%. So that is still a way to differentiate between different levels of these influencers while still a giving these um influencers some incentive to kind of increase their reach and b maybe also giving them alternative parts on how they can get to that premium tier even if they do not increase their reach on their own influencer platforms. If they are able to somehow sell more on HelloFresh that could be another path for them to reach that premium tier within the HelloFresh marketplace.\n\nCole Banning: I was just going to say like to me the reason to increase your reach is just we have a model that pays out money and you sell more and then you make more money.\n\n \n\n \n\n00:33:06\n\n \n\nCole Banning: Like the extra complexity for me it feels like it's creating complexity when you don't need it. It's like I want to we have set up a model where they are paid sufficiently if they sell 10 but now they want to sell 100 because they will make more money. And I also think them being able to set their own margins is important because yeah, a top tier influencer should show I don't know like Gordon Ramsay should come in with a high margin product. That's what he would want. Um and for us to like involve ourselves. It's the same like it's Amazon. If you put a a product on Amazon marketplace, you set your own price, you set your own margin, and then you win or lose, and you scale based on the economics of the product that you've put on there.\n\nIan Brooks: all of this. Yeah, I think I think if if I were to try to synthesize in the uh interest of moving here, um I think that we probably need to so we need to take an action from the Canada side to build these out with numbers.\n\n \n\n \n\n00:34:12\n\n \n\nIan Brooks: Um, and then from the product and development side, I think we probably need to build for flexibility right now. I don't know. Annette, what do you think?\n\nAnnette MvdE: I just wonder like I think I put this already like in a select channel um last last time. Uh if most of the problems will like solve themselves over time. The same what Cole me means with the marketplace in Amazon. If you put a very high price on your M kit, this is like the double of what others give people buy it or know. um they will comment it um to say like this is very expensive, this is not worth the price and then this person has a problem. Um if the quality is s***, people will not buy it, bad ratings, they not make money the moment they not making money like it's not working for them anymore. Um, so I see it more like that the system clears itself but giving them the option to do whatever they want. And in the end like the recipe from my opinion is not worth anything.\n\n \n\n \n\n00:35:24\n\n \n\nAnnette MvdE: It's all about the person behind that like makes the marketing like shows them everywhere and people are excited about this person and this is why they want to buy it in the end. um and less about what we have as uh like solving a problem for people who are having a like this mental load issue and saying like I just want not to think about this and like getting great recipes each week. Um it's just like a I think like a different perspective here from the people coming from these influences.\n\nKatheryn Eckles: Um, with all of this pricing stuff, would it be helpful um to query our uh creators that we're talking to about some of these potential models? um or is this something that we don't really care about the influencer like p perspective on this or is this something where it's like if we pose maybe a few models or um get their expectations around the pricing structure um would that be helpful Oh,\n\nIan Brooks: I think we don't. If you go and ask 10 influencers how much money they want to earn, their answer is just going to be as much as possible.\n\n \n\n \n\n00:36:42\n\n \n\nIan Brooks: I think it's on us to create something that aligns their incentives with ours. And then over time, and it's going to have to start out with they're getting 80%, we're getting 20. And when we get bigger, the pie will get bigger, but also our share of the pie will get bigger. But like all of these things, the platform has to have scale before the owner of the platform can greedily grab all the money.\n\nKatheryn Eckles: for sure. Okay, I I won't probe too much on it then with influencers then and and then if we do see a need for it though at any point, just let me know and we can kind of pivot\n\nIan Brooks: Yeah. Okay.\n\nAnnette MvdE: moving on quickly. Um the last part here is just to show them that there is still like when they start from scratch and not having a video or anything, there is work to do and they have a lot of they have already a lot on their plate with the video editing um what they're currently doing. So just showing them that there might be like work to do things to make this recipe really accurate in a specific format that we want from them.\n\n \n\n \n\n00:37:52\n\n \n\nAnnette MvdE: Um just to see like their reactions. Yeah, Melanie.\n\nMelanie Schwindt: Um, quick question. So, on both the um cookbook as well as like if they're making something from scratch, um, and this might be more of a question for Canada. Um, do we envision having recipe cards? Cuz I would say like that's not something currently that is a function in the cookbook. Um, and then like that would be something that like do we use Concord to translate the recipe instructions into recipe cards? Do we pivot to fully digital recipe cards with like videos? Like because there will be videos like I'm not sure what the So maybe this is more just like a question for Canada and we could talk about it. We're we're going to do a working session on Monday. Um\n\nAnnette MvdE: Yeah. Okay. Um this was also like something I think we talked about this as well when we heard from some influencers saying like um is this even branded for me? like there might be interest in um having something like printed out where it's just a little bit different template um and then the name of the influencer.\n\n \n\n \n\n00:38:59\n\n \n\nAnnette MvdE: Uh if this is like um we could also like yeah see if this uh is in the end like we just need to circle back to the digital world and I will show you in a minute what I mean by that. Um so one thing that we only wanted to uh put our fingers in is the quality assurance. Um like uh the level of security the creators will need. We heard already like that they want to make sure because they doing recipes they know how to do it but they don't know how to make me kids. This is a new area for them. So making sure like giving them something in order that they are assured that this is like that that everything is fine. Um we wanted to make this um in form of maybe AI or whatever you can do to just um when they finished the recipes that they can get a fast um reply on um you have a double ingredient here or there's um in the instruction uh some kind of tips that we can give them that are very easy to understand step by step kind of thing.\n\n \n\n \n\n00:40:03\n\n \n\nAnnette MvdE: anything we could give them. And on the other side, um talking about this vetted uh piece of that real chefs from HelloFresh would look at the recipes or even I don't know cook them. Um this depends also like on our capacity and on the money that would cost us. Yeah.\n\nMelanie Schwindt: Yeah, I think the the like vetted by HelloFresh would be like definitely something we should explore and like figure out what that looks like. I think that could be another like piece of like once you are a like top creator in our marketplace then like you can request or like we could potentially just like choose to vet certain things which then would also then give them more credibility. But like I think it's kind of that like incentive wheel of once they sell more and they're putting out more then like we can bet them so that they can make even more. So like it's another premium offering of it.\n\nAnnette MvdE: Okay. Yeah. Um and then managing the MI kits um offering um that they have that they can do more.\n\n \n\n \n\n00:41:05\n\n \n\nAnnette MvdE: Ian, you want to say for the last thing something?\n\nIan Brooks: Yeah, just on the vetting to be honest, I think that's something that in time a creator will need to pay for.\n\nAnnette MvdE: Yeah. Yeah, I think yeah,\n\nIan Brooks: That is a service that they can buy from us and we need a great name for it. place like you can fresh, you can cheffify it, you can something like that. All right, so just let's just put our creative hats on there at some point in time.\n\nAnnette MvdE: maybe even like the I mean a lot of the bigger ones or the chefs that already made their name. I don't think they need this uh so much, but maybe the smaller ones might need this more and they might buy something like this as a service to like to become bigger. Um because Yeah.\n\nIan Brooks: Yeah. Yeah. Absolutely. And the idea here is that you're testing, you're paying us to validate to test that the Exactly. that the recipe works for the meal kit format.\n\n \n\n \n\n00:42:07\n\n \n\nAnnette MvdE: Yeah. So the managing part is um as I said like make more out of your content. So you create maybe a recipe but you could also use this recipe and creating a menu with adding a dessert recipe. Um you could create a meal plan um for people who want to um um order already like a big box from us for the whole week. Um so giving them opportunities and understanding a little bit is this even a thing. Do you create meal plans? is do you create menus or do you concentrate mostly on small um easy to prep u recipes? Um also like the um watch your revenue grow and how your meals perform like understand like what is what are they interested in? We heard already like platform traffic um trends um and analysis pieces on the platform but also like maybe how how their recipes are performing um of course like their sales um in the past week, month, whatever. Um just understand a little bit more like what is really needed and what is nice to have and what is missing for them.\n\n \n\n \n\n00:43:13\n\n \n\nAnnette MvdE: Um I was also not sure like talking to Zamir if we would even consider like starting with Shopify in the beginning from technical environment because they have a lot of analytics but this would be way too overwhelming for most people. Um so really understanding like the the top tier analytics tools that they need um and not just nice to have is like yeah helpful. Yes, no problem Ian. And the last piece was the engagement part um like going into and saying like okay you can now engage with people who actually cook your meals because on social media I mean everybody is commenting everybody is liking or disliking but you never know like who this was and the idea is a little bit um that everybody can explore the marketplace but when you cook like when you buy something you you are able to create very fast an account like through Google or Apple whatever um and then you are able able to um to get more content um to comment uh uh u um uh communicate maybe with the influencer if they want to.\n\n \n\n \n\n00:44:19\n\n \n\nAnnette MvdE: Maybe even like there was an idea of like that the community is uh rating or like there's a poll happening where they can modify the recipe that this creator created and say like can we even swap specific things and then the creator can like create a second mit or what we do in HelloFresh already that the people can decide I don't want chicken I want uh beef instead for example. Um also like to provide more content. Yes, they will have already like a lot on their plate and the res like the videos they have would fit perfectly in our HelloFresh world where we could use even as step-by-step video where we can jump um uh on on the video uh like on a specific video step. Um, I was just thinking if there's interest on more content to create like tips and tricks, uh, cooking trips, uh, even like how to use a knife, whatever, like everything. Um, to like to make this commu, like to build up this community. um or even like creating this live cooking events of saying like you can buy my bo my meal kit and in two weeks there's this uh event happening where we cook together online uh and I share my tricks and tips with you um the same our grandmas did on TV back then I remember just a little bit more convenient and the last piece is just showing them like that this is a whole circle for the uh\n\n \n\n \n\n00:45:42\n\n \n\nAnnette MvdE: for their audience by having it like when they discover it online on their social media accounts uh clicking on a link seeing the MI kit purchasing uh the MI kit um it gets delivered to your home depending on MI kit card or not that there is like maybe with a QR code that they're going back to the content um having live sessions or other things that they can enjoy. We also heard that um it's like my concern is a little bit that the creator might think ah then my audience is only spending time on the marketplace and not on the not commenting anymore on social media. But I think for from what we heard it doesn't matter so much because most people even saving the recipes and not liking or commenting at all. So seeing like now people really like cooking them because it's super easy might be even like super enjoyable for them. I put the link for the Figma file in here as well. You can also leave comment there or just uh click on the image and then you can uh leave a comment if you feel there's something missing or um you see a red flag.\n\n \n\n \n\n00:46:48\n\n \n\nAnnette MvdE: Yes, Melanie\n\nMelanie Schwindt: I think that's definitely like the piece on like are they going to be commenting in the marketplace versus on like the actual post itself. I think that's less of an issue for Canada because we don't have a creator platform. Um so like in the US I know like creators do get paid based off of engagement on this like on Tik Tok or on Instagram I or maybe not Instagram but on Tik Tok for sure. Um, but in Canada they don't. And so I think it's less of a barrier in Canada.\n\nAnnette MvdE: But maybe then later for the bigger market internationally. Yeah. Yeah. Good point.\n\nMelanie Schwindt: Yeah. So it'd be probably something to flag more for like the US than for Canada. Actually, I don't know if it's I don't know if the US is the only market that has a Tik Tok creator platform or if there's other that do.\n\nAnnette MvdE: Uh yeah, I only saw like that the shop, the Tik Tok shop for example is not available in Canada but only like in a very like I think US and some other countries.\n\n \n\n \n\n00:47:43\n\n \n\nAnnette MvdE: Um because I ah yeah\n\nMelanie Schwindt: Yeah, Tik Tok shop isn't, but I know like Amazon storefront is available in Canada. So, like I think that this is very doable via like Amazon storefront, but yeah, we don't have Tik Tok shop.\n\nSameer Doda: I think on the on that last piece though on them commenting back, I think that is probably going to be one of the most interesting things for the influencers as well. And so they might actually ask us on what are the things that we can potentially do to increase that that interaction and you know maybe you know the ways in which we can nudge our customers uh if they've purchased a recipe to come back and provide some form of comment feedback which uh you know depending upon which market uh it might be ideal for them to actually go back and do it on the original content itself and that's what the influencers might prefer. And that kind of goes back to what have we been able to do so far to get feedback from our customers on our own HelloFresh platform for previous week recipes.\n\n \n\n \n\n00:48:47\n\n \n\nSameer Doda: We can look into some of the ideas that work there, but I definitely think that we need more\n\nAnnette MvdE: Yes. Yes. Yeah. As I said like if you feel there's a very important topic that we haven't catched here or um or we need to create something new just let me know. Uh we try to um go through the UX writing tomorrow and on Monday um to make sure everything is there and uh yeah is testable for that. Um this was also like a question that I just put in here for Melanie. Uh I was also like wondering during the testing if it would be even possible to make a live calculation for them with uh the creator on like what's the possible revenue stream like depending on the audience size. But I guess this is for later when um trying to get them on the platform um to like with a contract with everything.\n\nMelanie Schwindt: Yeah, I think that's like a Yeah, and I think that's going to like change over time as well.\n\nAnnette MvdE: Yeah.\n\n \n\n \n\n00:49:44\n\n \n\nMelanie Schwindt: So, like we're probably going to treat the first couple of influencers or whoever differently. Um, and then I think it'll depend on like potentially for like really big partnerships, we might have a completely different model than like people who are just signing up. And then I think similar to like YouTube, like I would probably say like 90% of people who post YouTube videos never make any money. Um, but like 10% of people make a lot of money. Like it's kind of a like I don't know that we want to promise people like, \"Oh, if you upload 10 recipes, you'll for sure make $100 because you might make zero.\"\n\nAnnette MvdE: Yeah, true.\n\nMelanie Schwindt: Um, and so I think that's like where our model becomes successful is that we don't promise that they're going to make any money.\n\nAnnette MvdE: Yeah. Yeah.\n\nLinnea Siersma: Um, just one thing I I don't know if everybody covered this, but are we planning on sending these different like you I don't know the right word for this cuz I'm not in tech, but like are we planning on sending versions of this to creators like to people to click through both from a customer standpoint and a creator standpoint to like test out different concepts and see if there's fit?\n\n \n\n \n\n00:50:50\n\n \n\nLinnea Siersma: Is that the plan with these\n\nAnnette MvdE: Uh so with with these this is just for the creators um just because um we're doing the the insights interviews with the with the customers but uh we had to decide at some point like what is the most important flow and from the customer side like the the flow of like purchasing from social media is not something super new. This is already like well known at some point. We also have a lot of data from HelloFresh site. So we were saying like influencer is completely new. We really want to like show them the concept like showing them some screens from the time that we have and like push more in this direction and the rest will uh come with the experiments like in the first MVP stream running. So this was for the for the for this you talking about this prototype here, right?\n\nLinnea Siersma: And then are we going to do like multiple versions that we send out to see which one is like stickiest or are we just sending what's the plan for that testing?\n\n \n\n \n\n00:51:44\n\n \n\nLinnea Siersma: for the creator. Yeah, exactly.\n\nAnnette MvdE: Yeah. So what we're doing is like having all of these features and then understanding afterwards that the we're not sure if we're doing card sorting exercise with them just to see like what is the main main important features for the vision later and what is the musthaves for the MVP right Oh,\n\nLinnea Siersma: Yeah, I'm a little nervous that we're moving quickly towards like building before establishing like fit. And so I know there's like I don't know as much about this world, but I would I would rather create like fake multiple fake versions of this website.\n\nAnnette MvdE: Mhm.\n\nLinnea Siersma: I know there's companies that do this where they can create like prototype that um and send them out and like see what's stickiest before like I go down the path of taking a picture of every ingredient and price and loading it in. Like I feel like it's a little premature for development um before we really like establish fit.\n\nAnnette MvdE: Yes.\n\nLinnea Siersma: and like things that I'm not sure about is like what level of detail is like the best for creators, what is the best like what you know all those different things because if it turns out that like no one wants to build a recipe on this then that just that changes the direction of the work quite a lot and I'm worried that like we're already building stuff and we haven't actually established that it will be successful.\n\n \n\n \n\n00:53:07\n\n \n\nAnnette MvdE: Uh, Kitty\n\nKatheryn Eckles: I just want to add a little comment. I think a lot of the things that Anetta has designed here are off of feedback that we've gotten from the creators initially. So, we came in kind of with like what were what are your expectations of this this marketplace? How would this function? What would you expect in terms of features? How would you expect to manage like um ingredients and things like that? And then those insights were used to kind of inform these designs. So, I think that's the approach that we've taken so far. And Anetta, you can speak more to it, but I just wanted to call in that like that this isn't just us like having an idea and designing something off of that, but it's designed off of the insights that\n\nAnnette MvdE: Sure.\n\nKatheryn Eckles: we're finding from the creators specifically.\n\nLinnea Siersma: totally. It's just it's just a it's just a it's just the interviews but not necessarily like mass testing just usability what it actually feels like.\n\n \n\n \n\n00:53:59\n\n \n\nLinnea Siersma: So, I just I'm a little bit It would be great to be able to like quickly pivot and try different versions. What I'm worried about is like pigeon hole ourselves into an idea that isn't quite right and then we like do all this work next year and it's like, \"Oh s***, this wasn't exactly what we wanted.\n\nAnnette MvdE: No, no, no. I get those. So there you can like of course we like we are now in the company in a phase where we're doing a little bit different approach from ways of working. We did this normally in the past with DXS doing six months of really like deep analysis and interviews and uh insights creation to really understand what what we're building but even then creating something experimenting with a smaller group. This is why we're doing this in Canada with a smaller amount of people to understand is this really successful or do we hold and or pivot completely. Um and here it's just like to really understand like what are the things that they really desire here to understand even in which direction the MVP would run.\n\n \n\n \n\n00:54:57\n\n \n\nLinnea Siersma: Yeah.\n\nAnnette MvdE: Um and there might be opportunities to always do like smoke testing on social media. um understanding like what a customer even more interested in something like this or that then we have some kind of ABC testing depending on the resources that we are getting um at the moment for us was told like\n\nLinnea Siersma: Yeah.\n\nAnnette MvdE: the project is ending at some point end of January February and then depending on how the experiment is going forward but I'm sure like we couldn't even think of something like how to experiment this even further like with Katie together like on the research side to give you something in your hand like to say like okay we don't want to run like super blind and just put all our eggs into one basket. Can we even do like an experiment for this and this and that um and include uh the research. My just concern at the moment is at the moment the company's direction is more hands-on experiment rather than explore very deep um what I yeah but this is always the case.\n\n \n\n \n\n00:55:52\n\n \n\nLinnea Siersma: Yeah, I think that's what's giving me a little bit of heartburn. Like what if no one likes it, you know? Like I don't know if we necessarily it's not it's not a um it's not a small investment from our side locally in terms of cost and resources.\n\nAnnette MvdE: This is always with the MVPs. Um, this is why we start small and then build it up and learn from the experiments.\n\nLinnea Siersma: And so like it would be interesting to see how this stacks up against other things that we could be doing. Um and so like if there's a way to actually quantify how much it's resonating for with both customers and and creators through like smoke tests and like quickly like stuff that doesn't work but at least gauges interest. I think an investment in that area is more helpful than necessarily like building out a fully functional prototype at this point.\n\nAnnette MvdE: Yeah, let me get this um also to Andrea and to Mark um to see what we can do here. like if we can blend something out that you can that we can do or if the Ian and everybody decided no we're not doing this that we still have like some options here like for your fears um that we can see yeah let me let me get this we are only having one minute left and I still wanted to talk about something um very briefly and this is why Cole is in the call as well so\n\n \n\n \n\n00:57:08\n\n \n\nAnnette MvdE: on our side for the final sprint because it's already like end of year and then this Christmas holiday coming Um Samir we talked uh about their uh design and tech like current status. We are planning on uh finishing uh the research part here with the concept test. Um also like to give the team the recommendations but also like as we heard staying as a consultancy the partner over time because we learned a lot and we can still like um give feedback on on many steps here. Um but also like my biggest concern since some weeks and I put this in a channel but I'm not sure if everybody saw it um is this how to recruit u for the MVP now like we need to start at some point figure out who to who to reach out. I talked to Marina Kramma some weeks back and she also mentioned that we have already relationships with chefs um that we worked in the past with that might be able to recruit them for this uh experiment um with a bigger name um but really understanding I think we need legal for contracts creation and this might take some time I just wanted to point it out because I'm not sure who would be driving this topic is this the MVP squad is it someone from uh operation and business side.\n\n \n\n \n\n00:58:23\n\n \n\nAnnette MvdE: Um, yeah. Cool.\n\nCole Banning: Um, my gut is Ian needs to answer this question and he's not here.\n\nAnnette MvdE: Ah, okay.\n\nCole Banning: I just like I'm it could be me and my team, but I'm not in a position to commit that without direction from someone senior to me. Um we will do like minor things like Annette we've already kind of flagged of like little tests on the HelloFresh um menu working with Lineia that are like pretests and maybe some of those people might be interested in\n\nAnnette MvdE: Okay.\n\nCole Banning: migrating to this program like they we did something with them as an influencer putting something on the hellish menu and then we tell them about marketplace and they want to try it. But in terms of like the real question you're asking, which is who's owning all of these influencers that we want to get onto the platform and test with and deal with legal and deal with their issues and all of those questions? I don't know. I think Ian has to answer that and then\n\nAnnette MvdE: Okay, Melanie or Lineia, can you bring this to Ian because I think you're too Thank you so much for that.\n\n \n\n \n\n00:59:29\n\n \n\nAnnette MvdE: And on the operation and viability side, um I'm also not quite sure what what is happening. I I hear you doing a lot of workshops and so in the in the background because we're having the Yeah, we are just working on the other side of the world. Um I was just curious to hear what you are doing right now like with the business case and uh on operation side.\n\nMelanie Schwindt: Yeah, just like seeing as we're over time, I'll give a 30 second summary.\n\nAnnette MvdE: Yeah.\n\nMelanie Schwindt: Um, so we connected with our operations team for the MVP. We have a plan for how we're going to fulfill the boxes. Um, at a high level. Um, we're going to do it in a pretty scrappy way to start. Um, and I think there's like a decent question mark around kind of like what the tech actually looks like and what the offering actually looks like. Um, that will help like inform some of these decisions. Um, yeah, we're going to meet um as a Canada team on Monday to go through like more of a like kind of strategy brainstorming session so that it can help inform some of those decisions as to like where\n\n \n\n \n\n01:00:29\n\n \n\nAnnette MvdE: Amazing.\n\nMelanie Schwindt: we're going on pricing, where we're going on creator onboarding, all of those pieces. So, um, we're connecting Monday to hopefully have a little bit more on that front.\n\nAnnette MvdE: Um, is there any um like specifically um I'm not sure if we want to maybe adding this to our test with the influencers. Um, if they want to have a try run like understanding how is this even looking like when I create this MI kit, do I get a test at home? This is even possible from your side um that they test the service before they uh commit or like start publishing their recipes.\n\nMelanie Schwindt: they could buy one of their own meals. I think it depends like like it's a yes for every option. I think it just like depends on what we're trying to do.\n\nAnnette MvdE: Yeah.\n\nMelanie Schwindt: Um yeah, like I think if they want to buy the kit to then make at home like we can figure that out. I think it just like do we offer that for everybody or do we only offer that for some people?\n\n \n\n \n\n01:01:28\n\n \n\nMelanie Schwindt: Because if we offer it for everyone, we're kind of just sending everyone free food.\n\nAnnette MvdE: for once.\n\nMelanie Schwindt: Um, yeah.\n\nAnnette MvdE: No, no, that's that's for sure. No, that's that makes sense. Um, just wonder like if like also I mean it's a fulfillment ask like just doing one one box off again and stuff like that. Okay, good. Um, yeah.\n\nLinnea Siersma: I guess like we're we're kind of feeling a little bit confused as to like we don't want to because this is like your project. We don't want to like overstep. There's a lot of ops work to do. There's some of this like marketing recruitment piece to do. How do we want to like stay connected through this? Because I'm kind of like toggling between like waiting and seeing what's coming next versus being like, \"All right guys, like I need a weekly everybody in a room like boots on the ground. Let's\n\nAnnette MvdE: Yeah.\n\nLinnea Siersma: get going on this.\" And\n\nAnnette MvdE: Well, I got\n\nLinnea Siersma: we haven't really jumped into that on our side because we I think we're just like I know you did a great job presenting like the Daisy in our original meeting, but I'm un I don't I don't know if I actually totally understand who's driving all these different pieces and how much everyone needs to be involved.\n\n \n\n \n\n01:02:29\n\n \n\nLinnea Siersma: Maybe that's not me. Maybe I should have read the DC, but you know, like do you want do you want if Mal and I like are starting to set up steering meetings around this project, do you want to lead them, attend them, be aware of them?\n\nAnnette MvdE: This is a good question because like at the moment like as I said like these kind of projects how like this is the first time the project is like that just saying um we normally like worked in a squad of shift strategists and researchers um creating all this and then connecting with tech to see is this even feasible can we operate something like that and getting business into to calculate everything and then we would bring this to like higher management and say like yes go or no go for experimentation and then we were off. Um so this time it's a little bit different. This is why I asked I think in the kickoff back then who's going to be driving specific things because I can't do everything being one person and Katie as a researcher.\n\n \n\n \n\n01:03:25\n\n \n\nAnnette MvdE: So this is why we are owning at the moment just the strategy side and having then on a tech side like Wonderly and Samir uh operationly was and business was at the moment like back then Melanie um to have them driving these pieces completely individual um because yeah as I said like I'm not an expert in this um I'm also having troubles with the time zones but if you feel um there's anything you need from my side as well like that I need to be included it um tell me I try to make it happen but I'm not sure if I would be the right person here as well because like I'm not an expert in there I can only talk about maybe strategy design and Katie on the research side what we heard so far so that's my Yeah.\n\nLinnea Siersma: Okay. So then why don't why don't we just like go with like why don't we just move forward at the pace we feel like is appropriate for a Q2 test and we will let you know what's up and you just tell us if you feel like you'd want to be more involved or less involved but we'll we'll just Mel and I will just kind of go like full steam from here on and keep you in the loop and you let us know if we've overstepped but I think we're kind of like tippy toeing a little bit and that's causing us to slow down and I didn't know if that was a real problem or a fake\n\n \n\n \n\n01:04:32\n\n \n\nAnnette MvdE: No, no. No, no, no, no, no.\n\nLinnea Siersma: problem I made up.\n\nAnnette MvdE: Not a problem at all. I think this is the new way of working.\n\nLinnea Siersma: Okay.\n\nAnnette MvdE: Everybody has just run and make it happen. This is at the moment.\n\nLinnea Siersma: Awesome.\n\nAnnette MvdE: I think the thing and I really like it's not my project. It's just like Mark came to me and said like, \"Hey, you can do it.\" I was like, \"Whoa.\"\n\nLinnea Siersma: Yeah. And we were we were kind of told like, okay, global is leading this and like we need to contribute.\n\nAnnette MvdE: What? No. Ah, yeah.\n\nLinnea Siersma: And so I think like that initial that conversation set us off on a point where we're like, okay, like okay, we'll wait for direction.\n\nAnnette MvdE: Yeah.\n\nLinnea Siersma: But now I think it's becoming more apparent for me especially that I have to like do some work here.\n\nAnnette MvdE: Yeah. But not good feedback. No, this is this is great feedback because I think this is the biggest issue specifically teams.\n\n \n\n \n\n01:05:13\n\n \n\nLinnea Siersma: So yeah.\n\nAnnette MvdE: We never work together. time zone issues. We're working on completely different continents and I only have one hour overlap with Katie for example every second day. So we have a lot of travels already.\n\nLinnea Siersma: Yeah.\n\nAnnette MvdE: But this is what I mean like please run alone what you need from us. Yes. But on the other hand it's your project in the end. It's Ian's baby and German's baby. So I hope just that we are helping to inform the MVP like the MVP squad would have run anyway.\n\nMelanie Schwindt: Yeah.\n\nAnnette MvdE: doesn't matter what we had had figured out. We only wanted to make sure that we do something and inform a little bit that they are not running completely against the wall. And this was this was more like where I was coming from.\n\nMelanie Schwindt: Yeah.\n\nAnnette MvdE: Yeah.\n\nMelanie Schwindt: Yeah. And maybe just to provide like a little bit of context as to so like for Canada, we're going to do like more of a strategy working session on like the vision.\n\n \n\n \n\n01:06:09\n\n \n\nAnnette MvdE: Okay.\n\nMelanie Schwindt: um which might have some things coming out of that that we actually like would love for your team to help support researching into more specific topics.\n\nAnnette MvdE: Yes.\n\nMelanie Schwindt: Um and so that was kind of where we were like do we ask them to do it?\n\nAnnette MvdE: Yes.\n\nMelanie Schwindt: Do we just ask our own team to do research? We were like what do we do?\n\nAnnette MvdE: could also be I mean we can talk about because in the end my my director which is Mark has to decide because he decides where I'm working with like do I go back to product design job and helping\n\nMelanie Schwindt: Yeah. Yeah.\n\nAnnette MvdE: at the moment like loyalty team next like there for me this is at the moment clear but I think this is a good conversation if you're saying like we're starting something like this and then we can talk I\n\nMelanie Schwindt: Yeah.\n\nAnnette MvdE: can talk to to Mark or Andrea who's the lead on the research side to figure out like what are what planned for us because we have not much control about that at the moment and uh how can we\n\n \n\n \n\n01:06:55\n\n \n\nMelanie Schwindt: Yeah.\n\nAnnette MvdE: help you uh on the right forward? Yes, Katie.\n\nMelanie Schwindt: Yeah. And then I think involving like tech into that as well as to like when do we like to Lia's point earlier, when do we start telling them to build something and like how confident are we that like we're\n\nAnnette MvdE: Yes.\n\nMelanie Schwindt: ready to build that thing or is it going to change?\n\nAnnette MvdE: Yeah. But at the moment I mean the tech team is already starting right like they are investigating in the back end um looking like Zamir and Nikita and Warly they're looking into like how to start something like let's just\n\nMelanie Schwindt: Yeah.\n\nAnnette MvdE: put the MVP for the first MVPs and then I think they have some time for the iterations on whatever we learn and because we have a path forward with the vision of saying okay now we include this feature and see what happens now we get more control and then we see what happens.\n\nMelanie Schwindt: Yeah.\n\nAnnette MvdE: So this is like incremental testing, adding a little feature again and make people happy and testing um the way forward.\n\n \n\n \n\n01:07:49\n\n \n\nMelanie Schwindt: Yeah. And I think it would just be great to like make sure we're all on the same page about like what are we where are we starting with the tech and like what is going to be delivered when I\n\nAnnette MvdE: Yeah. Yeah.\n\nMelanie Schwindt: think is probably helpful to then like if we need to reshape our ops or reshape our strategy we're like all on the same page about that.\n\nAnnette MvdE: Yes. This good. Yeah.\n\nMelanie Schwindt: Yeah.\n\nAnnette MvdE: Um normally what what we most of the time did and this is I have a meeting with Nikita he's back from parental leave um because I talked with SI a little bit about this to ask like what do you want from us in the end like is it just recommendations is it more um is it screens anything like normally after this project we would recommendations but we did did with the tech teams together like eye score for example to understand like what is the the most important features from MVP to vision um how is it. Yeah.\n\n \n\n \n\n01:08:38\n\n \n\nAnnette MvdE: How are the incremental MVPs in between um the the major plan actually like for everything and I think we have like after the next interviews we have more uh insights around this that we can build this plan together with tech. Uh but tech has to like inform us about like is it even feasible? What can we do? When can we do it? Um and we can only like recommend what is highest desired what is less desired. Um and then I guess like business like the business perspective comes in here as well for this plan. Yes.\n\nKatheryn Eckles: Yeah. Um, I just want to jump in and say, um, with like upcoming research, especially as you're kind of like getting clear on like your strategy and the questions that kind of come up there, um, there might be like often we make like prioritization decisions and things like that based off of like how much work is needed in a space. So, if you guys become clear on like, oh, we need testing on all of these things, we need clarity on this, that, and this.\n\n \n\n \n\n01:09:36\n\n \n\nKatheryn Eckles: um we're going in this direction and we have no idea in terms of research. There might also be things where maybe Anetta is done with the strategy bits of things, but I stay on as the researcher helping you research these things for a little bit longer. So there's there's things that might happen in that context as well. Um where we can potentially still support, but I think a lot of the decisions on our team tend to be made based off of like um the clear need in in that space. So, um, if if you kind of have your strategy decisions and you're communicating with us of like, okay, this is where we're going, and then we can inform you, okay, we don't have, you know, clarity on these parts, those parts, and those parts. Do you want research on that? And then we can work together and kind of figure out what um kind of research is needed. And then we can bring that to Mark and and Andrea and and try to advocate for me staying on a little bit longer to help um kind of derisk this.\n\nAnnette MvdE: Yes, yes, yes, yes.\n\nKatheryn Eckles: So,\n\nAnnette MvdE: Uh I don't want like I I'm not ending this project and saying like goodbye and leaving you with this. we will find solutions especially when you're reaching out and saying like we want these tests because as I said like at the moment in Berlin the new way is just roll out each week new things not testing them before or exploring them and here it was a little bit different but I feel also like talking to a lot of you you have actually like your desire is like to get more clarity on here and do maybe more testing and if this is um if this is okay with Mar and um Andrea\n\n \n\n \n\nTranscription ended after 01:11:36\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.\n\n\n============================================================\n## EMAIL CONTENTS\n============================================================\n\n============================================================\nEND OF RAW DATA\n============================================================\n\nInstructions for Claude Code:\nSynthesize the above into AI_Guidance/Core_Context/YYYY-MM-DD-context.md\nIMPORTANT: STRICTLY IGNORE any content, meeting notes, decisions, or updates dated before 2025-06-08 (6 months ago).\nExtract: Key decisions, action items, blockers, metrics, important dates (only recent).\nFormat: NGO-style bullets, structured sections\n============================================================\n## JIRA UPDATES (-12h)\n============================================================\n\n[PA-25539] ACT-T-55 | Loyalty Program Metric relationships (Status: Backlog, Priority: Normal)\n[PA-25345] Loyalty | Opt-in dashboard | Fix automatic data refresh (Status: Closed, Priority: Normal)\n[PA-25383] Recipe Dashboard - handle nulls and add CP (Status: To Do, Priority: Normal)\n[PA-25046] Update mobile-steps-dashboard model (Status: In Progress, Priority: Normal)\n[TPT-2421] [GD] Fix crossed-out total price when applying voucher code on price breakdown (Status: Won't Fix, Priority: Normal)\n[TPT-2424] [GD] Display meals immediately after reactivation on dashboard (Status: Backlog, Priority: Normal)\n[TPT-2423] [GD] Display new inline error for invalid payment (Status: Backlog, Priority: Normal)\n[TPT-2420] [GD] Fix price summary to exclude shipping from discounted value (Status: Backlog, Priority: Normal)\n[TPT-2418] [GD] Reactivation with an invalid voucher applied (Status: Backlog, Priority: Normal)\n[TPT-2255] [GD] Add query param for dashboard reactivation (Status: Code Review, Priority: Normal)",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-01.md",
      "source_date": "2025-12-05",
      "doc_type": "meeting",
      "matched_topics": [
        "tpt"
      ],
      "matched_people": [
        "jama",
        "sameer",
        "nikita"
      ],
      "filter_score": 4
    }
  ],
  "doc_count": 1,
  "total_chars": 91633
}