{
  "batch_id": "one_on_one_002",
  "doc_type": "one_on_one",
  "documents": [
    {
      "title": "Sameer:Nikita 1:1 - 2025/12/05 15:29 CET - Notes by Gemini",
      "doc_id": "11soiKZRqWDscypgDeElfE1wi6QSRogdxztx67CPjzTQ",
      "link": "https://docs.google.com/document/d/11soiKZRqWDscypgDeElfE1wi6QSRogdxztx67CPjzTQ/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 5, 2025\n\nSameer:Nikita 1:1\n\nInvited Nikita Gorshkov Sameer Doda\n\nAttachments Sameer:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nSameer Doda confirmed that the overall work volume is manageable, with Allison assisting on the platform and Good Chop Shopify projects, though Sameer Doda and Nikita Gorshkov noted that program revivals are unlikely due to a lack of resources, a point Sameer Doda, David, and Nikita Gorshkov discussed with Marina regarding unfunded work. Sameer Doda detailed their involvement in the complex Good Chop Shopify project, the DACH Juices support project for Nordic markets that requires a technical solution, and the Influencer Marketplace, which needs an MVP path forward due to varied stakeholder views and already has design progress with Shay; Sameer Doda and Nikita Gorshkov agreed on a simple one-time purchase customer journey for the MVP, but Sameer Doda raised concerns about limitations with applying vouchers and selling add-ons, which Nikita Gorshkov suggested discussing with Jama, and both acknowledged a need for more frontend development resources. Sameer Doda needs to coordinate with Jama for the roadmap review meeting and discussed the \"Seamless Pricing Upgrade\" initiative, which Nikita Gorshkov suggested de-prioritizing, while they also agreed to maintain two different views of the roadmap and implement an intake process with Ian as the tactical point of contact.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Overall Work Volume and Resource Allocation Sameer Doda confirmed that their overall volume of work is manageable, with Allison assisting on the platform and Good Chop Shopify projects. Sameer Doda and Nikita Gorshkov discussed that the revival of programs is unlikely soon due to a lack of available resources, unless it is fully funded, a decision that would need to come from Dominic (00:00:49) (00:04:03). Nikita Gorshkov noted that they, along with David, pushed back on Marina for introducing unfunded work that was taking up design capacity (00:03:05).\n\n* Shopify Initiatives (Factor Form and Good Chop) Sameer Doda outlined their involvement in the Shopify projects, specifically Good Chop, which they anticipate will be more complex than Factor Form due to potential changes in the customer journey (00:00:49). The immediate next steps for the Good Chop project include developing a strategy document, creating a customer journey, and addressing edge cases such as account duplication and customer redirects, in addition to tactical work like third-party integrations (e.g., Recharge and Elevar) (00:02:10). Sameer Doda is confident that they can now manage the setup of Recharge if Allison is unavailable (00:03:05).\n\n* DACH Juices Support Project Sameer Doda explained that Jama brought up a project to support launching juices in the Nordic markets, which Sameer Doda discussed with stakeholders and promised to provide timelines for in January (00:04:54). The required technical work involves automatically adding fan charges as a separate line item to the cart and to the auto summary when a juice pack is added, a task that is more complicated than it appears. Sameer Doda plans to create a requirements document after receiving answers to questions they posed to Viola (00:06:15).\n\n* Influencer Marketplace Strategy and Customer Journey Sameer Doda has gone through all the research documents for the influencer marketplace and believes the initiative needs a proposed path forward for the MVP due to the variety of stakeholder views. They have created two separate customer journeys: one for customers buying as a one-time purchase box (former or paused customers) and another for active customers who might purchase an additional recipe (00:07:28). Nikita Gorshkov agreed with the focus on simplicity for the MVP, noting the very positive response from unstructured interviews and the potential for a viral moment, suggesting starting with three occasion boxes sold through influencers’ channels to prove demand (00:08:50).\n\n* Influencer Marketplace Design and Logistics Sameer Doda revealed that they are already making progress on the design, with Shay working on pages and profiles. The plan is to align on the basic one-time purchase customer journey, quickly show low-fidelity designs to senior stakeholders for feedback, and then have Shay continue with high-fidelity designs, reusing existing components from projects like the Christmas box flow (00:10:03). Sameer Doda and Nikita Gorshkov agreed that active customers should be able to buy even a small kit, like a dinner for two, as a one-time purchase, simplifying the front-end by avoiding the need to enforce minimum rules (00:12:03). Sameer Doda will set up a session the following week with Nikita Gorshkov and Shay to review the basic customer journey and low-fidelity designs (00:13:10).\n\n* Influencer Marketplace Backend and Timeline Concerns Sameer Doda expressed concern that the ability to apply vouchers for one-time purchases is a limitation that may not be solved in time, an issue Nikita Gorshkov stated needs to be addressed with Jama. Other concerns include the current inability to sell add-ons on the one-time purchase flow (00:15:12). Sameer Doda noted a potential misalignment with the HelloFresh Canada physical product team, who may be planning for a Q2 launch, though Nikita Gorshkov indicated that Q2 is the latest agreed-upon deadline with Ian (00:17:54).\n\n* Frontend Resource Needs Sameer Doda pointed out a need for more frontend development resources, as most of the current projects, including the influencer marketplace, the Benelix experiment, and the Duck juices support, involve significant frontend work (00:19:02). Nikita Gorshkov confirmed that they are looking to fill three open roles and that a frontend developer is needed to replace Deborah in addition to the existing team members (00:19:59).\n\n* Upcoming Roadmap Review and Seamless Pricing Initiative Sameer Doda needs to coordinate with Jama on Monday to determine the invitees and process for the roadmap review meeting (00:22:19). They also discussed the \"Seamless Pricing Upgrade\" initiative, for which Sameer Doda lacks a clear problem statement beyond knowing there are general issues with seamless pricing (00:23:15). Nikita Gorshkov located the item in the initiatives log, which refers to encouraging upgrades and flexibility on smaller sizes, but noted that the comment dates it to Q3, allowing them to de-prioritize it for now (00:24:48).\n\n* Roadmap Visualization and Intake Process Sameer Doda shared an alternative, more visual road map view that they prefer for presentation, which they agreed to continue maintaining alongside Nikita Gorshkov's preferred view that splits work streams into different \"swim lanes\" for better visibility of design, product, and engineering discovery allocation (00:26:07). Sameer Doda also introduced an intake sheet to manage new requests, though they need to define to whom it will be evangelized. Nikita Gorshkov proposed a structure where Ian serves as the tactical point of contact to minimize interactions with senior leaders like Ed, with road map reviews happening monthly for visibility (00:29:54).\n\n\n\n\n\nSuggested next steps\n\n* Sameer Doda will set up a session next week with the physical product team for HelloFresh Canada to align on the Q1 target date for the influencer marketplace.\n\n* Sameer Doda will go through the answers received from Viola regarding the duck juices support and create a requirements document, including an estimate for when the work will be picked up in Q1.\n\n* Sameer Doda will set up a session next week with Nikita Gorshkov and Shay to (1) review the basic customer journey for the onetime purchase flow and the low fidelity designs for the influencer marketplace, and (2) work with Shay to iron out changes needed on the low fidelity designs so Shay can continue working on the high fidelity designs.\n\n* Sameer Doda and Nikita Gorshkov will connect with Jamba on Monday to discuss the roadmap review meeting with stakeholders and determine the invitees.\n\n\n\n\n\nYou should review Gemini's notes to make sure they're accurate. Get tips and learn how Gemini takes notes\n\nPlease provide feedback about using Gemini to take notes in a short survey.\n\n📖 Transcript\n\nDec 5, 2025\n\nSameer:Nikita 1:1 - Transcript\n\n00:00:00\n\n \n\nSameer Doda: give us uh ids uh for which for each of those four branches and you know then we the only thing that's respons that we are responsible for is to take action on those email ids uh for all of those four branches so that simplifies things a little bit for us uh the the two things that I did mention to you those are the two things that we're trying to solve and Leman and Vander are working with those two respective teams we have a proposal for them we're just trying to see if it how it can\n\nNikita Gorshkov: Samir, I I guess I meant more about your general work because you have this and you have uh Shopify. Um and I know that Annette was bugging you around the the influencer marketplace, but the influencer marketplace I got one up. That's fine. Um uh I'm going to talk with Ian today as well in regards to like what's happening on his ends and get a feeling there.\n\nSameer Doda: Yeah.\n\nNikita Gorshkov: Uh\n\nSameer Doda: Okay. So, my overall volume of work manageable.\n\n \n\n \n\n00:00:49\n\n \n\nSameer Doda: Uh I'm I obviously have Allison's help on the platform Shopify stuff and then I will have I will continue working with her on the good chop Shopify stuff. I also spoke to Jamba because one of the things that I was concerned about was that there were these discussions happening on programs and uh Allison was under the assumption that as a result of these discussions with Dominic there is a possibility that uh uh programs might be revived sooner than she thought. I spoke to Jama was like nope it's not happening there are no people to do it and even so I I mean even with both with the factor form Shopify and with good chop Shopify both of these initiatives\n\nNikita Gorshkov: Unless unless it's funded 100%. Um, no.\n\nSameer Doda: I'll be involved uh with Allison um at the very last detail because I want to make sure that you know because both of them are they they are not so simple uh Shopify is sometimes complex and good chop actually will be even more complex than than factor form was because with factor form some of the thinking was already done in terms of what we needed to do there wasn't any change in terms of the customer journey but with good job there might be it it could be there could be a change in the customer journey so So I don't I mean\n\n \n\n \n\n00:02:10\n\n \n\nNikita Gorshkov: Sorry, one sec. But I looked through the the statement of work. It was relatively minor. Um like it was very straightforward. At least the MVP side of it. So basically, it's only a one-off uh e-commerce experience, right?\n\nSameer Doda: it's the same scope though. It's the same scope though but we have to we have to tell them what to build right. So there are a few things that we have to uh get done. So the first one being we have to get that strategy document out.\n\nNikita Gorshkov: Mhm.\n\nSameer Doda: Second, we have to create a customer journey to tell them what is it that we need. Uh we have to look at we are looking at the customer journeys from different competitors on how they are handling this.\n\nNikita Gorshkov: H. Sure.\n\nSameer Doda: Uh and the third one is that there are some of these edge cases that we have to discuss the day we discussed it for factor form in terms of account duplication. How do we redirect customers from one platform to another?\n\n \n\n \n\n00:03:05\n\n \n\nSameer Doda: some of those things and then there will be the tactical stuff which is stuff that we're doing right now for factor form which is you know integration of recharge integration of elevar all of these third parties so it's\n\nNikita Gorshkov: Recharge it through. Yeah. Yeah.\n\nSameer Doda: at that point it becomes more project management and and coordination rather than product management so uh and Allison is um familiar with all of these tools now and I'm hoping that we actually end up reusing a bunch of these tools so and so am I even if even if let's say Allison has to jump.\n\nNikita Gorshkov: I mean, no.\n\nSameer Doda: I can also now set up pre-charge.\n\nNikita Gorshkov: No. I like I like we'll see if Alison needs to jump. I I'm I don't think like that that's going to happen in Q1.\n\nSameer Doda: Yeah. Yeah.\n\nNikita Gorshkov: Uh realistically speaking, the only problem with the programs was that there was a Marina was stirring the pot for some unknown reason uh in terms of like pushing more and more work to be done while none of this being funded and she was taking up quite a bit of capacity on the design side.\n\n \n\n \n\n00:04:03\n\n \n\nNikita Gorshkov: I together with David, we've pushed back very hard on this. um we don't understand what's the intent here and if Dominic needs to make a decision in terms of does he want to fund programs like earlier like none of this is going to be built uh or decided based on some high fidelity design like it should be based on commercial Yeah, exactly.\n\nSameer Doda: that and I mean honestly even if Dominic says that okay I'm going to fund this 100%. It will still take time to hire folks right there are because the existing folks are already tagged to some of the other teams and other pieces of work. So if we yeah unless Dominic takes the harsh decision to move existing resources immediately from some of the other initiatives which I don't think he exactly\n\nNikita Gorshkov: But this is the like, okay, this is what we don't do at HelloFresh at all, right? So, we prioritize and then we say, \"Oh, well, but but maybe can we squeeze all of the other stuff that we couldn't prioritize?\"\n\nSameer Doda: yeah I know I know so I I but honestly I don't think there's a risk in that so I have a so so both Shopify projects uh handled with Allison that's fine all of these small little things that\n\n \n\n \n\n00:04:54\n\n \n\nNikita Gorshkov: Um, so\n\nSameer Doda: I was doing the Benelix thing uh the duck juices support that Jamba brought up to me I spoke I actually met the stakeholders and I actually told them that we'll be able to give them timelines in Jan not right now uh the support for launching juices and duck and the the Nordic markets.\n\nNikita Gorshkov: Wait, which project\n\nSameer Doda: Okay, let me give you this one picture that Jama gave me and he said that apparently this was discussed somewhere but uh either you or him forgot to to bring it up and add it to the road map but it has been brought up again uh for discussion and we need to work on this because Ed believes that yes we need to support this.\n\nNikita Gorshkov: Uh. Uh-huh.\n\nSameer Doda: Let me know if you don't have access. You should have access.\n\nNikita Gorshkov: Uh, what? Du is lunch.\n\nSameer Doda: So I'll give you a TLD summary.\n\nNikita Gorshkov: Um.\n\nSameer Doda: So if you go down to the screenshot uh a little bit lower, we basically need to do two things.\n\n \n\n \n\n00:06:15\n\n \n\nNikita Gorshkov: Uhhuh. Uh. Uhuh.\n\nSameer Doda: One is that based on the item that is added, we need to add another item to the cart which adds this fan charges. So 70.75 users. So if you add a citrus boost pack, it which has three juices, we have to automatically add a line item for three fan charges and then we also have to add a line item to the auto summary to charge the same amount to customers. It's not as simple as it looks. By the way, I've already gone through the details of Yeah, but I had a but I had a chat with them.\n\nNikita Gorshkov: I know. Oh my f****** god. This is the on the Oh god. Okay.\n\nSameer Doda: uh there are a few questions that I've given actually I see there are a few answers so I have to uh go through these but once I have the answers to some of the questions that I had given uh to viola I will then create a requirements document for it but the thing is that we have to give an estimate for this in in Q1 in Jan on when we'll be able to actually pick this work up so so it's a it's a separate thing uh so Then the influencer marketplace for the influencer marketplace I actually wanted to set up some time next week to discuss with you because there are all of these research\n\n \n\n \n\n00:07:28\n\n \n\nNikita Gorshkov: Mhm.\n\nSameer Doda: documents and I've gone through all of them literally uh now and I've been in those discussions with uh where Ian is also present for uh the recipe marketplace research where Anetta and Katherine present their research and I get\n\nNikita Gorshkov: Huh? Huh?\n\nSameer Doda: to hear some of his views. I think that I I kind of think two things about this initiative. One is that it is such an open-ended initiative that there are a lot of people with a lot of different views and they will always keep on having all of these views, right? So, we have to propose a path forward that this is what we're going to do for MVP and then move forward with that. That's the first thing.\n\nNikita Gorshkov: H.\n\nSameer Doda: The second thing is that um I have created two different journeys. One for customers who are going to buy it as a one-time purchase box. customers who probably are either former customers or maybe pause whatever there could be a million reasons why they would not million but at least three or four reasons why they would buy a onetime purchase but any active customer who's actually buying a box in that week already from HelloFresh should also get an opportunity to explore these recipes by these influences so I have a separate journey that I've created for them as well but I wanted to\n\n \n\n \n\n00:08:50\n\n \n\nSameer Doda: sync with you and Jama before I share any of that with anybody.\n\nNikita Gorshkov: I think uh I think that's true that we will need that eventually but right now I think you're right.\n\nSameer Doda: Mhm.\n\nNikita Gorshkov: My general approach is that yes there's no let me take a step back because I was talking with uh Annette today Anetta today I went through all the uh documents in um the feedback and this is what I mentioned in the channel as well is that I actually think we're on to something here I have not seen for a very long time such a positive response in any unstructured interviews ever.\n\nSameer Doda: Yeah, agreed.\n\nNikita Gorshkov: Um, and this is to me seems like a that it has a potential for a viral moment here, which is really good. This is why I want us to be very simple very early on to just prove out that there is something uh to this. And that means we can seem to be okay in being able to get the supply from of recipes from our uh from potential influencers like they seem to be interested in this model etc. Now we need to prove\n\n \n\n \n\n00:10:03\n\n \n\nSameer Doda: Mhm.\n\nNikita Gorshkov: out that there is a demand and sure we'll get some uh reviews and whatnot sorry some interviews and whatnot but I think the simplest thing is to take whatever positive uh positively looking uh influencers we have and create three occasion boxes and have them uh actually sell them as part of their you know on their channels.\n\nSameer Doda: Yeah. So, so that part of the journey is something where we're already actually making a lot of progress. So, I'm Please don't look at this right now.\n\nNikita Gorshkov: H nice.\n\nSameer Doda: The only reason I'm even showing the screen is to show you that uh we're actually doing a bunch over here to uh kind of create different pages, profiles, what the journey will look like, all of those things along with uh shape. So we have we have actually done a lot over here.\n\nNikita Gorshkov: Mhm.\n\nSameer Doda: But what I plan to do then is then I first plan to instead of showing these even low fidelity designs two two different steps. First is to just show the basic journey that for a onetime purchase box this is what the journey of the customer will look like.\n\n \n\n \n\n00:11:13\n\n \n\nNikita Gorshkov: H.\n\nSameer Doda: Second once we are aligned on that journey very quickly we show the low fidelity designs uh to our stakeholders all of our senior stakeholders and even in the broadest setting where we kind of get the feedback from other folks. So we show the lowfidelity designs. In the meanwhile, Shay is already working on highfidelity designs as well, right? And and I've told Shay that you know keep on I mean go back look at the Christmas box that we've launched.\n\nNikita Gorshkov: That's right.\n\nSameer Doda: Look at that flow, right? And see what you can pick from there. That's one. And the other thing that helped us launch a Christmas box really quickly was to also reuse a lot of existing components. to see how you can piece together these designs that we have to create from the existing components that we already have in store and reuse them as far as possible to create that offering.\n\nNikita Gorshkov: Huh?\n\nSameer Doda: But I'll circle back to you and this is something that I'm thinking through but maybe you already have the answer and we can actually save some time there.\n\n \n\n \n\n00:12:03\n\n \n\nNikita Gorshkov: Huh?\n\nSameer Doda: My only concern is that we do have a pretty large customer base in in in US right uh even in Canada right in both these countries.\n\nNikita Gorshkov: Mhm.\n\nSameer Doda: So in a as a Canadian customer, if someone actually goes to one of these influencer websites or social media content, whatever, and they see that content and they want to buy that meal kit, which brings them back to the Hellfish marketplace, onetime purchase flow, if they're already getting a box that week, right?\n\nNikita Gorshkov: H. No, but this is this is why we talked with Ian about this is that he's okay on losing money initially.\n\nSameer Doda: E, they will probably not buy an entire box, even the smallest size box, because we will have to put some kind of a minimum limit, right? We won't be able to ship just one meal.\n\nNikita Gorshkov: Um maybe it will be like a dinner for two uh kit but that like it's the a tiny box but we're okay of not having this as a movie like that.\n\nSameer Doda: Oh, okay.\n\nNikita Gorshkov: This is two days, two people like um it can be a for example if if that is the approach that uh like I think if we're okay on the commercial site and Ian was okay on the commercial side\n\n \n\n \n\n00:13:10\n\n \n\nSameer Doda: Oh, so you able to buy just one key for two people? Oh.\n\nNikita Gorshkov: to do this then we should do it like buy yourself a special dinner.\n\nSameer Doda: Okay. Oh yeah. I mean, one, it makes things simpler for me because then I don't think about enforcing minimum rules on the front end. And second, it also solves this this random use case that I'm sharing with you that even if I'm getting a box as a HelloFresh customer, if I see one more recipe elsewhere, buying one more recipe in a given week is probably not that big of a challenge. So I can I will possibly go and buy that one more recipe. So that that's all. So then right now we'll just focus on the onetime purchase flow in that case and yeah it should be so then I um today's what today's Friday so within the next week I will have the uh I will\n\nNikita Gorshkov: Huh?\n\nSameer Doda: set up a session with you me and Shay to go through the very very basic customer journey in this case.\n\n \n\n \n\n00:14:08\n\n \n\nNikita Gorshkov: Huh?\n\nSameer Doda: Second show you the low fidelity designs. I will work with Shay to iron out some of these things that she's added on the low fidelity designs that uh uh be wherever the changes are needed I'll work on them with her and then once these two\n\nNikita Gorshkov: Mhm.\n\nSameer Doda: are kind of done Shay can then go on to continue working onto high fidelity designs and then uh we can decide when to set up a session with Ian and with the rest of the stakeholders I think because launching for this we might also want to set up a session with Ed to show him what is it that we're doing, get his feedback as well, maybe even Marina, some of the senior leaders. And then we set up that session, we walk them through what we're doing and then we just kind of take it from there.\n\nNikita Gorshkov: Mhm.\n\nSameer Doda: The good thing about all of this is that the way I mean as far as I've been able to think about it, we will not be blocked uh by any backend limitations.\n\n \n\n \n\n00:15:12\n\n \n\nSameer Doda: The only thing that I was hoping was there, but I don't think it'll be solved in time, would be the ability to apply vouchers for these one-time purchases.\n\nNikita Gorshkov: Well, we need to work with Jamba on this because it's it's getting to a point where we're constantly avoiding using vouchers anywhere because it's impossible to apply them.\n\nSameer Doda: That would have been Oh, wow.\n\nNikita Gorshkov: Like Crosselling doesn't have vouchers. OTV doesn't have vouchers across any brands that we're launching OTV and now this won't have vouchers or discounts.\n\nSameer Doda: Yeah.\n\nNikita Gorshkov: It's like no no vouchers.\n\nSameer Doda: I didn't know crossing also didn't have vouchers. I thought crosselling would have vouches. Okay. Yeah, it's becoming it's becoming a constraint. And the second thing is that why we might not need it in the beginning, right? Because uh now there won't be any add-on recipes to start with probably for this use case. Uh but eventually the fact that we actually cannot sell add-ons on the onetime purchase flow right now is also something that's a bit concerning to me.\n\n \n\n \n\n00:16:00\n\n \n\nSameer Doda: And it's also something where we we should probably solve it soon uh to to be able to then capitalize on it if there is market for it.\n\nNikita Gorshkov: Agreed. Agreed.\n\nSameer Doda: Yeah. So, thanks for that. Actually, you solved you solved a big part of the problem statement for me and actually reduced my work a little bit because I was I had to think about that other journey and she would have had to resign the other journey as well. So, yeah, but yesterday when I was speaking to Shay, she was asking me so can I work on high fidelity or not?\n\nNikita Gorshkov: No. Huh?\n\nSameer Doda: I told Shay that you know there is at least one screen that I know which will be there one way or the other which is the main storefront for these influencers on the marketplace and which will also probably take you the most amount of exploration and effort to create. So you might as well go and start doing that. In the meanwhile, we'll get clarity on, you know, how the rest of the pieces are uh lining up and then we can take a call.\n\n \n\n \n\n00:16:55\n\n \n\nNikita Gorshkov: for sure. And and to be fair, like I think it's you're absolutely right that like the integration with HelloFresh will need to consider, but I think before we get there, there's so much potential in terms of actually growing the market for this particular product uh as a one-off that we still have some ways to go until we do like full-on integrations and stuff like that because that already becomes muddied and P500 and there's like I don't want to\n\nSameer Doda: Mhm.\n\nNikita Gorshkov: touch that world. We we still have Tik Tok shop to consider.\n\nSameer Doda: Mhm.\n\nNikita Gorshkov: Uh we and integrations there we need to figure out how like how to even make that. So hear me out. In my ideal world, once you see a recipe, whatever on Instagram, I want a single click it like, okay, sure, if we don't know anything about you, who you are, your address or anything like that, we would need some screens in terms of like are can we ship to you and things that in an ideal scenario like most of this information is possible to get from uh from Chrome or from Apple Pay or from Android uh\n\n \n\n \n\n00:17:54\n\n \n\nSameer Doda: Right. Oh, yes.\n\nNikita Gorshkov: wallets. uh, PayPal. Um, and if this is an email that we already know, we should just log in and just there like just confirm that you buy it.\n\nSameer Doda: Yeah. Oh, 100%. So, express checkout was actually one of the things that I really wanted to do even for Christmas box. We didn't have time unfortunately, but yes, 100% yes for this. So, we will figure out all of these integrations to figure out how we can make it a one-click buy for customers as little friction as possible.\n\nNikita Gorshkov: Mhm.\n\nSameer Doda: Totally align on that. uh the one thing that I do want to call out then so if I look at the overall if I look at the initiives then for uh Q1 it is the influencer marketplace which I just want also uh\n\nNikita Gorshkov: H\n\nSameer Doda: wanted to call out that you put up a date for March and I'm going to set up a conversation next week with the physical product team for HelloFresh Canada. I think they're under the impression and under the plans that they actually have to set it up for Q2.\n\n \n\n \n\n00:19:02\n\n \n\nSameer Doda: So if this is something that they need to do by Q1, meaning okay.\n\nNikita Gorshkov: Yeah. No, no, no. Look, it's fine. We can move it. Uh, and this is why I put the um confidence at low because I think it will be pushed to Q2 and that's okay. It's just that we did agree with Ian that we cannot push farther than Q2. That's the only thing.\n\nSameer Doda: Yeah. No, no, makes sense. I mean honestly speaking we if the if the if the physical product teams can actually get these products ready we will be able to service this by the end of Q1 hopefully but this is all front end now right most of this work is now front end the Benelix experiment that we have to conduct for the premium tier that the phase 2 is also front end right the dark juices support is a little bit backend but there is also some front end work to What I'm trying to say is that there is a there are a lot of these front end pieces uh that are getting added.\n\n \n\n \n\n00:19:59\n\n \n\nNikita Gorshkov: H. Yeah, but to be fair, we don't need a\n\nSameer Doda: I'm not sure how many front end resources we have because even if Philip comes back, we have Amique and Philip and Sneha to support with the mobile app. But for instance, on this one, I don't think that we're going to launch an app version for it. So uh SNA will be able to support the Benlex premium subscription experiment but then we need more yeah yeah so we need more\n\nNikita Gorshkov: a an app version, especially if we are looking that this will be a mainly through third party channels uh acquisition. So, I I'm not worried about that. One sec.\n\nSameer Doda: web developers basically front end developers\n\nNikita Gorshkov: Uh okay. And uh where the hell is it? Uh, new ventures, engineering and products.\n\nSameer Doda: So all the back fields are back.\n\nNikita Gorshkov: So, we have live and we have approved and awaiting posting. So, we have three roles that are going to be open soon. And I let me double check placement.\n\n \n\n \n\n00:21:12\n\n \n\nSameer Doda: So in place of DA, DA is a full stack developer. Are we getting a front end or a full stack?\n\nNikita Gorshkov: Deborah is a um is an engineering manager.\n\nSameer Doda: Oh yeah, he won't actually.\n\nNikita Gorshkov: Yeah.\n\nSameer Doda: I keep on. So this this structure is is a little new because I keep positioning where yeah so we'll get a we'll get a staff developer in place of DAO I don't think we need another engineering manager right we already have\n\nNikita Gorshkov: No, no, no. Look, uh Deborah will move out. Let me share this. Uh No, no, no. Uh, we have ender for that.\n\nSameer Doda: band for\n\nNikita Gorshkov: So, we have uh an FE. Why do we have a back? I think this is just um Let me just add this as a comment.\n\nSameer Doda: What the hell?\n\nNikita Gorshkov: So I think this will be an uh FE. Then we have SNHA and yeah instead of Davver we'll need to get an uh a front ender as well.\n\nSameer Doda: Okay.\n\n \n\n \n\n00:22:19\n\n \n\nNikita Gorshkov: Yeah, that would make sense I think.\n\nSameer Doda: Yeah, that will probably Yeah, that'll make a lot of difference.\n\nNikita Gorshkov: Yeah. Cool.\n\nSameer Doda: Sounds good. And then uh two more quick questions for you, but we have only one minute left.\n\nNikita Gorshkov: Okay.\n\nSameer Doda: Let's so first question is I want to set up that uh so Jama told me to set up that um road map review meeting uh with stakeholders and I'm I'm he obviously think he wants to discuss that next week when he comes back. I also want to kind of get a sense check from him on who the invitees should be for that road map review uh for the Yeah.\n\nNikita Gorshkov: Wait for for which road map? uh for the road map review for MIO specifically, right? Um yeah, actually to be fair like uh uh let's connect with Jamba on Monday.\n\nSameer Doda: Yeah.\n\nNikita Gorshkov: I also don't know yet because Jama said he would hand it over but he never handed to do because also I uh left uh um so let's connect with him on Monday and then see.\n\n \n\n \n\n00:23:15\n\n \n\nSameer Doda: Okay.\n\nNikita Gorshkov: I don't know what the exact process that they aligned uh with is uh going to look like\n\nSameer Doda: Okay. Sounds good. The second thing is that uh there is another initiative on that uh on the list of things that you shared which is seamless pricing based initiative whatever but I don't have a problem statement for it. I know what the problems are with seamless pricing uh but how many of those are we going to solve will decide the extent of that initiative.\n\nNikita Gorshkov: H can you remind me? Uh what was it? Um what was the problem there?\n\nSameer Doda: So that's what I don't have the problem statement. I just have a line item seamless pricing upgrade. That's it.\n\nNikita Gorshkov: Seamless pricing upgrades. Seamless pricing upgrades. One sec. Create. Why is simul pricing upgrade? Uh what is the problem with uh seamless pricing in the first place anyway?\n\nSameer Doda: So there are two problems with seamless pricing. The first problem with seamless pricing is that it uh it keeps on jumping.\n\n \n\n \n\n00:24:48\n\n \n\nSameer Doda: So it's a basic pricing structure itself.\n\nNikita Gorshkov: Uh wait wait wait there we go there we go it's in the initiatives log um as we onboard more customers into factor on smaller sizes for example for blah blah blah we better and easier seamless experience to encourage upgrades and flexibility on a weekly basis to drive a better seamless merchandising promoting upgrades based on personalized recommendations seamless downgrade but we have seamless downgrades But let me double check.\n\nSameer Doda: We have seen this downgrade although it's a very hidden feature. A lot of people don't know how to use it properly on ready to meet.\n\nNikita Gorshkov: No, this is seamless improve AOV merchandising market.\n\nSameer Doda: It's a very very hidden HelloFresh. It's a different feature.\n\nNikita Gorshkov: Okay. MD squad Q3. Wait. Uh, now it says Q3. Why did I have it for Q? It's weird. Um, let me double check. Um. Ah. Okay. Wait. Okay. Let's take Jesus.\n\nSameer Doda: based on personalized recommendation.\n\n \n\n \n\n00:26:07\n\n \n\nNikita Gorshkov: This this thing keeps increasing. Um maybe see.\n\nSameer Doda: Oh yeah, the actually the the comment says Q3 actually. So then I be less worried about it.\n\nNikita Gorshkov: Yeah. Uh okay. Let me double check on the wish list. Uh yeah, it says Q3. So just move it to from the road map.\n\nSameer Doda: I mean I still keep it on the road map. I'll just move it.\n\nNikita Gorshkov: No, but move it. Yeah. Yeah. Exactly.\n\nSameer Doda: Yeah.\n\nNikita Gorshkov: Yeah. Let me\n\nSameer Doda: All right. Okay. Uh road map as well. So I did create an alternative view that that I've been uh using for the past three four years. I can keep both the views updated. This one just gives me a little bit more view of where I am right now and easier for me to present. But let me know if if uh if this works for you as well, then I can just maintain one\n\n \n\n \n\n00:26:59\n\n \n\nNikita Gorshkov: one sec. Uh, oops. Status. It's okay. Sorry. Like this date. This bucket. Okay. Uh, sorry. Uh, what's the format?\n\nSameer Doda: If you if you see the next tab\n\nNikita Gorshkov: Ah. Uh-huh. But it's the same. I honestly like the only thing is uh why I separated it and why on new ventures we kind of have it that way. Um I used to have uh road maps similar to yours, but then everybody like Yara uh I think we evolved it uh into this one for uh two reasons. In this case, it's kind of hard necessarily to split out certain work streams, especially if you have like very small things on uh and number two, it became important at least for our stakeholders on the new venture side where to have uh the experiments and the experiment timelines themselves so that we don't lose visibility in terms of where we're allocating because if we're allocating for example on the funnel, we should see that we shouldn't be building another experiment in the funnel within that time frame while the allocation is happening so that we don't you know muddy the waters for example that's why we had it there design was to visualize like what is the scope uh of work on design um because there could be multiple things in parallel same on product and engineering discovery that also takes a lot of time and that's why we kind of split these swim lanes let's call\n\n \n\n \n\n00:28:51\n\n \n\nSameer Doda: Okay, we did solve for those uh I can search for my old Okay,\n\nNikita Gorshkov: Like like otherwise I'm I'm fine like as long as the visibility is there like I I'm fine with this view either like I Look,\n\nSameer Doda: sounds good. Yeah, because we used to uh what we used to do was that we used to write it down in these cells themselves. Uh allocation start. So allocating allocating in these in these boxes themselves it kind of gives Oh yeah I I agree all of these versions they work perfectly.\n\nNikita Gorshkov: dude, I think over the 17 years I've seen every single version of how a road map can humanly look like. Oh, like uh I've updated the initiatives log with the new items that uh they had on this wish list.\n\nSameer Doda: It's just about I I think it boils down to personal preferences at the end of it and the ease of use for for at an individual level. That that's pretty much it.\n\nNikita Gorshkov: Uh yeah, I don't know how it's maintained or or updated, but at least now it's Yep, agree.\n\n \n\n \n\n00:29:54\n\n \n\nSameer Doda: Okay, I also created this intake sheet. Uh if you see the third tab, we can probably start evangelizing this as well for anyone who wants to add a request, they can add to this.\n\nNikita Gorshkov: We just need to figure out how exactly we and to whom we do evangelize this.\n\nSameer Doda: I know, I know, I get it.\n\nNikita Gorshkov: My my targets are going to be I want to make that Ian the tactical point of contact essentially like I don't want to be talking with a thousand different people. Uh, and I don't uh or you talking with a thousand different people and I don't want us to be talking like three times a week because like uh with Ed because that's a recipe for failure. He has way too much s*** on his uh plate so he will never be available and then we're here shoveling dirt from oh US is saying one thing and Ben is saying another thing.\n\nSameer Doda: Oh, yeah.\n\nNikita Gorshkov: So I do want like Ian maybe and maybe somebody on the US sides to actually like have a small group of like decision makers and if there's a tiebreaker that's needed on that level or above then yes we can go to it.\n\nSameer Doda: Yeah, 100%. But I mean even Jama said that the frequency for such a road map review would be like once a month something like that just to give visibility on where we are and all of these other decisions on what\n\nNikita Gorshkov: That's true.\n\nSameer Doda: gets prioritized on the road map can be handled se separately. Cool. Uh yeah.\n\n \n\n \n\nTranscription ended after 00:31:33\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-03.md",
      "source_date": "2025-12-05",
      "doc_type": "one_on_one",
      "matched_topics": [
        "new ventures",
        "good chop",
        "factor form",
        "one-time purchase",
        "occasion boxes",
        "occasion box"
      ],
      "matched_people": [
        "jama",
        "sameer",
        "allison",
        "nikita"
      ],
      "filter_score": 10
    },
    {
      "title": "Notes: Hamed <> Nikita 1:1",
      "doc_id": "1HWhfmd_VP-8REbk3u9nEybAJ4-sfeoXegVHuQcc0INM",
      "link": "https://docs.google.com/document/d/1HWhfmd_VP-8REbk3u9nEybAJ4-sfeoXegVHuQcc0INM/edit?usp=drivesdk",
      "content": "﻿Dec 9, 2025 | Hamed:Nikita 1:1\n\nAttendees: Nikita Gorshkov Hamed Karimian\n\n\n\n\n\nNotes\n\n* OTP updates\n\n   * Running e2e testings\n\n   * Will confirm the launch date by early next week\n\n* Meet-up with Allysa and Deo\n\n   * They’re aligned with our prototype\n\n   * They’ve directed us to discuss it with Mert Bozdag, Laura Mneimneh, and Elisa Marku\n\n* Pants is out sick this week \n\n   * We’ll work on the Q1 roadmap details once he’s back\n\n* How will the Shopify experiment evolve the VMS dev team? \n\n\n\n\n\n\n\n\n\nAction items\n\n* \n\n\n\nDec 5, 2025 | Hamed:Nikita 1:1\n\nAttendees: Nikita Gorshkov Hamed Karimian\n\n\n\n\n\nNotes\n\n* OTP Launch → decision: to have FF turn on in W02, but everything should be ready by EOY\n\n\n\n\n\nOptions\n\n\tPros\n\n\tCons\n\n\tDecision\n\n\tLaunch W50\n\n\tMore time before AD/ND\n\nTime to iterate if issues\n\nTime to rollout gradually\n\n\n\n\n\n\tWon’t make it! \n\nLess time for e2e testing\n\n\tNo Go\n\n\tLaunch W51 (To 90% of users)\n\n\tOriginal plan\n\nOn-track from dev pov\n\nCaptures business value earlier (~$15k in revenue)\n\n\n\n\n\n\tSuper risky as most devs are out (Jordon, Jan, Edwin, Emily, Daniel, Travis)\n\nSuper close to EOY\n\nMight break something on Factor\n\nNot enough time for gradual rollout\n\nOn-calls: Emily Stanek (W50), Paul Andrews (W51/52)\n\n\tMaybe\n\n\tLaunch W51 \n\n(To only 10%)\n\n\tMitigates the risk\n\nCollects some feedback before the peak\n\n\tStill risky (Not enough devs to support)\n\nLimited business impact\n\n\n\n\n\n\tNo Go\n\n\tLaunch W02\n\n(To 90% of users)\n\n\tLess risky (Devs available for support)\n\nStill before the actual peak\n\nWon’t break anything on Factor/FF\n\n\tDelayed launch\n\nOpportunity cost\n\n\n\n\n\n\tGo! \n\n\t  W46 2024 - W04 2025 → The market is pretty soft over the last few weeks of the year\n\n* Mobile app prototype\n\n   * Who’s the owner of Factor App? → Shopping experience () & Merchandizing (Elisa Marku Laura Mneimneh) \n\n* Early & Often slides\n\n* Shopify redirects → We might change that in the future depending on the number of redirects\n\n   * Net New users: from legacy to shopify\n\n   * RTE users: from Shopify to legacy\n\n\n\n\n\nAction items\n\n* \n\n\n\nDec 2, 2025 | Hamed:Nikita 1:1\n\nAttendees: Nikita Gorshkov Hamed Karimian\n\n\n\n\n\nNotes\n\n* Update: we went live with the multicadence project\n\n* OTP decision - go with separate OTP/SNS checkout flows (analysis here)\n\n\n\n\n\nAction items\n\n* Break down roadmap items into deliverables \n\n* \n\n\n\nNov 14, 2025 | Hamed/Nikita 1:1 \n\nAttendees: Nikita Gorshkov Hamed Karimian\n\nAttached files: Roadmap - Factor Form \n\n\n\n\n\nNotes\n\n* Progress on the Mobile app\n\n   * Figma\n\n   * Prototype\n\n* Jordon’s transition\n\n* How’s life with a newborn?\n\n\n\n\n\nAction items\n\n* Nov 7, 2025 | Hamed/Nikita 1:1 \n\nAttendees: Nikita Gorshkov Hamed Karimian\n\nAttached files: Roadmap - Factor Form \n\n\n\n\n\nNotes\n\n* New design for PDP\n\n* Meal shake and Creatine\n\n* PA data backlog\n\n* Housekeeping\n\n   * New Ventures All group? https://groups.google.com/a/hellofresh.com/g/tribe-nv\n\n   * Tribe management sheet: how am I supposed to update the Task sheet?\n\n   * Weekly Notes: do we update it on Mondays?\n\n* Your take on the Grizzly article\n\n\n\n\n\n\n\n\n\nAction items\n\n* The distribution of Mobile web vs. Desktop → roughly 70% are mobile users  \n\n* Update the product tiles for Creatine/Meal shake to go to Amazon (CTA: Buy on Amazon) Alternatively, redirect them after capturing their emails → Designs to be confirmed by Laura\n\n* Weekly Notes: Update it on Fridays for the same week\n\n\n\n\n\n________________\n\n\n\n\n\n\n\n\n\nOct 31, 2025 | Hamed/Nikita 1:1 \n\nAttendees: Nikita Gorshkov Hamed Karimian\n\nAttached files: Roadmap - Factor Form \n\n\n\n\n\nNotes\n\n   * Nice and structured AHM, the new org makes a ton of sen\n\n\n\nckable only — no code).\n\n\n\n\n\nRecruit 10–15 representative users (existing customers or target personas).\n\n\n\n\n\nAsk them to choose between:\n\n\n\n\n\nCurrent “build-your-own” flow\n\n\n\n\n\nThe new “plan-based” flow\n\n\n\n\n\nAsk follow-ups:\n\n\n\n\n\nWhich feels more tailored to you?\n\n\n\n\n\nWhich would you trust more?\n\n\n\n\n\nHow likely are you to purchase?\n\n\n\n\n\n✅ Advantages: Fast qualitative signal; surfaces objections early.\n\n💡 Tip: Use Figma Analytics or Maze metrics (time on screen, clicks) for light quant data.\n\n\n\n\n\nOption 3: “Fake Door” Test in Live Site\n\n\n\n\n\nGoal: Measure real interest from actual users without building full functionality.\n\n\n\n\n\nOn your live PLP or homepage, add a new section or banner:\n\n\n\n\n\n“Introducing our new lifestyle plans — Performance, Focus, and Foundation.”\n\nCTA: “Explore Plans.”\n\n\n\n\n\nWhen users click, send them to a “Coming Soon” page or a short survey:\n\n\n\n\n\n“We’re launching soon — tell us which plan interests you most.”\n\n\n\n\n\nMeasure clicks, plan preference, and sign-ups for early access.\n\n\n\n\n\n✅ Advantages: True behavioral data from live traffic.\n\n💡 Tip: Works well if your current site already gets meaningful volume.\n\n\n\n\n\nOption 4: Email or CRM Campaign Test\n\n\n\n\n\nGoal: Validate resonance of messaging and pricing.\n\n\n\n\n\nSegment your customer base (athletes, busy professionals, general wellness).\n\n\n\n\n\nSend A/B email variants — one promoting current product set, one promoting “plans.”\n\n\n\n\n\nMeasure CTR, click-to-checkout, or pre-order intent.\n\n\n\n\n\n✅ Advantages: Zero dev time, quick pulse check on messaging effectiveness.\n\n\n\n\n\n📊 How to Evaluate Results\n\nMetric        Signal        Success Criteria\n\nCTR / engagement        Do users click into plan-based offers more than product-based ones?        +15–20% vs. baseline\n\nIntent (survey or fake door)        Are users more likely to say they’d subscribe?        Majority (>60%) positive\n\nAOV (simulated)        When choosing a plan, is average intended spend higher?        +10–15% lift\n\nQualitative sentiment        Do users say the plan feels easier, more relevant, or trustworthy?        Positive pattern emerges\n\n\n\n\n\nIf 2–3 of these indicators trend positively, that’s a green light to justify design + dev investment for a live experiment.\n\n\n\n\n\n🚀 Recommended Next Step (Low-Effort, High-Insight)\n\n\n\n\n\nBuild a simple Figma prototype with your three plans + “Choose Plan” CTA, and test it via qualitative plan. (Option 2)",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-10-02.md",
      "source_date": "2025-12-10",
      "doc_type": "one_on_one",
      "matched_topics": [
        "new ventures",
        "factor form",
        "vms",
        "otp"
      ],
      "matched_people": [
        "deo",
        "hamed",
        "daniel",
        "nikita"
      ],
      "filter_score": 8
    }
  ],
  "doc_count": 2,
  "total_chars": 45740
}