{
  "batch_id": "other_022",
  "doc_type": "other",
  "documents": [
    {
      "title": "LEGO: Unified Prospects Checkout Features and Layout for Meal Brands",
      "doc_id": "1dnd_dG5JhrqzfoYcS5ZteosMyOzs6jgaUPmBc8GMpts",
      "link": "https://docs.google.com/document/d/1dnd_dG5JhrqzfoYcS5ZteosMyOzs6jgaUPmBc8GMpts/edit?usp=drivesdk",
      "content": "﻿LEGO: Unified Prospects Checkout Features and Layout for Meal Brands\n\n\n\n\n\n1. Goal\n\n\n\n\n\nOur goal is to create a single, unified prospects checkout layout with standardized features that will work centrally for all Mealkit brands (HelloFresh, GreenChef, EveryPlate, and ChefsPlate) and RTE brands (Factor and Youfoodz).[a][b][c][d][e]\n\n\n\n\n\nCheckout is a critical phase in the acquisition funnel where users register or log in, provide their address, select delivery options, and add payment details.\n\nUnified feature is a shared component that can operate across multiple countries, brands, and user journeys. Once implemented, any new functionality built on this Feature is automatically available wherever the feature is deployed, ensuring consistency across the board. Features list are available on the portal: https://www-staging.hellofresh.com/features?f=DeliverySummaryFeature\n\nModular checkout is the checkout code setup, which consists of  independent, reusable unified Features.\n\nCheckout layout is a structure for how elements are interconnected as part of it.\n\n\n\n\n\nRTE - Ready-to-Eat Brands (Factor, Youufoodz)\n\nWLMK/New Mealkits - Mealkit brands (GreenChef, EveryPlate, and ChefsPlate)\n\n\n\n\n\n\n\n\n\n2. Problem Statement\n\n\n\n\n\nThe HelloFresh Group has expanded to 8 brands across 18 countries, which requires scalable solutions to avoid isolated work efforts. The prospects checkout process to purchase subscription can be identical across all brands and products, which makes it the first user experience that can be standardized and managed centrally.\n\n\n\n\n\nIn January 2025, the activation user journey scope was transferred from TAM Alliance to Growth Alliance to centralize Checkout ownership within one team. Two brands, GoodChop and Pets Table, remain in TAM. Scope now increased to 31 distinct codes to manage (18 in HelloFresh with 6 in New Mealkits and 7 in RTE added on top). To scale further and grow sustainably, a strong foundation is needed. HelloFresh has set an 2025 objective #1 to accelerate product development velocity for Ready-to-eat (RTE) brands by distributing ownership of core customer journeys across the consumer-facing-alliances (CFAs).\n\n\n\n\n\nThe Reduce Effort Needed to Checkout strategy initiated in 2024 involved refactoring the HelloFresh checkout into a modular checkout with unified features. By the end of 2024, the scope expanded to include RTE and WLML, aiming to unify features across all meal brands. More details are in Modular Checkout. The goal for H1-2025 is to complete feature modularization and unify the layouts for all meal brands. The new checkout layout will use the technical format that was created during the Single Page Checkout initiative. More details in Single Page Checkout: Experiment Results \n\n\n\n\n\nQuick Status Overview (more details are in APPENDIX A [ROADMAP])\n\n\n\n\n\nCheckout Features Rollout Statuses:\n\n\n\n\n\nFeature\n\n\tHF\n\n\tRTE (Factor & Youfoodz) & WLMK (GreenChef, EveryPlate, and ChefsPlate)\n\n\tOrder Summary Feature\n\n\t✅Rolled out\n\n\t✅Rolled out\n\n\tRegister Form Feature\n\n\t🟣Experiment Re-Launch\n\n\t✅Rolled out\n\n\tSocial Logins Feature\n\n\t🟣Experiment Re-Launch\n\n\t⚪️ Neutral Results, No Rollout\n\n\tAddress Form Feature\n\n\t✅Rolled out\n\n\t✅Rolled out\n\n\tDelivery Details Feature\n\n\t✅Rolled out Mobile\n\n\t✅Rolled out Mobile: Neutral Results\n\n\tPayment Methods\n\n\t✅Rolled out\n\n\t✅Rolled out Factor US\n\n\tUnified Layout - Lego Checkout\n\n\t✅Rolled out\n\n\n\n\n\n\t✅Rolled out\n\n\t\n\n\n\n\n\n\n\n3. Impact of Modular Checkout Features and Shared Layout\n\nThis initiative modularizes HelloFresh, RTE, and New Mealkits (GreenChef, Chefs Plate, Every Plate) Checkouts with Feat\n\n\n\n UFI-9680: Integrate with New Progress bar\n\nCompleted ETA Mar 28, 2025\n\n\tRemove invalid voucher from payload after first checkout attempt \n\n\tUse Control Logic\n\n\t      * Remove Invalid voucher before making OPS call/query params UFI-9678 Completed ETA Mar 28, 2025\n\n\tRedirect to plans page or register if not logged in or no plan selected \n\n\tUse Control Logic\n\n\t      * Add check for logged-in user/cart-id and redirect UFI-9682: Add check for logged-in user/cart-id and redirect Completed ETA Mar 28, 2025\n\n\t\n\n\n\n\t\n\n\n\n\t      * UFI-9686: Add lego-checkout applanga group for caching Completed\n\n      * UFI-9693: Check requirement for CTA sticky-ness Not Started\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[a]NV not mentioned, despite accounting for ±$250M in annual revenue in 2025, planned $300M+ in 2026\n\n[b]Original scope did not include NV, focusing on mealkits and RTE brands unification\n\n[c]@nikita.gorshkov@hellofresh.com how would this work for NV? You have completely different features in your conversion funnels and the reuse of the same components across all brands is part of this initiative\n\n[d]So, looking at the checkout features below, the majority of them are the same. While we have some additional features such as welcome kits and trial boxes, I think those can be built as additional components within Lego, no?\n\n[e]Of course they can be built but would need to be ready for us to launch lego as well as all differences in areas like Logistics and Fraud, for example. We've been testing for 6 months across HF and Factor and are still adding/fixing things because of all the custom logic, so this will not be an easy addition. But we can definitely assist your team in adopting Lego\n\n[f]@anupam.maurya@hellofresh.com let's add the ticket in the Epic for the items which will need to be moved to Features still.\n\n_Assigned to anupam.maurya@hellofresh.com_\n\n[g]@anupam.maurya@hellofresh.com for our layout work we would need to build this one in too right? Did you consider it in the broken down tickets?\n\n_Assigned to anupam.maurya@hellofresh.com_\n\n[h]@harneet.singh@hellofresh.com what is the status here?\n\n_Assigned to harneet.singh@hellofresh.com_\n\n[i]US experiment is currently live. Rollout decision to be made mid-March\n\n[j]@anupam.maurya@hellofresh.com to add a spike\n\n_Assigned to anupam.maurya@hellofresh.com_",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-23-.md",
      "source_date": "2025-12-23",
      "doc_type": "other",
      "matched_topics": [
        "goodchop",
        "pets table"
      ],
      "matched_people": [
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "IXI Results: Creator Marketplace Customer Interviews",
      "doc_id": "1TQbbdGdYmSTYpNycSvHsAW8JP8l0EWBi--vW7X0CbU0",
      "link": "https://docs.google.com/document/d/1TQbbdGdYmSTYpNycSvHsAW8JP8l0EWBi--vW7X0CbU0/edit?usp=drivesdk",
      "content": "﻿Research Results\n\nExecutive Summary: \n\nResearch participants responded very positively to the Influencer Marketplace concept, viewing it as a compelling way to turn social media food inspiration into achievable home cooking. The concept resonates because it directly addresses two major friction points: difficulty sourcing niche ingredients, due to cost, waste, and effort, and the common habit of saving recipes that are later forgotten in overcrowded digital collections.\n\nTrust in recipes is driven less by influencer status[a] and more by practical signals of feasibility, including strong visuals, clear instructions, and access to the original social media content for verification. Participants place significant responsibility on HelloFresh to ensure recipe quality, either through internal testing and approval or, if full vetting is not feasible, through transparent and prominent community ratings and reviews.\n\nThe marketplace is perceived primarily as an occasion-based solution rather than a replacement for everyday meal planning. Participants most strongly associate it with dinner and special occasions such as weekends or hosting, with limited interest in breakfast or lunch use cases. To encourage trial and adoption, users strongly prefer a low-commitment purchasing model, favoring one-time purchases over subscription requirements.[b]\n\nDiscovery expectations are food-first rather than creator-led, with users wanting to browse and search by ingredient or cuisine instead of influencer names. Finally, participants expressed a need for more robust recipe management tools, including custom organization and scheduling features, to ensure saved recipes resurface at the right time and translate into actual cooking behavior.\n\nRecommendations:\n\nTopic\n\n\tConcern\n\n\tRecommendation\n\n\tBuilding Creator Trust\n\n\tIn this marketplace, users may find it challenging to evaluate creators in the same ways they do on social media. \n\n\t* Direct Links to Original Videos: To foster greater trust in creators, half of participants (4 out of 8) suggested the inclusion of direct links on recipe pages. These links should lead back to the influencer's original social media video, providing direct visual instruction and making it simpler for users to verify and find their content.\n\n\tRecipe Vetting\n\n\tParticipants generally expressed skepticism about recipe reliability from unverified creators, with the majority expecting HelloFresh to act as a \"safety net\" by vetting recipes for safety and feasibility. Without HelloFresh vetting all recipes, users need to be able to have the information to evaluate the recipes themselves.\n\n\t* Verified Badge: If HelloFresh chooses to quality test any of the recipes, a visual distinction like a tag or a badge should indicate which recipes have been tested by HelloFresh chefs, in contrast to unverified user-uploaded content.\n\n* Unfiltered Reviews: Users desire a transparent review system that includes recipe ratings, customer feedback, and photos. This system should allow users to view any negative feedback or potential issues, helping them determine the trustworthiness of a recipe creator. \n\n* Recipe Comments or Q&A: Participants indicated a need for a comment or Q&A section, separate from a typical review system. This feature would allow them to see and address challenges or questions raised by other users before they begin cooking, increasing their confidence in the recipe's quality and preparedness.\n\n\n\n\n\n\tPurchase Models\n\n\tParticipants viewed a forced subscription as a financial and psychological barrier to trying influencer recipes, w\n\n\n\nhich one was the one\").\n\n      * Evidence: \"Being able to just organize them and group them together... having like a section, like, I really want to try this... filter them like, okay, these are my top ones\" .\n\nCreator Link-Outs\n\n      * What she wants: Links on the recipe page that go directly to the creator's social media video (TikTok/YouTube).\n\n      * Why she recommends it: She wants to see the visual proof of the recipe being made.\n\n      * Evidence: \"You can click on it and it takes you to their TikTok of the recipe... being able to see a short video of someone, like creating something that really helps\"\n\n[a]@katheryn.eckles@hellofresh.com this is interesting, I feel in the food bubble, people follow mainly for content and less because they like the person/brand\n\n[b]What we need to figure out here is: Whats the actual value the marketplace provides to the user? If its not the influencers, why are we not just going for a OTP in HF instead?\n\n[c]this is an argument toward my previous comment, but this would be the perfect result, to find every recipe online in hf marketplace as a purchasable option\n\n[d]Create clip, main barrier to cooking influencer recipes\n\n[e]Video: Include clips of those assuming HF responsibility, splitting the responsibility, and those around ratings/reviews.\n\n[f]@linnea.siersma@hellofresh.ca\n\n[g]@katheryn.eckles@hellofresh.com nice idea, i will forward this to DAU :D\n\n[h]1 total reaction\n\nAnnette MvdE reacted with 😯 at 2025-12-10 14:22 PM\n\n[i]1 total reaction\n\nAnnette MvdE reacted with 🔥 at 2025-12-10 14:22 PM\n\n[j]@katheryn.eckles@hellofresh.com nice, same idea we had in the prototypes\n\n[k]Yeah we are hearing a lot of what we were already thinking about, which is a good sign we are on the right track!\n\n[l]1 total reaction\n\nAnnette MvdE reacted with 👍 at 2025-12-10 14:46 PM\n\n[m]1 total reaction\n\nAnnette MvdE reacted with 👍 at 2025-12-10 14:46 PM\n\n[n]we had this idea in our miroboard as well\n\n[o]@linnea.siersma@hellofresh.ca @cole@hellofresh.ca this is an interesting idea\n\n[p]Epicurious commentary on recipes is hugely valuable; this makes sense to me\n\n[q]@linnea.siersma@hellofresh.ca\n\n[r]I think we can solve this issue with digital curation // personalization. But probably also good to have a clean-up if a recipe gets no engagement for a long period of time.\n\n[s]1 total reaction\n\nLinnea Siersma reacted with ✍️ at 2025-12-11 17:12 PM",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-16-.md",
      "source_date": "2025-12-16",
      "doc_type": "other",
      "matched_topics": [
        "otp",
        "one-time purchase"
      ],
      "matched_people": [],
      "filter_score": 2
    },
    {
      "title": "IXI Results: Creator Marketplace Customer Interviews",
      "doc_id": "1TQbbdGdYmSTYpNycSvHsAW8JP8l0EWBi--vW7X0CbU0",
      "link": "https://docs.google.com/document/d/1TQbbdGdYmSTYpNycSvHsAW8JP8l0EWBi--vW7X0CbU0/edit?usp=drivesdk",
      "content": "﻿Research Results\n\nExecutive Summary: \n\nResearch participants responded very positively to the Influencer Marketplace concept, viewing it as a compelling way to turn social media food inspiration into achievable home cooking. The concept resonates because it directly addresses two major friction points: difficulty sourcing niche ingredients, due to cost, waste, and effort, and the common habit of saving recipes that are later forgotten in overcrowded digital collections.\n\nTrust in recipes is driven less by influencer status[a][b] and more by practical signals of feasibility, including strong visuals, clear instructions, and access to the original social media content for verification. Participants place significant responsibility on HelloFresh to ensure recipe quality, either through internal testing and approval or, if full vetting is not feasible, through transparent and prominent community ratings and reviews.\n\nThe marketplace is perceived primarily as an occasion-based solution rather than a replacement for everyday meal planning. Participants most strongly associate it with dinner and special occasions such as weekends or hosting, with limited interest in breakfast or lunch use cases. To encourage trial and adoption, users strongly prefer a low-commitment purchasing model, favoring one-time purchases over subscription requirements.[c][d]\n\nDiscovery expectations are food-first rather than creator-led, with users wanting to browse and search by ingredient or cuisine instead of influencer names. Finally, participants expressed a need for more robust recipe management tools, including custom organization and scheduling features, to ensure saved recipes resurface at the right time and translate into actual cooking behavior.\n\nRecommendations:\n\nTopic\n\n\tConcern\n\n\tRecommendation\n\n\tBuilding Creator Trust\n\n\tIn this marketplace, users may find it challenging to evaluate creators in the same ways they do on social media. \n\n\t* Direct Links to Original Videos: To foster greater trust in creators, half of participants (4 out of 8) suggested the inclusion of direct links on recipe pages. These links should lead back to the influencer's original social media video, providing direct visual instruction and making it simpler for users to verify and find their content.\n\n\tRecipe Vetting\n\n\tParticipants generally expressed skepticism about recipe reliability from unverified creators, with the majority expecting HelloFresh to act as a \"safety net\" by vetting recipes for safety and feasibility. Without HelloFresh vetting all recipes, users need to be able to have the information to evaluate the recipes themselves.\n\n\t* Verified Badge: If HelloFresh chooses to quality test any of the recipes, a visual distinction like a tag or a badge should indicate which recipes have been tested by HelloFresh chefs, in contrast to unverified user-uploaded content.\n\n* Unfiltered Reviews: Users desire a transparent review system that includes recipe ratings, customer feedback, and photos. This system should allow users to view any negative feedback or potential issues, helping them determine the trustworthiness of a recipe creator. \n\n* Recipe Comments or Q&A: Participants indicated a need for a comment or Q&A section, separate from a typical review system. This feature would allow them to see and address challenges or questions raised by other users before they begin cooking, increasing their confidence in the recipe's quality and preparedness.\n\n\n\n\n\n\tPurchase Models\n\n\tParticipants viewed a forced subscription as a financial and psychological barrier to trying influencer reci\n\n\n\nlike creating something that really helps\"\n\n[a]@katheryn.eckles@hellofresh.com this is interesting, I feel in the food bubble, people follow mainly for content and less because they like the person/brand\n\n[b]It seems like it, at least with these customers who are looking for recipe inspiration online.\n\n[c]What we need to figure out here is: Whats the actual value the marketplace provides to the user? If its not the influencers, why are we not just going for a OTP in HF instead?\n\n[d]I would argue that while random creators they don't know aren't the main driver that excites them, the variety, creativity, and uniqueness of creator made recipes is the exciting part for them. Additionally, the creators they do know, follow, and trust are the ones that excite them the most to purchase recipes from. \n\n\n\n\n\nI think if we just did OTP and removed the creator element completely, we would definitely be missing the drivers that make this concept interesting.\n\n[e]this is an argument toward my previous comment, but this would be the perfect result, to find every recipe online in hf marketplace as a purchasable option\n\n[f]Create clip, main barrier to cooking influencer recipes\n\n[g]Video: Include clips of those assuming HF responsibility, splitting the responsibility, and those around ratings/reviews.\n\n[h]@linnea.siersma@hellofresh.ca\n\n[i]@katheryn.eckles@hellofresh.com nice idea, i will forward this to DAU :D\n\n[j]1 total reaction\n\nAnnette MvdE reacted with 😯 at 2025-12-10 14:22 PM\n\n[k]1 total reaction\n\nAnnette MvdE reacted with 🔥 at 2025-12-10 14:22 PM\n\n[l]@katheryn.eckles@hellofresh.com nice, same idea we had in the prototypes\n\n[m]Yeah we are hearing a lot of what we were already thinking about, which is a good sign we are on the right track!\n\n[n]1 total reaction\n\nAnnette MvdE reacted with 👍 at 2025-12-10 14:46 PM\n\n[o]1 total reaction\n\nAnnette MvdE reacted with 👍 at 2025-12-10 14:46 PM\n\n[p]we had this idea in our miroboard as well\n\n[q]@linnea.siersma@hellofresh.ca @cole@hellofresh.ca this is an interesting idea\n\n[r]Epicurious commentary on recipes is hugely valuable; this makes sense to me\n\n[s]@linnea.siersma@hellofresh.ca\n\n[t]I think we can solve this issue with digital curation // personalization. But probably also good to have a clean-up if a recipe gets no engagement for a long period of time.\n\n[u]1 total reaction\n\nLinnea Siersma reacted with ✍️ at 2025-12-11 17:12 PM",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-17-.md",
      "source_date": "2025-12-17",
      "doc_type": "other",
      "matched_topics": [
        "otp",
        "one-time purchase"
      ],
      "matched_people": [],
      "filter_score": 2
    },
    {
      "title": "Offshore Contractor Agencies",
      "doc_id": "19mCh7PbyRqQVHUjwSm40jxcI_vdWDRkSAN-nKnpEcIQ",
      "link": "https://docs.google.com/document/d/19mCh7PbyRqQVHUjwSm40jxcI_vdWDRkSAN-nKnpEcIQ/edit?usp=drivesdk",
      "content": "﻿Offshore Contractor Agencies\n\n\n\n\n\n\n\n\n\nAgencies & POCs:\n\n1. Activate Talent: Joe Sanchez (joe@activatetalent.com) \n\n2. Global Talent: Gugu Nyoni (gugu@globaltalent.co)\n\n3. Hire with Near: Camila Bagnati (camila@hirewithnear.com)\n\n\n\n\n\n\n\n\n\nKey terms:\n\n1. Activate Talent: From July 23rd 2025, they agreed to a 25% commission % (this is confidential) and this should be listed on the agreement\n\n2. Global Talent: % commission not shared although they said it varies by country\n\n   1. Reduced Bolivia commission % from 33% to 31%\n\n3. Hire with Near:\n\n   1. Subscription fees:\n\n      1. If non exclusive: Contractor salary +30%\n\n      2. With 45 day exclusivity: Contractor salary +25% (minimum US $650)\n\n      3. Minimum Monthly Subscription Fee (Per Worker): $750.00 USD\n\n   2. Buyout Fee: 30% of the Contingent Worker’s gross annual base compensation (Minimum Buyout Fee: $6,000.00 USD). No buyout fee if 12 months after worker started\n\n\n\n\n\nTips for working with agencies:\n\n* Align at the start on level, salary and skills required\n\n* Engage at least 2 agencies to increase the talent pool\n\n* Ask each agency to send a minimum of 5 CVs and ideally closer to 10 per role so you have a good shortlist to choose from\n\n\n\n\n\nContractor IT equipment:\n\nContractors to use personal IT equipment where possible - otherwise there are complexities with returning the asset if it’s purchased by the company. If necessary, we can support with IT equipment although the process differs by agency:\n\n1. Activate Talent:\n\n   1. We share our preferred device model / specifications with Activate Talent. They offer two options:\n\n      1. Reimbursement Model: The specialist purchases the required equipment out-of-pocket and submits the receipt to Activate Talent for full reimbursement\n\n      2. Upfront Disbursement: Activate Talent provides the specialist with the funds in advance, and they send us the receipt as proof of purchase after the transaction\n\n   2. Once the equipment has been purchased, Activate Talent includes the cost in the next invoice to us\n\n2. Global Talent:\n\n   1. Use personal laptop\n\n   2. Sponsor Chat GPT premium account\n\n3. Hire with Near:\n\n   1. Local Hardware Procurement: Near handles local purchases via LATAM-based vendors. You share us the equipment specifications → we purchase + ship directly to the candidate’s address.\n\n   2. Delivery Timeline: ~10 business days from order to arrival (can be faster, but plan with buffer).\n\n   3. Onboarding/Setup Process: We can configure devices with any software/settings you need before shipping. Our IT team is available to align with yours.\n\n   4. Payments: Once the equipment quote is approved, we'll send you an invoice, and payment will be made directly to Near.\n\n   5. Post-Engagement Hardware Handling:\n\n   6. Return/repurpose options\n\n      1. Transfer to a new hire in-country\n\n      2. Add a clause for team member to retain device and compensate accordingly\n\n      3. Avoid international returns\n\n      4. Option to use our vendor’s BuyBack Clause for credit toward future purchases\n\n\n\n\n\nPerformance reviews, merit salary increases & promotions:\n\n1. Activate Talent & Global Talent:\n\n   1. Performance reviews & ratings:\n\n      1. Include contractors in mid year and EoY performance review process\n\n      2. Use our performance review forms\n\n      3. Only employees with >4 months tenure by mid year or year end included in process\n\n      4. HR BP (Abi) to manage this process by including contractors in process and forms as well as sharing completed forms with Activate Talent and Global Talent. Contacts:\n\n         * Gugu Nyoni g\n\n\n\n. Decision to promote sits with Pets Table\n\n      2. Inform agency if we’d like to promote a contractor so they can align internally, update her title contractually, and assign her other internal adjustments\n\n      3. They require an updated JD for any promotions\n\n      4. Process ownership:\n\n         * Managers to share with C Level if they think their contractor may be promoted (if performance is strong & continues to be strong) in next 12 months\n\n         * Contractor performance and upcoming promotion windows in next 6-12 months to be brought up and discussed in Promotion Committee meeting (LG, DZ, AC - LG as owner of process)\n\n2. Near:\n\n   1. Process not defined yet as no contractors hired with Near yet\n\n\n\n\n\n\n\n\n\nBenefits:\n\n\n\n\n\n1. Activate Talent: Standard benefits for contractors below:\n\n   1. Paid Time Off (PTO):\n\n      1. 12 Regular PTOs: Accrued at 1 credit per full month worked\n\n      2. 3 Holiday PTOs: Aligned with the contractor’s local/national holidays\n\n      3. 3 Sick Leave Days: For recovery from illness or injury\n\n      4. 3 Bereavement Leave Days: For time off due to the loss of a close family member or loved one\n\n      5. Carry-over Policy: Up to 3 unused PTO credits from the previous calendar year may be carried over\n\n   2. Healthcare Support:\n\nHealthcare coverage varies depending on the contractor’s country or region. In general, we offer a one-time disbursement or reimbursement of a fixed amount per year to help cover healthcare or insurance-related expenses\n\n   3. Promotions: Supports internal promotions. Process typically begins with a performance evaluation in coordination with the client. Once there’s alignment on the specialist’s growth and readiness for expanded responsibilities, we work with both the client and the specialist to formalize the new role title, updated scope, and compensation adjustments accordingly\n\n   2. Near:\n\n   1. Can support with office space, HR support, health insurance, IT\n\n\n\n\n\nContractors from each agency:\n\n   1. Activate Talent:\n\n   1. Magdalena Aliste\n\n   2. Sofia Pedraza Chirolla\n\n   3. Harsh Maheshwari\n\n   2. Global Talent:\n\n   1. Daniela Laks\n\n   2. Andy Saravia Claure\n\n   3. HelloConnect:\n\n   1. Rayniel Lucero\n\n\n\n\n\n\n\n\n\n\n\n\n\n   * Argentina:\n\n   * Inflation Rate:\n\n   * 2025: 31.3% in October 2025\n\n   * USD to ARS\n\n   * 2025: +43%\n\n   * 2025 Dec 1: 1 ARS = 0.000690491\n\n   * 2024 Dec 1: 1 ARS = 0.000990098",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-.md",
      "source_date": "2025-12-05",
      "doc_type": "other",
      "matched_topics": [
        "pets table"
      ],
      "matched_people": [],
      "filter_score": 1
    },
    {
      "title": "2nd iteration of new T&Cs for Activation/Reactivation",
      "doc_id": "18IOxx1uuj7FLL7KyBdGRO_BoGPaQ0VIXNz4d6lnyW64",
      "link": "https://docs.google.com/document/d/18IOxx1uuj7FLL7KyBdGRO_BoGPaQ0VIXNz4d6lnyW64/edit?usp=drivesdk",
      "content": "﻿Privileged & confidential - created at the request of legal counsel\n\nPrivileged & Confidential - Prepared at the direction of Legal \n\nFriendly T&C Project\n\nControl: \n\nDesktop:\n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy and, unless I cancel, the weekly auto-renewal price of $70.93 after my discount period ends. Easily cancel your subscription through your account 5 days prior to delivery.\n\nMobile: \n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy and, after my discount period ends, the weekly auto-renewal price of $69.93. Cancel your subscription through your account at least 5 days prior to your next delivery.\n\n\n\n\n\nProposal 1: [a]\n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy, and that my plan will auto-renew and authorize HelloFresh to charge my account $70.93 each week after the discount period unless I cancel. I can easily cancel my plan through my account anytime before my next billing date to avoid future charges.\n\n\n\n\n\nProposal 2: \n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy, that my plan will auto-renew, and authorize HelloFresh to charge my account $70.93 each week after the discount period, unless I cancel my plan through my account anytime before my next billing date.\n\n\n\n\n\nProposal 3:\n\nBy clicking “Place order & select meals'' I agree to the Terms and Conditions and the Privacy Policy. I understand that I can skip, modify or cancel my weekly auto-renewing plan through my account anytime before my next billing date. After my discount period ends, I agree to the members-only price[b] of $70.93 for boxes you don’t skip.\n\n\n\n\n\nProposal 4:[c]\n\nBy clicking “Place order & select meals,” I agree to the Terms & Conditions, the Privacy Policy, and an auto-renewing plan that authorizes HelloFresh to charge my account $70.93 each week after the discount period. I can easily cancel in my account anytime before my next billing date to avoid future charges.\n\n\n\n\n\nProposal 5:\n\nBy clicking “Place order & select meals,” I agree to the Terms & Conditions, the Privacy Policy and to be enrolled in a plan that automatically charges my account $70.93 each week after the discount period ends. I can easily cancel in my account anytime before my next billing date to avoid future charges.\n\n\n\n\n\nProposal 6:\n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy and, after my discount period, the weekly auto-renewal price of $70.93, unless I cancel my plan through my account before my next billing date.[d][e][f][g]\n\n\n\n\n\nProposal 7: \n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy and, after my discount period, the weekly auto-renewal price of $70.93. I can cancel my plan anytime in my account before my next billing date.[h][i][j][k]\n\n\n\n\n\n\n\n\n\nNew T&C Disclaimers for Activation / Reactivation\n\n1. Context from Legal team\n\n2. Results of the first round of testing\n\n   1. Variations tested and results\n\n   2. Reasons for Design choices - feedback from Legal\n\n   3. Reliability of data checks\n\n3. Competitor Benchmarking\n\n4. Proposals for the next iteration\n\nContext from the Legal team\n\nUpcoming FTC Negative Option Rule (Federal Register :: Negative Option Rule, rule starts at 24734)\n\n\n\n\n\nSUMMARY: dramatic expansion of current requirements for auto-renewing subscriptions, which we have been working with industry groups to push back, via comments submitted to FTC.\n\n\n\n brief analysis here?\n\n_Assigned to thomas.cohn@hellofresh.com_\n\n[aw]Variation 5: FBFL here would violate the draft Rule, which prohibits including any information that “interferes with, detracts from, contradicts, or otherwise undermines the consumer's ability to provide express informed consent.”\n\n[ax]@thomas.cohn@hellofresh.com Same for this\n\n_Assigned to thomas.cohn@hellofresh.com_\n\n[ay]@thomas.cohn@hellofresh.com @dalia.eid@hellofresh.com what can we do here in terms of value props\n\n_Assigned to thomas.cohn@hellofresh.com_\n\n[az]Q in to outside counsel\n\n[ba]Feedback from outside counsel: Defensible position as long as value prop relates to the subscription (element or term of subscription) (but not only a marketing value prop, for example, could not say \"save 30%).\n\n[bb]Could alternatively state \"cancel anytime\" as a value prop\n\n[bc]Thank you! What about something like \"we will remind you via email before auto-renewal\"?\n\n[bd]Yes, that is an autorenew element/term\n\n[be]@thomas.cohn@hellofresh.com @dalia.eid@hellofresh.com\n\n[bf]Sticky CTA variation\n\n[bg]defensible, considered compliant by outside counsel\n\n[bh]@dalia.eid@hellofresh.com @thomas.cohn@hellofresh.com can we say \"slide to agree & select meals\"\n\n_Assigned to dalia.eid@hellofresh.com_\n\n[bi]considered defensible/compliant by outside counsel\n\n[bj](1) Change \"Do you Agree with our Terms &Conditions\" to \"How our Subscription Work\"  and also (2) change \"by clicking  checkout\" to \"by clicking \"place order & select meals\".\n\n[bk]More variations added here @thomas.cohn@hellofresh.com @dalia.eid@hellofresh.com\n\n[bl]considered compliant/defensible by outside counsel\n\n[bm]as mentioned above: can we find markets where such a rule is already in effect and we can find inspiration\n\n[bn]@naseem.hasan@hellofresh.com didn't they also have a slider?\n\n[bo]They use the slide button for a one-time purchase when you hit \"Buy Now\" on an item.\n\n[bp]Interesting, so exactly the opposite of the new rule requirement 🤔\n\n[bq]@naseem.hasan@hellofresh.com could you add this here as well as an example? I can't find the figma link anymore, sorry\n\n1 total reaction\n\nNaseem Hasan reacted with 👍 at 2023-11-20 21:12 PM\n\n[br]Note that Amazon Prime is currently under FTC investigation for auto-renewal subscription disclosures and should not assume that current process is compliant\n\n[bs]I like marley spoon's \"easily cancel\" vs just \"cancel\"",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-05.md",
      "source_date": "2025-12-09",
      "doc_type": "other",
      "matched_topics": [
        "one-time purchase"
      ],
      "matched_people": [],
      "filter_score": 1
    },
    {
      "title": "2nd iteration of new T&Cs for Activation/Reactivation",
      "doc_id": "18IOxx1uuj7FLL7KyBdGRO_BoGPaQ0VIXNz4d6lnyW64",
      "link": "https://docs.google.com/document/d/18IOxx1uuj7FLL7KyBdGRO_BoGPaQ0VIXNz4d6lnyW64/edit?usp=drivesdk",
      "content": "﻿Privileged & confidential - created at the request of legal counsel\n\nPrivileged & Confidential - Prepared at the direction of Legal \n\nFriendly T&C Project\n\nControl: \n\nDesktop:\n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy and, unless I cancel, the weekly auto-renewal price of $70.93 after my discount period ends. Easily cancel your subscription through your account 5 days prior to delivery.\n\nMobile: \n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy and, after my discount period ends, the weekly auto-renewal price of $69.93. Cancel your subscription through your account at least 5 days prior to your next delivery.\n\n\n\n\n\nProposal 1: [a]\n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy, and that my plan will auto-renew and authorize HelloFresh to charge my account $70.93 each week after the discount period unless I cancel. I can easily cancel my plan through my account anytime before my next billing date to avoid future charges.\n\n\n\n\n\nProposal 2: \n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy, that my plan will auto-renew, and authorize HelloFresh to charge my account $70.93 each week after the discount period, unless I cancel my plan through my account anytime before my next billing date.\n\n\n\n\n\nProposal 3:\n\nBy clicking “Place order & select meals'' I agree to the Terms and Conditions and the Privacy Policy. I understand that I can skip, modify or cancel my weekly auto-renewing plan through my account anytime before my next billing date. After my discount period ends, I agree to the members-only price[b] of $70.93 for boxes you don’t skip.\n\n\n\n\n\nProposal 4:[c]\n\nBy clicking “Place order & select meals,” I agree to the Terms & Conditions, the Privacy Policy, and an auto-renewing plan that authorizes HelloFresh to charge my account $70.93 each week after the discount period. I can easily cancel in my account anytime before my next billing date to avoid future charges.\n\n\n\n\n\nProposal 5:\n\nBy clicking “Place order & select meals,” I agree to the Terms & Conditions, the Privacy Policy and to be enrolled in a plan that automatically charges my account $70.93 each week after the discount period ends. I can easily cancel in my account anytime before my next billing date to avoid future charges.\n\n\n\n\n\nProposal 6:\n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy and, after my discount period, the weekly auto-renewal price of $70.93, unless I cancel my plan through my account before my next billing date.[d][e][f][g]\n\n\n\n\n\nProposal 7: \n\nBy clicking “Place order & select meals,” I agree to the Terms and Conditions, the Privacy Policy and, after my discount period, the weekly auto-renewal price of $70.93. I can cancel my plan anytime in my account before my next billing date.[h][i][j][k]\n\n\n\n\n\n\n\n\n\nNew T&C Disclaimers for Activation / Reactivation\n\n1. Context from Legal team\n\n2. Results of the first round of testing\n\n   1. Variations tested and results\n\n   2. Reasons for Design choices - feedback from Legal\n\n   3. Reliability of data checks\n\n3. Competitor Benchmarking\n\n4. Proposals for the next iteration\n\nContext from the Legal team\n\nUpcoming FTC Negative Option Rule (Federal Register :: Negative Option Rule, rule starts at 24734)\n\n\n\n\n\nSUMMARY: dramatic expansion of current requirements for auto-renewing subscriptions, which we have been working with industry groups to push back, via comments submitted to FTC.\n\n\n\n brief analysis here?\n\n_Assigned to thomas.cohn@hellofresh.com_\n\n[aw]Variation 5: FBFL here would violate the draft Rule, which prohibits including any information that “interferes with, detracts from, contradicts, or otherwise undermines the consumer's ability to provide express informed consent.”\n\n[ax]@thomas.cohn@hellofresh.com Same for this\n\n_Assigned to thomas.cohn@hellofresh.com_\n\n[ay]@thomas.cohn@hellofresh.com @dalia.eid@hellofresh.com what can we do here in terms of value props\n\n_Assigned to thomas.cohn@hellofresh.com_\n\n[az]Q in to outside counsel\n\n[ba]Feedback from outside counsel: Defensible position as long as value prop relates to the subscription (element or term of subscription) (but not only a marketing value prop, for example, could not say \"save 30%).\n\n[bb]Could alternatively state \"cancel anytime\" as a value prop\n\n[bc]Thank you! What about something like \"we will remind you via email before auto-renewal\"?\n\n[bd]Yes, that is an autorenew element/term\n\n[be]@thomas.cohn@hellofresh.com @dalia.eid@hellofresh.com\n\n[bf]Sticky CTA variation\n\n[bg]defensible, considered compliant by outside counsel\n\n[bh]@dalia.eid@hellofresh.com @thomas.cohn@hellofresh.com can we say \"slide to agree & select meals\"\n\n_Assigned to dalia.eid@hellofresh.com_\n\n[bi]considered defensible/compliant by outside counsel\n\n[bj](1) Change \"Do you Agree with our Terms &Conditions\" to \"How our Subscription Work\"  and also (2) change \"by clicking  checkout\" to \"by clicking \"place order & select meals\".\n\n[bk]More variations added here @thomas.cohn@hellofresh.com @dalia.eid@hellofresh.com\n\n[bl]considered compliant/defensible by outside counsel\n\n[bm]as mentioned above: can we find markets where such a rule is already in effect and we can find inspiration\n\n[bn]@naseem.hasan@hellofresh.com didn't they also have a slider?\n\n[bo]They use the slide button for a one-time purchase when you hit \"Buy Now\" on an item.\n\n[bp]Interesting, so exactly the opposite of the new rule requirement 🤔\n\n[bq]@naseem.hasan@hellofresh.com could you add this here as well as an example? I can't find the figma link anymore, sorry\n\n1 total reaction\n\nNaseem Hasan reacted with 👍 at 2023-11-20 21:12 PM\n\n[br]Note that Amazon Prime is currently under FTC investigation for auto-renewal subscription disclosures and should not assume that current process is compliant\n\n[bs]I like marley spoon's \"easily cancel\" vs just \"cancel\"",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-10-.md",
      "source_date": "2025-12-10",
      "doc_type": "other",
      "matched_topics": [
        "one-time purchase"
      ],
      "matched_people": [],
      "filter_score": 1
    },
    {
      "title": "TAM Product: Context-driven Product Management Cheat Sheet",
      "doc_id": "1kui7j2A6Ry2s1RbzRqBTWmH3GUWw5Ba3cLlOLAQO60Q",
      "link": "https://docs.google.com/document/d/1kui7j2A6Ry2s1RbzRqBTWmH3GUWw5Ba3cLlOLAQO60Q/edit?usp=drivesdk",
      "content": "﻿TAM Product: Context-driven Product Management Cheat Sheet\n\n\tSummary: This document summarizes the TAM Product: Context-driven Product Managementdocument into an easily digestible format to enable comprehension and easy understanding. Please refer to the core document for in-depth processes schematics or simply ask the NotebookLM\n\n\tCreated At: Sep 16, 2025\n\n\tLast Updated: Sep 16, 2025\n\n\tStatus: Review\n\n\tAuthor: Nikita Gorshkov\n\n\tAI Use: Yes\n\n\tContributors: \n\n\tBased On: TAM Product: Context-driven Product Management\n\n\t\n\n\n\n1. tl;dr\n\nContext-driven Product Management is a GenAI-forward framework that redefines the role of the product manager to be the central \"owner of context.\" As generative AI automates many traditional product management tasks—such as writing first-draft user stories, summarizing research, and creating project plans—the product manager's primary responsibility shifts from creating detailed, static documentation to curating and maintaining a rich, dynamic, and machine-readable \"Project Context Document.\" This document becomes the single source of truth that guides both human teams and AI agents, transforming the PM from a \"specifier\" into a \"context curator.\"\n\nThis approach fundamentally champions a \"build-first\" culture. It moves away from lengthy, theoretical debates over specifications and prioritizes rapid, interactive prototyping. The core philosophy is that the fastest way to learn is by building and testing something tangible. By leveraging AI to drastically reduce the cost and time of creating prototypes, we can validate ideas with real users faster than ever before. The ultimate goal is to accelerate decision-making, significantly increase development velocity, and ensure that all stakeholders—product, design, engineering, and business—are perpetually aligned around a shared, continuously updated understanding of the customer problem and the proposed solution.\n\n2. Introduction\n\nContext-driven Product Management is a modern approach designed for a technology landscape where generative AI is an active, collaborative participant in the product development lifecycle. It represents a necessary evolution away from the traditional, documentation-heavy product management methodologies prevalent in many large tech companies. Those legacy processes, designed to mitigate the high cost of engineering by ensuring exhaustive upfront alignment, often led to long development cycles, documents that quickly became outdated, and a rigid adherence to plans that inadvertently stifled innovation and responsiveness. The classic PRD, while well-intentioned, frequently became a bottleneck, a static artifact in a dynamic environment.\n\nIn the past, product managers spent a significant amount of time creating detailed Product Requirements Documents (PRDs) and specifications to minimize ambiguity before development began. This was a necessary, albeit slow, process. With the advent of powerful coding assistants that can generate boilerplate code and generative UI tools that can create high-fidelity mockups from a simple text prompt, the cost and time required to create initial prototypes and MVPs have drastically decreased. Context-driven Product Management leverages this fundamental economic shift. Instead of asking \"What should we build?\" based on lengthy documents, it asks, \"What should we not choose to build?\" by rapidly and inexpensively testing tangible, interactive prototypes with users. The focus moves from meticulously defining a solution in text to building confidence in a solution through early, continuous, and cost-effective v\n\n\n\nfine Documentation Standards: Move from prose-heavy, static documents to structured, machine-readable Project Context Documents. This transition requires establishing clear, shared templates and providing guidance on how to structure information for both human and machine readability. This initial investment in creating robust templates will pay significant dividends in automation and clarity down the line.\n\n* Promote Cross-functional Collaboration: The Project Context Document is a shared asset, not a siloed product artifact. Foster a culture where engineering, design, and product all contribute to and maintain this single source of truth. It breaks down silos by creating a single, shared workspace where all disciplines contribute their expertise in real-time. For example, engineers can update the implementation context directly, while designers link to the latest Figma files in the solution context.[a][b]\n\n* Start Small and Iterate: Begin by applying this new workflow to a single, well-defined project or a pilot team. Treat the adoption of this process like a product itself. Learn from the experience, gather feedback from the team to refine the process and templates, and then scale the new way of working across the organization with proven best practices and internal champions.\n\n[a]I have some skepticism here on how the context document will be used in practice \n\n\n\n\n\nit's already the purpose of daily standups, design reviews, dev huddles, etc. to pool expertise and give the latest piece of context without the need to be over-updating documents; the main issue I've seen is once the initiatives are over, then a lot of historical context gets lost/forgotten\n\n\n\n\n\nso to me the purpose of the context doc is less on the daily collaboration but more for knowledge preservation + traceability\n\n\n\n\n\nI could imagine a workflow where meeting transcriptions or slack threads are inserted into something like NotebookLM to automatically document key decisions/info, however if after every live meeting, engineers & designers are also expected to update the living document, then it creates more work overall if everybody else was part of that discussion already\n\n[b]^ah I see this comment is basically addressed in the longer version of the doc \n\n\n\n\n\nwhen I first read this it read as more that the context doc would replace some of these live problem-solving/collaboration meetings",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-11-02.md",
      "source_date": "2025-12-11",
      "doc_type": "other",
      "matched_topics": [],
      "matched_people": [
        "nikita"
      ],
      "filter_score": 1
    },
    {
      "title": "Discount Communication Presets",
      "doc_id": "1M8e08SHNq_Z2Q7V45Kasfsv1uP8sPaaz000BRIB7dRo",
      "link": "https://docs.google.com/document/d/1M8e08SHNq_Z2Q7V45Kasfsv1uP8sPaaz000BRIB7dRo/edit?usp=drivesdk",
      "content": "﻿Discount Communication Presets\n\nContributors: Ipek KalenderAnastasiya BelkinaShay Ben Yacov\n\nContext\n\nDiscount communication presets are predefined fields that allow marketing teams to display discount-related messages or offers on various parts of the website. These presets control the content that appears at key customer touchpoints, located on pages such as Landing Pages, Plans Page, Checkout, Reactivation pages.\n\nMarketing Teams can customize the discount messages based on the field presets e.g. Team can decide to display Free Dessert for Life for some users and Free Snacks for life for others. Each preset field controls specific touchpoints on the site, ensuring a consistent and clear message to customers across the user journey.\n\nTouchpoints itself are owned by different product teams, who manage the placement and configuration of the fields, while marketing handles the content. \n\nAll touchpoints integrated with Communication Presets are listed in documentation.\n\nGovernance Process for Adding New Discount Communication Touchpoints\n\nThe ownership of discount communication is spread across multiple teams product teams own the touchpoints, while marketing teams handle the benefit communication. This requires teams to be aligned on all available fields. Whenever a new field is introduced, it is critical that the team responsible for that section ensures alignment with marketing.\n\nNotification when new field is added\n\n1. Notification to Marketing & Product Teams via Slack\n\nEach time a team plans to add a new discount communication field, they are required to send a message in a dedicated Slack channel (e.g., #discount-communications-updates). This notification will contain the following information:\n\nSlack Message Template:\n\n* Subject: New Discount Communication Touchpoint Field\n\n* Team: [Insert team name]\n\n* Brand: [Insert Brand (All/ HelloFresh/RTE/Mealkit]\n\n* Field Details:\n\n   * Field Name: [e.g., Discount_Slogan]\n\n   * Field Description: [Briefly describe the purpose and content of the field, e.g., \"A promotional slogan displayed on the landing page.\"]\n\n   * Touchpoint Location: [Specify the page and exact location, e.g., \"Landing Page - Banner Section.\"]\n\n   * Content Guidelines (if applicable): [Any limitations, e.g., \"Max 50 characters; no special characters.\"]\n\n   * Link to Documentation: [Link to the updated internal documentation, which should include a screenshot of where the touchpoint is located on the website.]\n\n* Planned day of Roll Out: [e.g., 23-Sep]\n\n* Expectations from Marketing: [e.g., for this field to be filled out for all Activation presets that are in use]\n\n2. Confirmation \n\nUpon posting in Slack, P&D Teams must confirm receipt of the message and ensure they:\n\n* Understand the new field’s purpose and placement.\n\n* Have coordinated and finalized updating marketing strategies/content to include the new touchpoint.\n\n* Acknowledge any guidelines, limitations, or formatting rules.\n\n[!] Please wait until both 1 POC from both NA and International P&D to confirm they are aligned with the changes.\n\n3. Documentation Update\n\nUpdate the documentation for the new field. Documentation must include:\n\n* Field name and description\n\n* Page(s) and sections where the touchpoint is active\n\n* A screenshot or visual aid highlighting where the new touchpoint is located.\n\n* Usage guidelines, including length, format, and content rules\n\n* Clear directions on how marketing can use the new field\n\n4. How to implement a new field\n\nTo introduce a new field into discount communication configuration (to be able to use it in CUI) a new Pull \n\n\n\nd a column for what works where?\n\n[f]@asma.nished@hellofresh.com do we use this field in the US? I think no?\n\n[g]@anb@hellofresh.com I still don't understand where these fields are used. Any idea who can help me?\n\n[h]@anb@hellofresh.com I still don't understand where these fields are used. Any idea who can help me?\n\n[i]@anb@hellofresh.com I still don't understand where these fields are used. Any idea who can help me?\n\n[j]@anb@hellofresh.com I still don't understand where these fields are used. Any idea who can help me?\n\n[k]@anb@hellofresh.com should we break this down as there will be 4 different inputs under this section?\n\n_Assigned to anb@hellofresh.com_\n\n[l]It seems as if this was a shared module over Contentful and this has resulted in Tommy's experiment causing our title to change. Should we also mark these shared modules over Contentful w/ Kiran's support?\n\n[m]@harneet.singh@hellofresh.com Can we de-preciate this field or it is always re-used for experimentation?\n\n_Assigned to harneet.singh@hellofresh.com_\n\n[n]I would like to keep it, it's always reused for experiments\n\n[o]Should we actually consider separating Activation and Reactivation presets? I think this causes a lot of confusion\n\n[p]Yes, this would be a good idea if we see a lot of dedicated fields per customer journey\n\n[q]Was created for an A/B test. No longer actively in use, but can be \"recycled\" for a future test\n\n[r]Note both this field and the one for F4X limited time will add a \"+\" between the organic modal message and the F4X claim. \n\n\n\n\n\nThis copy will also apply to the exit intent modal\n\n[s]Is there a visualized documentation I can find on Reactivation input fields?\n\n[t]I didn't fully understand - currently the experimentation on green banner is available?\n\n[u]not in use after the overlaps with the other landing pages\n\n[v]@anb@hellofresh.com are we confident with these experiments that they didn't bring an uplift? Also were these experiments tested with presets or w/o presets? I am curious on understanding the set-up\n\n_Assigned to anb@hellofresh.com_\n\n[w]@anb@hellofresh.com  is this incomplete?\n\n[x]@anb@hellofresh.com is this incomplete?\n\n[y]@anb@hellofresh.com could you specify what kind of information you need in this field?\n\n[z]@tommaso.cremonini@hellofresh.com share all the pain points in regards with Discount Communication Management\n\n_Assigned to tommaso.cremonini@hellofresh.com_",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-18-.md",
      "source_date": "2025-12-18",
      "doc_type": "other",
      "matched_topics": [],
      "matched_people": [
        "max"
      ],
      "filter_score": 1
    }
  ],
  "doc_count": 8,
  "total_chars": 48032
}