{
  "batch_id": "meeting_082",
  "doc_type": "meeting",
  "documents": [
    {
      "title": "[Please Prio] Charge@Checkout OWL: Refund & Cancellation FLow - 2025/12/17 17:18 CET - Notes by Gemini",
      "doc_id": "1kaJSTD9NVd68smkm8X5MfPaZgifySU6PpnOw6cBul3w",
      "link": "https://docs.google.com/document/d/1kaJSTD9NVd68smkm8X5MfPaZgifySU6PpnOw6cBul3w/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 17, 2025\n\n[Please Prio] Charge@Checkout OWL: Refund & Cancellation FLow\n\nInvited Nikita Gorshkov Beatrice Dimarucut Rachael Vuong Michael Lucero Shishir Mishra Leny Jane Barbaza Hagag Alexander Matlin Candace Charles Gangadharan Khoteeswarun\n\nAttachments [Please Prio] Charge@Checkout OWL: Refund & Cancellation FLow \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nThe team, including Shishir Mishra and Michael Lucero, discussed the target process for pre-cut off order cancellations and refunds via the AL system, with Shishir Mishra confirming the ideal process is to mark the order as \"not shipped\" and cancel the payment, a process known to agents. Gangadharan Khoteeswarun (Ganga) identified a bug in the payments domain, affecting automatic refund reconciliation for CNC orders and partially paid orders using process out, which means refunds only occur after the cut off, and stated that a fix is being tested for deployment to production soon. Participants including someone in Lower Feast Side (United States-NYCHQ, 7), Shishir Mishra, and Hagag discussed agent processes, clarifying that cancellations do not happen via ART, and also addressed the confusion surrounding payment status and refund visibility for CNC orders before and after cutoff.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Target State for Cancellation and Refund The team discussed the desired process for canceling and refunding initial orders pre-cut off via the AL system, which is the target state, moving away from Bob. Shishir Mishra confirmed that the ideal process involves marking the order as \"not shipped\" and canceling the payment (00:03:15) (00:08:01), noting this process is known by agents and replicates Bob's behavior (00:08:01) (00:12:07). Michael Lucero noted an earlier understanding was to market as \"shipped\" and then cancel payment, indicating some confusion around the correct steps (00:01:02).\n\n* Bug Affecting Auto Reconciliation and Refund Timing Gangadharan Khoteeswarun (Ganga) identified a bug in the payments domain related to the new payment service provider, process out, where automatic refund reconciliation is missing in the configuration (00:02:11) (00:05:02). This means that without the fix, the refund will only be received after cut off, even if delivery is canceled (00:04:05) (00:19:49). The issue primarily affects charge at checkout (CNC) orders and any partially paid orders that require an automatic refund through process out (00:05:02).\n\n* Bug Resolution and Deployment Timeline Gangadharan Khoteeswarun stated that the fix is currently being tested in staging and they expect to be able to move it to production tomorrow, despite a delivery freeze, confirming after testing is complete (00:06:55). This fix, which is only for the auto-refund cases after the cutoff, is expected to unblock the cancellation and refund process for pre-cut off CNC orders, though the refund will still only occur after cutoff (00:27:14).\n\n* Agent Processes and Error Reporting Someone in Lower Feast Side (United States-NYCHQ, 7) raised the question of whether agents should use the Error Reporting Tool (ART) for cancellations and refunds, but Shishir Mishra clarified that cancellations do not happen via ART (00:01:02) (00:03:15). Shishir Mishra emphasized that the target process is the mark as \"not shipped\" and cancel payment method (00:03:15) (00:08:01), which agents are already trained on from the Bob system (00:13:40). Hagag explained the difference between canceling an order and canceling a payment operation, noting that \"Mark order is not as not shipped\" prevents deliv\n\n\n\nads up because there is no order on payment\n\n \n\n \n\n00:27:14\n\n \n\nLower Feast Side (United States-NYCHQ, 7): Okay.\n\nGangadharan Khoteeswarun: side.\n\nLower Feast Side (United States-NYCHQ, 7): So, is it an extra step to expose those transactions via owl or it should work out of the box once the bug fix is\n\nHagag: Gotcha.\n\nLower Feast Side (United States-NYCHQ, 7): done?\n\nGangadharan Khoteeswarun: No. uh that needs to be adapted on the owl to call this endpoint and show the information in whatever needed form. The bug fix is only for auto refund cases after the cutff.\n\nLower Feast Side (United States-NYCHQ, 7): Okay. Okay, then. So,\n\nNikita Gorshkov: It's another action point.\n\nLower Feast Side (United States-NYCHQ, 7): we'll p Yeah, let's put that as a second action point. Correct me if I'm wrong,\n\nNikita Gorshkov: Mhm.\n\nLower Feast Side (United States-NYCHQ, 7): but it sounds like as soon as the bug fix is done and at least like this should unblock us, right? like cancellation and refund will work. There might it's still maybe like not the clearest for agents to see, but like um from what I can tell basically what will happen is that the delivery status changes to like that dash instead of running and then payment status is is canled.\n\n \n\n \n\n00:28:18\n\n \n\nLower Feast Side (United States-NYCHQ, 7): So that should tell the agent that it worked but still we will need like they will get money back only after cut off even after the fix. Yeah. So like that's a known limitation we can live with I think right now. So it's like three weeks out max. Yeah. But yeah I think this is otherwise it will require more changes to Yeah. like secondation.\n\nNikita Gorshkov: But it's something we can maybe address and I don't think that this will affect too many customers.\n\nLower Feast Side (United States-NYCHQ, 7): Yes.\n\nNikita Gorshkov: Um so yeah it's it's manageable but yeah the second one ideally we would also address going forward.\n\nLower Feast Side (United States-NYCHQ, 7): Okay. Okay. So, in case I done once you're done on production, please let us know. We'll double check again with live order and see how it works.\n\nGangadharan Khoteeswarun: Yep, I'll do\n\nLower Feast Side (United States-NYCHQ, 7): Yeah.\n\n \n\n \n\nTranscription ended after 00:29:29\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-18-.md",
      "source_date": "2025-12-18",
      "doc_type": "meeting",
      "matched_topics": [],
      "matched_people": [
        "beatrice",
        "max",
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "Notes - New Ventures: PA Resource Alignment",
      "doc_id": "1irRq_cPUc7eU6WXBHtBFiKh53SfPf7H8M7nDeVzn_yE",
      "link": "https://docs.google.com/document/d/1irRq_cPUc7eU6WXBHtBFiKh53SfPf7H8M7nDeVzn_yE/edit?usp=drivesdk",
      "content": "﻿Dec 22, 2025 | New Ventures: PA Resource Alignment\n\nAttendees: Annie Meininghaus Eva Martínez Romero Jama Musse Laurent Guillemain Matthew Stone Nikita Gorshkov\n\n\n\n\n\nNotes\n\n* \n\n\n\nAction items\n\n*",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-18-.md",
      "source_date": "2025-12-18",
      "doc_type": "meeting",
      "matched_topics": [
        "new ventures"
      ],
      "matched_people": [
        "jama",
        "nikita"
      ],
      "filter_score": 3
    },
    {
      "title": "2026 Yearly Plan - Consumer Mega-Alliance (Final) - Q1",
      "doc_id": "1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8",
      "link": "https://docs.google.com/document/d/1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8/edit?usp=drivesdk",
      "content": "﻿Final YP\n\n\n\n\n\n💡 Meeting Notes [To be filled after the Review Meeting by the YP Document Owner and sent out via email to attendees. This section does not impact the maximum number of pages]\n\nReview Meeting Date: Oct 16, 2025\n\nAttendees: Ed Boyes Assaf Ronen Dominik Richter Holger Hammel,Cho HwangAnnie MeininghausDina MehrezThomas GrieselFabien SimonMarlene RosnerBrian LeungAdriana VillarEvan WeintraubJama Musse\n\n\n\n\n\nKey Takeaways, Decisions, and Next Steps:\n\n1. Clarify how menu expansion plans, personalization roll outs  and app features come together: \n\n   * Elysium (new store and homepage in the app) roll out is fast followed by new app feature which benefits users  irrespective of menu ranking roll out (most notably merchandising widgets for marketing,  recommendation widgets,bringing search to apps, populating “most popular, “trending” widgets - details)\n\n   * Menu ranking roll out: At the same time there is a roll out plan for menu ranking models which prioritizes P500 readiness in Q4/Q1 as well as Penguin for Factor US. Food Systems is trying to expedite Penguin for INTL if possible, prioritized after p500. Fall back is to launch Penguin Harp personalization to INTL markets expanding in Q1.  Other RTE markets in H2.\n\n2. Share prioritization framework  for Project 5M. The prioritization is heavily influenced by successful companies and features observed (direct or indirect competitors) as well as through an internal workshop. This revealed a consistent and significant behavioral gap: Users enthusiastically save recipes (often from social media) but rarely act on them. This indicates a high desire for inspiration but a significant friction point in execution. This led to the prioritization of the recipe bridge in Q4/Q1. If requested we can  walk through the detailed methodology.\n\n3. Decouple forecasting from personalization models. Food Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2.\n\n4. Reconcile marketing RAF plan with tech YP.  We have addressed the  gap between Marketing and Consumer growth targets. Share squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. \n\n5. Variable pricing is an urgently requested feature by markets. We added it  to the Market Innovation squad backlog H2. Will define long-term ownership before initiation as we are currently moving pricing ownership to growth MA. \n\n\n\n\n\nChanges requested to the Yearly Plan during Draft Reviews. Please update before submission for final YP approval:  \n\n* Should we invest into an AOV-focused squad? Yes we will self fund a new AOV driven squad in Q2 with a dedicated KPI. Focus in Q1  is first to roll out the new personalized core journey including widgets and then layer in more upselling components. \n\n* Loyalty strategy across markets: We decided to reserve a small team to  maintain and improve the existing  program while implementing  the new vendor based loyalty program to launch first in  the US . See Loyalty Strategy SMT Shareout.\n\n* Double check if all Factor requirements are in the plan: All documents were collected and integrated into the Market Innovation backlog. To be signed off by Ed Boyes\n\n\n\n\n\n\tI. Organizational Overview\n\nMission and Focus areas\n\nThe Consumer Mega Alliance vision is to create the best digital product exper\n\n\n\nrds, search). See linked feature plan.\n\n\tJama Musse\n\n\tAOV-Focused Squad\n\n\tRevisit creation post-Q2. Focus is first to roll out the personalized core journey. Consider establishing a dedicated squad to drive AOV growth by separating merchandising ownership from shopping guidance, incorporating programs.\n\n\tAnnie Meininghaus\n\n\tPersonalization Model Rollout (Penguin & Harp)\n\n\tPrioritize P500 readiness in Q4/Q1 as well as Penguin for Factor US. Expand personalization to INTL markets (100–150 meals)  HF-UK, HF-CA, CP-CA (TBD), HF-ANZ, HF-BNL, HF-DKSE, HF-DEAT will follow Q1 / Q2. Other RTE markets in H2. Details in Ops Alliance YP.\n\n\tAnnie Meininghaus\n\n\tDecouple Forecasting from Personalization Models\n\n\tFood Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2. See Forecasting Domain Boundaries.\n\n\tHolger Hammel\n\n\tFactor Tech Requests Review\n\n\tJama and Annie aligned with Adam Park to merge the Factor backlog with the Market Innovation squad list. Requests are now integrated and can be selected during quarterly planning.\n\n\tJama Musse\n\n\tVariable Pricing\n\n\tAdded to the Market Innovation squad backlog. Deferred until Q3. Will define long-term ownership before initiation.\n\n\tJama Musse\n\n\tFactor Programs Transition Plan\n\n\tPause Programs on Factor funnel for peak since results are negative. Alison Ryanwill partner with Commercial and New Programs hire in NA to design a better “Active Experience” and 3rd-party partnerships. Aligned timeline is Q2.\n\n\tJama Musse\n\n\tProject 5M Prioritization (App Engagement)\n\n\tLisa Trueblood preparing a one-pager summarizing prioritization framework and decisions for follow-up discussion.\n\n\tEvan Weintraub\n\n\tLoyalty Strategy Across Markets\n\n\tDecided to reserve 20% of engineering IC capacity to maintain and improve the legacy program while evolving the new loyalty framework. See Loyalty Strategy SMT Shareout.\n\n\tEvan Weintraub\n\n\tReferral (RAF) Program Alignment\n\n\tAddress gap between Marketing and Consumer growth targets. Share” squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. Updated FAQ 11 \n\n\tEvan Weintraub",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-.md",
      "source_date": "2025-12-05",
      "doc_type": "meeting",
      "matched_topics": [
        "market innovation"
      ],
      "matched_people": [
        "jama"
      ],
      "filter_score": 2
    },
    {
      "title": "Influencer MP Sprint Review - 2025/12/04 16:24 CET - Notes by Gemini",
      "doc_id": "13B4nLGPHNDKiKoAoEWfmOpkEZ5GMMzozNYhzFijHDYE",
      "link": "https://docs.google.com/document/d/13B4nLGPHNDKiKoAoEWfmOpkEZ5GMMzozNYhzFijHDYE/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 4, 2025\n\nInfluencer MP Sprint Review\n\nInvited Annette MvdE Sameer Doda Shay Obaidullah Linnea Siersma Alison McMenemy Ian Brooks Melanie Schwindt Katheryn Eckles Cole Banning Jama Musse Marc Wanderley Teixeira Marina Kramer\n\nAttachments Influencer MP Sprint Review \n\nMeeting records Transcript Recording \n\n\n\n\n\nSummary\n\nAnnette MvdE led the meeting, focusing on the status of creator research, the plan for customer validation, and a critique of the validation prototype with Ian Brooks, Katheryn Eckles, Melanie Schwindt, Linnea Siersma, Sameer Doda, and Cole Banning participating. Katheryn Eckles reported on five creator interviews, with upcoming research moving into concept validation and a customer interview phase to understand the inspiration execution gap, marketplace value, and trust barriers. Participants discussed pricing models, with Ian Brooks and Linnea Siersma favoring a model where creators set their own margin, while Sameer Doda proposed a tiered, cost-plus approach, and Annette MvdE confirmed that the concept validation prototype will use a pitch deck to guide conversation and feature critique.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Meeting Context and Agenda Annette MvdE initiated the meeting, sharing the document link and planning to screen-share (00:00:00). The agenda focused on the status of creator research, the plan for the next customer validation round, and a prototype critique for the validation test (00:01:04). The goal was to cover everything in 60 minutes, though Ian Brooks noted they would try to keep their participation to 45 minutes (00:00:00).\n\n* Creator Research Status Katheryn Eckles reported five creator interviews completed, covering a mix of creator sizes up to 1.2 million followers, with generally consistent insights (00:01:56). They found that one cookbook author saw no conflict in using their cookbook recipes on the platform for exposure and was aligned with commission-based compensation. The research is transitioning to focus on cookbook authors and higher-level influencers, probing deeper into their use of trends and vetting expectations (00:03:06).\n\n* Creator Vetting and Data Needs The cookbook author interviewed acknowledged that customers might not fully understand if HelloFresh is not vetting recipes in an Amazon-style marketplace approach and might still blame the platform or the creator for bad recipes (00:04:20). Creators are interested in data points such as user interests, popular ingredients, cooking time, and site traffic (00:05:29).\n\n* Concept Validation and Next Steps for Creator Research Katheryn Eckles stated that the interviews are moving into concept validation next week to obtain deeper insights into how creators see the platform working (00:05:29). The expected outcomes include stronger indicators of desirability and feature prioritization (00:07:34). Recruitment is ongoing, focusing on larger influencers, with the option to re-engage previous participants (00:06:32).\n\n* Customer Research Plan The next phase of research will focus on customer interviews, building on signals from unmoderated tests and a survey that showed a significant inspiration execution gap (00:07:34). The goal is to understand how customers would use the service (e.g., for special occasions or daily purchases), the perceived value and trust in the influencer marketplace, and their needs and barriers related to trust and quality (00:08:49).\n\n* Customer Research Methodology and Focus The customer interviews will involve HelloFresh prospects actively engaging with food content on social media, using\n\n\n\nsiness like the business perspective comes in here as well for this plan. Yes.\n\nKatheryn Eckles: Yeah. Um, I just want to jump in and say, um, with like upcoming research, especially as you're kind of like getting clear on like your strategy and the questions that kind of come up there, um, there might be like often we make like prioritization decisions and things like that based off of like how much work is needed in a space. So, if you guys become clear on like, oh, we need testing on all of these things, we need clarity on this, that, and this.\n\n \n\n \n\n01:09:36\n\n \n\nKatheryn Eckles: um we're going in this direction and we have no idea in terms of research. There might also be things where maybe Anetta is done with the strategy bits of things, but I stay on as the researcher helping you research these things for a little bit longer. So there's there's things that might happen in that context as well. Um where we can potentially still support, but I think a lot of the decisions on our team tend to be made based off of like um the clear need in in that space. So, um, if if you kind of have your strategy decisions and you're communicating with us of like, okay, this is where we're going, and then we can inform you, okay, we don't have, you know, clarity on these parts, those parts, and those parts. Do you want research on that? And then we can work together and kind of figure out what um kind of research is needed. And then we can bring that to Mark and and Andrea and and try to advocate for me staying on a little bit longer to help um kind of derisk this.\n\nAnnette MvdE: Yes, yes, yes, yes.\n\nKatheryn Eckles: So,\n\nAnnette MvdE: Uh I don't want like I I'm not ending this project and saying like goodbye and leaving you with this. we will find solutions especially when you're reaching out and saying like we want these tests because as I said like at the moment in Berlin the new way is just roll out each week new things not testing them before or exploring them and here it was a little bit different but I feel also like talking to a lot of you you have actually like your desire is like to get more clarity on here and do maybe more testing and if this is um if this is okay with Mar and um Andrea\n\n \n\n \n\nTranscription ended after 01:11:36\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-05-.md",
      "source_date": "2025-12-05",
      "doc_type": "meeting",
      "matched_topics": [],
      "matched_people": [
        "jama",
        "sameer"
      ],
      "filter_score": 2
    },
    {
      "title": "2026 Yearly Plan - Consumer Mega-Alliance (Final) - Q1",
      "doc_id": "1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8",
      "link": "https://docs.google.com/document/d/1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8/edit?usp=drivesdk",
      "content": "﻿Final YP\n\n\n\n\n\n💡 Meeting Notes [To be filled after the Review Meeting by the YP Document Owner and sent out via email to attendees. This section does not impact the maximum number of pages]\n\nReview Meeting Date: Oct 16, 2025\n\nAttendees: Ed Boyes Assaf Ronen Dominik Richter Holger Hammel,Cho HwangAnnie MeininghausDina MehrezThomas GrieselFabien SimonMarlene RosnerBrian LeungAdriana VillarEvan WeintraubJama Musse\n\n\n\n\n\nKey Takeaways, Decisions, and Next Steps:\n\n1. Clarify how menu expansion plans, personalization roll outs  and app features come together: \n\n   * Elysium (new store and homepage in the app) roll out is fast followed by new app feature which benefits users  irrespective of menu ranking roll out (most notably merchandising widgets for marketing,  recommendation widgets,bringing search to apps, populating “most popular, “trending” widgets - details)\n\n   * Menu ranking roll out: At the same time there is a roll out plan for menu ranking models which prioritizes P500 readiness in Q4/Q1 as well as Penguin for Factor US. Food Systems is trying to expedite Penguin for INTL if possible, prioritized after p500. Fall back is to launch Penguin Harp personalization to INTL markets expanding in Q1.  Other RTE markets in H2.\n\n2. Share prioritization framework  for Project 5M. The prioritization is heavily influenced by successful companies and features observed (direct or indirect competitors) as well as through an internal workshop. This revealed a consistent and significant behavioral gap: Users enthusiastically save recipes (often from social media) but rarely act on them. This indicates a high desire for inspiration but a significant friction point in execution. This led to the prioritization of the recipe bridge in Q4/Q1. If requested we can  walk through the detailed methodology.\n\n3. Decouple forecasting from personalization models. Food Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2.\n\n4. Reconcile marketing RAF plan with tech YP.  We have addressed the  gap between Marketing and Consumer growth targets. Share squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. \n\n5. Variable pricing is an urgently requested feature by markets. We added it  to the Market Innovation squad backlog H2. Will define long-term ownership before initiation as we are currently moving pricing ownership to growth MA. \n\n\n\n\n\nChanges requested to the Yearly Plan during Draft Reviews. Please update before submission for final YP approval:  \n\n* Should we invest into an AOV-focused squad? Yes we will self fund a new AOV driven squad in Q2 with a dedicated KPI. Focus in Q1  is first to roll out the new personalized core journey including widgets and then layer in more upselling components. \n\n* Loyalty strategy across markets: We decided to reserve a small team to  maintain and improve the existing  program while implementing  the new vendor based loyalty program to launch first in  the US . See Loyalty Strategy SMT Shareout.\n\n* Double check if all Factor requirements are in the plan: All documents were collected and integrated into the Market Innovation backlog. To be signed off by Ed Boyes\n\n\n\n\n\n\tI. Organizational Overview\n\nMission and Focus areas\n\nThe Consumer Mega Alliance vision is to create the best digital product exper\n\n\n\nrds, search). See linked feature plan.\n\n\tJama Musse\n\n\tAOV-Focused Squad\n\n\tRevisit creation post-Q2. Focus is first to roll out the personalized core journey. Consider establishing a dedicated squad to drive AOV growth by separating merchandising ownership from shopping guidance, incorporating programs.\n\n\tAnnie Meininghaus\n\n\tPersonalization Model Rollout (Penguin & Harp)\n\n\tPrioritize P500 readiness in Q4/Q1 as well as Penguin for Factor US. Expand personalization to INTL markets (100–150 meals)  HF-UK, HF-CA, CP-CA (TBD), HF-ANZ, HF-BNL, HF-DKSE, HF-DEAT will follow Q1 / Q2. Other RTE markets in H2. Details in Ops Alliance YP.\n\n\tAnnie Meininghaus\n\n\tDecouple Forecasting from Personalization Models\n\n\tFood Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2. See Forecasting Domain Boundaries.\n\n\tHolger Hammel\n\n\tFactor Tech Requests Review\n\n\tJama and Annie aligned with Adam Park to merge the Factor backlog with the Market Innovation squad list. Requests are now integrated and can be selected during quarterly planning.\n\n\tJama Musse\n\n\tVariable Pricing\n\n\tAdded to the Market Innovation squad backlog. Deferred until Q3. Will define long-term ownership before initiation.\n\n\tJama Musse\n\n\tFactor Programs Transition Plan\n\n\tPause Programs on Factor funnel for peak since results are negative. Alison Ryanwill partner with Commercial and New Programs hire in NA to design a better “Active Experience” and 3rd-party partnerships. Aligned timeline is Q2.\n\n\tJama Musse\n\n\tProject 5M Prioritization (App Engagement)\n\n\tLisa Trueblood preparing a one-pager summarizing prioritization framework and decisions for follow-up discussion.\n\n\tEvan Weintraub\n\n\tLoyalty Strategy Across Markets\n\n\tDecided to reserve 20% of engineering IC capacity to maintain and improve the legacy program while evolving the new loyalty framework. See Loyalty Strategy SMT Shareout.\n\n\tEvan Weintraub\n\n\tReferral (RAF) Program Alignment\n\n\tAddress gap between Marketing and Consumer growth targets. Share” squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. Updated FAQ 11 \n\n\tEvan Weintraub",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-08-.md",
      "source_date": "2025-12-08",
      "doc_type": "meeting",
      "matched_topics": [
        "market innovation"
      ],
      "matched_people": [
        "jama"
      ],
      "filter_score": 2
    },
    {
      "title": "2026 Yearly Plan - Consumer Mega-Alliance (Final) - Q1",
      "doc_id": "1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8",
      "link": "https://docs.google.com/document/d/1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8/edit?usp=drivesdk",
      "content": "﻿Final YP\n\n\n\n\n\n💡 Meeting Notes [To be filled after the Review Meeting by the YP Document Owner and sent out via email to attendees. This section does not impact the maximum number of pages]\n\nReview Meeting Date: Oct 16, 2025\n\nAttendees: Ed Boyes Assaf Ronen Dominik Richter Holger Hammel,Cho HwangAnnie MeininghausDina MehrezThomas GrieselFabien SimonMarlene RosnerBrian LeungAdriana VillarEvan WeintraubJama Musse\n\n\n\n\n\nKey Takeaways, Decisions, and Next Steps:\n\n1. Clarify how menu expansion plans, personalization roll outs  and app features come together: \n\n   * Elysium (new store and homepage in the app) roll out is fast followed by new app feature which benefits users  irrespective of menu ranking roll out (most notably merchandising widgets for marketing,  recommendation widgets,bringing search to apps, populating “most popular, “trending” widgets - details)\n\n   * Menu ranking roll out: At the same time there is a roll out plan for menu ranking models which prioritizes P500 readiness in Q4/Q1 as well as Penguin for Factor US. Food Systems is trying to expedite Penguin for INTL if possible, prioritized after p500. Fall back is to launch Penguin Harp personalization to INTL markets expanding in Q1.  Other RTE markets in H2.\n\n2. Share prioritization framework  for Project 5M. The prioritization is heavily influenced by successful companies and features observed (direct or indirect competitors) as well as through an internal workshop. This revealed a consistent and significant behavioral gap: Users enthusiastically save recipes (often from social media) but rarely act on them. This indicates a high desire for inspiration but a significant friction point in execution. This led to the prioritization of the recipe bridge in Q4/Q1. If requested we can  walk through the detailed methodology.\n\n3. Decouple forecasting from personalization models. Food Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2.\n\n4. Reconcile marketing RAF plan with tech YP.  We have addressed the  gap between Marketing and Consumer growth targets. Share squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. \n\n5. Variable pricing is an urgently requested feature by markets. We added it  to the Market Innovation squad backlog H2. Will define long-term ownership before initiation as we are currently moving pricing ownership to growth MA. \n\n\n\n\n\nChanges requested to the Yearly Plan during Draft Reviews. Please update before submission for final YP approval:  \n\n* Should we invest into an AOV-focused squad? Yes we will self fund a new AOV driven squad in Q2 with a dedicated KPI. Focus in Q1  is first to roll out the new personalized core journey including widgets and then layer in more upselling components. \n\n* Loyalty strategy across markets: We decided to reserve a small team to  maintain and improve the existing  program while implementing  the new vendor based loyalty program to launch first in  the US . See Loyalty Strategy SMT Shareout.\n\n* Double check if all Factor requirements are in the plan: All documents were collected and integrated into the Market Innovation backlog. To be signed off by Ed Boyes\n\n\n\n\n\n\tI. Organizational Overview\n\nMission and Focus areas\n\nThe Consumer Mega Alliance vision is to create the best digital product exper\n\n\n\nrds, search). See linked feature plan.\n\n\tJama Musse\n\n\tAOV-Focused Squad\n\n\tRevisit creation post-Q2. Focus is first to roll out the personalized core journey. Consider establishing a dedicated squad to drive AOV growth by separating merchandising ownership from shopping guidance, incorporating programs.\n\n\tAnnie Meininghaus\n\n\tPersonalization Model Rollout (Penguin & Harp)\n\n\tPrioritize P500 readiness in Q4/Q1 as well as Penguin for Factor US. Expand personalization to INTL markets (100–150 meals)  HF-UK, HF-CA, CP-CA (TBD), HF-ANZ, HF-BNL, HF-DKSE, HF-DEAT will follow Q1 / Q2. Other RTE markets in H2. Details in Ops Alliance YP.\n\n\tAnnie Meininghaus\n\n\tDecouple Forecasting from Personalization Models\n\n\tFood Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2. See Forecasting Domain Boundaries.\n\n\tHolger Hammel\n\n\tFactor Tech Requests Review\n\n\tJama and Annie aligned with Adam Park to merge the Factor backlog with the Market Innovation squad list. Requests are now integrated and can be selected during quarterly planning.\n\n\tJama Musse\n\n\tVariable Pricing\n\n\tAdded to the Market Innovation squad backlog. Deferred until Q3. Will define long-term ownership before initiation.\n\n\tJama Musse\n\n\tFactor Programs Transition Plan\n\n\tPause Programs on Factor funnel for peak since results are negative. Alison Ryanwill partner with Commercial and New Programs hire in NA to design a better “Active Experience” and 3rd-party partnerships. Aligned timeline is Q2.\n\n\tJama Musse\n\n\tProject 5M Prioritization (App Engagement)\n\n\tLisa Trueblood preparing a one-pager summarizing prioritization framework and decisions for follow-up discussion.\n\n\tEvan Weintraub\n\n\tLoyalty Strategy Across Markets\n\n\tDecided to reserve 20% of engineering IC capacity to maintain and improve the legacy program while evolving the new loyalty framework. See Loyalty Strategy SMT Shareout.\n\n\tEvan Weintraub\n\n\tReferral (RAF) Program Alignment\n\n\tAddress gap between Marketing and Consumer growth targets. Share” squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. Updated FAQ 11 \n\n\tEvan Weintraub",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-08-02.md",
      "source_date": "2025-12-08",
      "doc_type": "meeting",
      "matched_topics": [
        "market innovation"
      ],
      "matched_people": [
        "jama"
      ],
      "filter_score": 2
    },
    {
      "title": "Refund from Owl for C@C - 2025/12/08 13:15 CET - Notes by Gemini",
      "doc_id": "1Q0tdP68WC_LQob4soblJOmC6MuIV7CYKW0doD5CusWg",
      "link": "https://docs.google.com/document/d/1Q0tdP68WC_LQob4soblJOmC6MuIV7CYKW0doD5CusWg/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 8, 2025\n\nRefund from Owl for C@C\n\nInvited Beatrice Dimarucut Shishir Mishra Hagag Nikita Gorshkov\n\nAttachments Refund from Owl for C@C \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nBeatrice Dimarucut reported that refunds are failing for initial orders of customers in the \"charge at checkout\" (CSC) experiment, unlike standard \"Business As Usual\" (BAU) customers charged at cutoff, and noted the difficulty in isolating defective cases because the CSC allocation is not visible in Owl. Shishir Mishra and Hagag debated the consistency of the issue, with Hagag noting that Bob and Owl use the same refund service endpoint, while Shishir Mishra confirmed that Owl does not display customer experiment allocation. Hagag and Shishir Mishra also discussed the difference between the Owl Orders tab, which uses the updated refund service like Bob, and the \"error reporting\" tab, which may use an older RabbitMQ topic for refund requests.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Refund Issues for 'Charge at Checkout' Customers Beatrice Dimarucut reported that refunds are not working for customers allocated to the \"charge at checkout\" (CSC) experiment, specifically for initial orders, unlike standard \"Business As Usual\" (BAU) customers who are charged at cutoff (00:00:00). Beatrice Dimarucut clarified that the allocation to CSC happens on the payments page, and this allocation is not visible in Owl (00:01:03). They also noted that any changes are only happening on initial orders (00:02:17).\n\n* Investigating Refund Mechanism Differences Shishir Mishra and Beatrice Dimarucut discussed the lack of multiple examples of the defect occurring consistently on Owl, suggesting it may not be a systemic issue (00:03:39) (00:06:02). Hagag added that Bob (a system where a refund worked for Beatrice Dimarucut) and Owl use the same refund service endpoint, questioning why there would be a difference in behavior. Shishir Mishra suggested involving Ganga or Diana, who are on the payment operation team, to confirm if Bob and Owl are using the exact same refund endpoint (00:04:42).\n\n* Addressing Challenges with Isolating Defective Cases Beatrice Dimarucut explained the difficulty in finding more examples because only 10% of customers are allocated to the experiment, and only 5% of those are allocated to \"charge at checkout,\" which makes it hard for customer care agents to identify the relevant customers due to the lack of visibility in Owl. Shishir Mishra confirmed that Owl does not show which experiment a customer is allocated to, suggesting the need for UIDs or CIDs from Star to be passed to customer agents (00:07:03). The team agreed to test a new live order and attempt a refund to replicate the issue (00:08:21).\n\n* Error Reporting vs. Orders Tab for Refunds Hagag explained that the Orders tab in Owl has a specific refund button that uses the updated refund service, mimicking Bob's functionality (00:09:33). Hagag and Shishir Mishra debated the functionality of the \"error reporting\" tab, with Hagag noting that it might use an older method of publishing a refund request via a RabbitMQ topic rather than the new endpoint (00:11:11) (00:13:54). Shishir Mishra agreed to investigate with the team responsible for error reporting to ensure it works the same as the new refund button (00:17:09).\n\n* Procedure for Live Order Refund and Cancellation Beatrice Dimarucut agreed to create a new live order and attempt a refund via the Orders tab, recording the steps (00:08:21) (00:17:09). Beatrice Dimarucut clarified the need to first issue the refund and then cancel the order, a\n\n\n\no not end point. There is a top a rapid MQ that publishes refund which is not the same as the endpoint.\n\nShishir Mishra: Yeah, no worries.\n\nHagag: But again I I am not sure this is just\n\nShishir Mishra: Let's check this out of this meeting. But uh now we address when you when you do that uh refund in case any order please do also record the screen so that we know exactly the steps that you are taking and just in case if there\n\nBeatrice Dimarucut: Yeah.\n\nShishir Mishra: is any other modification to it.\n\nBeatrice Dimarucut: Okay, sounds good. Um, so what I'll do is like first do the refund, but I like in the VAU process as far as I understand because customers don't actually want this box.\n\n \n\n \n\n00:18:26\n\n \n\nBeatrice Dimarucut: So it's not just about refunding, I also will have to cancel it after. So I will also do that after I issue the refund. Um, okay. I will do that and then I'll I'll just keep you guys posted on the channel. Um but just to like to understand like shishir you don't want to reopen Bob for all for customer care agents of good job because it's not possible on a market basis or like what's the\n\nShishir Mishra: It's um so it's 1500 agents enabled at a go. Uh so switch on and switch off. So it's not very market based or at least not very direct without putting a a decent effort. We can't uh switch it off for a given market.\n\nBeatrice Dimarucut: Okay. And um so I'm I'm to be fair I'm not familiar with like the agent structure like by L who are like L2 agents. They're not the first responders of the call, right?\n\nShishir Mishra: one are the first responders uh they will have the so how how it happens today as well so there are payment L2 teams uh in CC and then the first responders are called L1 so request will come to L1 L1 will escalate it to L2 and L2 will resolve the problem.\n\nBeatrice Dimarucut: Okay.\n\nShishir Mishra: Okay. Yeah, I think that CC process or CC all established uh in your CC good job channel if you uh let them know that this is how you need to operate uh I think it'll be okay. Um what I'm assuming is you won't have to uh if you refund via via orders tab and don't use error reporting in in that manner and agents are trained on it so should not be a problem.\n\n \n\n \n\nTranscription ended after 00:20:33\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-08-02.md",
      "source_date": "2025-12-08",
      "doc_type": "meeting",
      "matched_topics": [],
      "matched_people": [
        "beatrice",
        "nikita"
      ],
      "filter_score": 2
    },
    {
      "title": "2026 Yearly Plan - Consumer Mega-Alliance (Final) - Q1",
      "doc_id": "1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8",
      "link": "https://docs.google.com/document/d/1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8/edit?usp=drivesdk",
      "content": "﻿Final YP\n\n\n\n\n\n💡 Meeting Notes [To be filled after the Review Meeting by the YP Document Owner and sent out via email to attendees. This section does not impact the maximum number of pages]\n\nReview Meeting Date: Oct 16, 2025\n\nAttendees: Ed Boyes Assaf Ronen Dominik Richter Holger Hammel,Cho HwangAnnie MeininghausDina MehrezThomas GrieselFabien SimonMarlene RosnerBrian LeungAdriana VillarEvan WeintraubJama Musse\n\n\n\n\n\nKey Takeaways, Decisions, and Next Steps:\n\n1. Clarify how menu expansion plans, personalization roll outs  and app features come together: \n\n   * Elysium (new store and homepage in the app) roll out is fast followed by new app feature which benefits users  irrespective of menu ranking roll out (most notably merchandising widgets for marketing,  recommendation widgets,bringing search to apps, populating “most popular, “trending” widgets - details)\n\n   * Menu ranking roll out: At the same time there is a roll out plan for menu ranking models which prioritizes P500 readiness in Q4/Q1 as well as Penguin for Factor US. Food Systems is trying to expedite Penguin for INTL if possible, prioritized after p500. Fall back is to launch Penguin Harp personalization to INTL markets expanding in Q1.  Other RTE markets in H2.\n\n2. Share prioritization framework  for Project 5M. The prioritization is heavily influenced by successful companies and features observed (direct or indirect competitors) as well as through an internal workshop. This revealed a consistent and significant behavioral gap: Users enthusiastically save recipes (often from social media) but rarely act on them. This indicates a high desire for inspiration but a significant friction point in execution. This led to the prioritization of the recipe bridge in Q4/Q1. If requested we can  walk through the detailed methodology.\n\n3. Decouple forecasting from personalization models. Food Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2.\n\n4. Reconcile marketing RAF plan with tech YP.  We have addressed the  gap between Marketing and Consumer growth targets. Share squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. \n\n5. Variable pricing is an urgently requested feature by markets. We added it  to the Market Innovation squad backlog H2. Will define long-term ownership before initiation as we are currently moving pricing ownership to growth MA. \n\n\n\n\n\nChanges requested to the Yearly Plan during Draft Reviews. Please update before submission for final YP approval:  \n\n* Should we invest into an AOV-focused squad? Yes we will self fund a new AOV driven squad in Q2 with a dedicated KPI. Focus in Q1  is first to roll out the new personalized core journey including widgets and then layer in more upselling components. \n\n* Loyalty strategy across markets: We decided to reserve a small team to  maintain and improve the existing  program while implementing  the new vendor based loyalty program to launch first in  the US . See Loyalty Strategy SMT Shareout.\n\n* Double check if all Factor requirements are in the plan: All documents were collected and integrated into the Market Innovation backlog. To be signed off by Ed Boyes\n\n\n\n\n\n\tI. Organizational Overview\n\nMission and Focus areas\n\nThe Consumer Mega Alliance vision is to create the best digital product exper\n\n\n\norating programs.\n\n\tAnnie Meininghaus\n\n\tPersonalization Model Rollout (Penguin & Harp)\n\n\tPrioritize P500 readiness in Q4/Q1 as well as Penguin for Factor US. Expand personalization to INTL markets (100–150 meals)  HF-UK, HF-CA, CP-CA (TBD), HF-ANZ, HF-BNL, HF-DKSE, HF-DEAT will follow Q1 / Q2. Other RTE markets in H2. Details in Ops Alliance YP.\n\n\tAnnie Meininghaus\n\n\tDecouple Forecasting from Personalization Models\n\n\tFood Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2. See Forecasting Domain Boundaries.\n\n\tHolger Hammel\n\n\tFactor Tech Requests Review\n\n\tJama and Annie aligned with Adam Park to merge the Factor backlog with the Market Innovation squad list. Requests are now integrated and can be selected during quarterly planning.\n\n\tJama Musse\n\n\tVariable Pricing\n\n\tAdded to the Market Innovation squad backlog. Deferred until Q3. Will define long-term ownership before initiation.\n\n\tJama Musse\n\n\tFactor Programs Transition Plan\n\n\tPause Programs on Factor funnel for peak since results are negative. Alison Ryanwill partner with Commercial and New Programs hire in NA to design a better “Active Experience” and 3rd-party partnerships. Aligned timeline is Q2.\n\n\tJama Musse\n\n\tProject 5M Prioritization (App Engagement)\n\n\tLisa Trueblood preparing a one-pager summarizing prioritization framework and decisions for follow-up discussion.\n\n\tEvan Weintraub\n\n\tLoyalty Strategy Across Markets\n\n\tDecided to reserve 20% of engineering IC capacity to maintain and improve the legacy program while evolving the new loyalty framework. See Loyalty Strategy SMT Shareout.\n\n\tEvan Weintraub\n\n\tReferral (RAF) Program Alignment\n\n\tAddress gap between Marketing and Consumer growth targets. Share” squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. Updated FAQ 11 \n\n\tEvan Weintraub\n\n\t\n\n\n\n[a]@holger.hammel@hellofresh.com @tushar.raina@hellofresh.com @Jama.Musse@hellofresh.ca \n\n@fernando.desouza@hellofresh.com \n\n\n\n\n\nFYI I stubbed out contents from Holger's sheet. Tushar from what you mentioned, some topics/ordering might be still pending further alignment correct?",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-.md",
      "source_date": "2025-12-09",
      "doc_type": "meeting",
      "matched_topics": [
        "market innovation"
      ],
      "matched_people": [
        "jama"
      ],
      "filter_score": 2
    },
    {
      "title": "2026 Yearly Plan - Consumer Mega-Alliance (Final) - Q1",
      "doc_id": "1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8",
      "link": "https://docs.google.com/document/d/1BQ2mls9gsrGXGxKLQDAHIQRETimL749zLhPC2A6g2k8/edit?usp=drivesdk",
      "content": "﻿Final YP\n\n\n\n\n\n💡 Meeting Notes [To be filled after the Review Meeting by the YP Document Owner and sent out via email to attendees. This section does not impact the maximum number of pages]\n\nReview Meeting Date: Oct 16, 2025\n\nAttendees: Ed Boyes Assaf Ronen Dominik Richter Holger Hammel,Cho HwangAnnie MeininghausDina MehrezThomas GrieselFabien SimonMarlene RosnerBrian LeungAdriana VillarEvan WeintraubJama Musse\n\n\n\n\n\nKey Takeaways, Decisions, and Next Steps:\n\n1. Clarify how menu expansion plans, personalization roll outs  and app features come together: \n\n   * Elysium (new store and homepage in the app) roll out is fast followed by new app feature which benefits users  irrespective of menu ranking roll out (most notably merchandising widgets for marketing,  recommendation widgets,bringing search to apps, populating “most popular, “trending” widgets - details)\n\n   * Menu ranking roll out: At the same time there is a roll out plan for menu ranking models which prioritizes P500 readiness in Q4/Q1 as well as Penguin for Factor US. Food Systems is trying to expedite Penguin for INTL if possible, prioritized after p500. Fall back is to launch Penguin Harp personalization to INTL markets expanding in Q1.  Other RTE markets in H2.\n\n2. Share prioritization framework  for Project 5M. The prioritization is heavily influenced by successful companies and features observed (direct or indirect competitors) as well as through an internal workshop. This revealed a consistent and significant behavioral gap: Users enthusiastically save recipes (often from social media) but rarely act on them. This indicates a high desire for inspiration but a significant friction point in execution. This led to the prioritization of the recipe bridge in Q4/Q1. If requested we can  walk through the detailed methodology.\n\n3. Decouple forecasting from personalization models. Food Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2.\n\n4. Reconcile marketing RAF plan with tech YP.  We have addressed the  gap between Marketing and Consumer growth targets. Share squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. \n\n5. Variable pricing is an urgently requested feature by markets. We added it  to the Market Innovation squad backlog H2. Will define long-term ownership before initiation as we are currently moving pricing ownership to growth MA. \n\n\n\n\n\nChanges requested to the Yearly Plan during Draft Reviews. Please update before submission for final YP approval:  \n\n* Should we invest into an AOV-focused squad? Yes we will self fund a new AOV driven squad in Q2 with a dedicated KPI. Focus in Q1  is first to roll out the new personalized core journey including widgets and then layer in more upselling components. \n\n* Loyalty strategy across markets: We decided to reserve a small team to  maintain and improve the existing  program while implementing  the new vendor based loyalty program to launch first in  the US . See Loyalty Strategy SMT Shareout.\n\n* Double check if all Factor requirements are in the plan: All documents were collected and integrated into the Market Innovation backlog. To be signed off by Ed Boyes\n\n\n\n\n\n\tI. Organizational Overview\n\nMission and Focus areas\n\nThe Consumer Mega Alliance vision is to create the best digital product exper\n\n\n\nets in H2. Details in Ops Alliance YP.\n\n\tAnnie Meininghaus\n\n\tDecouple Forecasting from Personalization Models\n\n\tFood Systems to define technical interfaces enabling independent iteration. Once validated, assess org impact in Q1–Q2. See Forecasting Domain Boundaries.\n\n\tHolger Hammel\n\n\tFactor Tech Requests Review\n\n\tJama and Annie aligned with Adam Park to merge the Factor backlog with the Market Innovation squad list. Requests are now integrated and can be selected during quarterly planning.\n\n\tJama Musse\n\n\tVariable Pricing\n\n\tAdded to the Market Innovation squad backlog. Deferred until Q3. Will define long-term ownership before initiation.\n\n\tJama Musse\n\n\tFactor Programs Transition Plan\n\n\tPause Programs on Factor funnel for peak since results are negative. Alison Ryanwill partner with Commercial and New Programs hire in NA to design a better “Active Experience” and 3rd-party partnerships. Aligned timeline is Q2.\n\n\tJama Musse\n\n\tProject 5M Prioritization (App Engagement)\n\n\tLisa Trueblood preparing a one-pager summarizing prioritization framework and decisions for follow-up discussion.\n\n\tEvan Weintraub\n\n\tLoyalty Strategy Across Markets\n\n\tDecided to reserve 20% of engineering IC capacity to maintain and improve the legacy program while evolving the new loyalty framework. See Loyalty Strategy SMT Shareout.\n\n\tEvan Weintraub\n\n\tReferral (RAF) Program Alignment\n\n\tAddress gap between Marketing and Consumer growth targets. Share” squad will focus on strengthening the Refer-a-Friend (RAF) program while building new in-product sharing loops to drive organic growth. prioritizing foundational fixes — improving data visibility, customer experience, and operational agility — to make the RAF program self-sufficient and easier to optimize without tech dependencies. Updated FAQ 11 \n\n\tEvan Weintraub\n\n\t\n\n\n\n[a]@holger.hammel@hellofresh.com @tushar.raina@hellofresh.com @Jama.Musse@hellofresh.ca \n\n@fernando.desouza@hellofresh.com \n\n\n\n\n\nFYI I stubbed out contents from Holger's sheet. Tushar from what you mentioned, some topics/ordering might be still pending further alignment correct?\n\n[b]@apa@hellofresh.com @shishir.mishra@hellofresh.com I summarized from CMA roadmap - can yall confirm accuracy? Thanks!\n\n_Assigned to shishir.mishra@hellofresh.com_\n\n[c]Looks good to me. @rboo@hellofresh.com can you review as well?\n\n_Reassigned to rboo@hellofresh.com_\n\n[d]Made a few changes, all good now.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-02.md",
      "source_date": "2025-12-09",
      "doc_type": "meeting",
      "matched_topics": [
        "market innovation"
      ],
      "matched_people": [
        "jama"
      ],
      "filter_score": 2
    }
  ],
  "doc_count": 9,
  "total_chars": 48227
}