{
  "batch_id": "one_on_one_006",
  "doc_type": "one_on_one",
  "documents": [
    {
      "title": "Beatrice:Nikita 1:1 - 2025/12/09 10:01 CET - Notes by Gemini",
      "doc_id": "1miytgRj_nag608K_j0drdP8EtnupQxpfpBqQTVD2_Rw",
      "link": "https://docs.google.com/document/d/1miytgRj_nag608K_j0drdP8EtnupQxpfpBqQTVD2_Rw/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 9, 2025\n\nBeatrice:Nikita 1:1\n\nInvited Beatrice Dimarucut Nikita Gorshkov\n\nAttachments Beatrice:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nNikita Gorshkov and Beatrice Dimarucut discussed \"charge at checkout\" refunds, noting that a week is too long for the process and that tracking refunded customers separately may be necessary, and they agreed to consult with Kag to clarify how refunds and cancellations are individually tracked in the AL system for paid orders. Nikita Gorshkov is introducing Beatrice Dimarucut to the Spur founders, whose competitive analysis tool addresses tracking and comparing flows to an ideal state, and they have financial approval to procure them as a supplier. Furthermore, Nikita Gorshkov is opening a CS5 role for Beatrice Dimarucut to mentor, providing career development and shoring up work with Yuri following Dio's departure, and assured Beatrice Dimarucut that potential resistance from Annie would be minimal due to the defined headcount structure and involvement of key people like John, Yuri, Seb, Alex, DA, and external folks from payments and customer care.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Discussion on Charge at Checkout Refunds Nikita Gorshkov and Beatrice Dimarucut discussed the issue with refunds for customers who use \"charge at checkout.\" Nikita Gorshkov expressed concern that a week is too long for a refund process (00:01:00), and they explored the possibility of tracking customers who ask for refunds separately on their end (00:01:56). Beatrice Dimarucut confirmed that refunds work via AL (a system) for charged at checkout customers, but the problem arises when non-charged at checkout customers call to cancel their first box before the cut-off (00:03:25).\n\n* Clarification of Refund and Cancellation Process in AL Nikita Gorshkov questioned whether a paid order via charge at checkout should ever be in the status \"canceled\" in AL. Beatrice Dimarucut thought it should be possible to cancel a paid box if it is not yet in shipping status, but they were unsure if the status would be \"canceled and refunded\" (00:07:54). They agreed that they need to ask Kag if refunds and cancellations are tracked individually (00:11:48), and they discussed the need for a mechanism to check for paid \"charge at checkout\" orders that are merely in the \"canceled\" status to ensure a refund is processed and avoid customer complaints (00:09:54).\n\n* Spur Call and Competitive Analysis Tool Nikita Gorshkov explained that the \"spur call\" is to introduce Beatrice Dimarucut to the Spur founders, who have developed a new agent for competitive analysis. This new tool, developed after they proposed the use case to Spur, addresses how to track and compare different flows to an ideal state, which was a challenge Nikita Gorshkov faced with a previous personal project (00:13:56). The tool is an external service for internal workflows, and the team has received financial approval to procure them as a supplier (00:15:18).\n\n* Career Development and Team Structure Beatrice Dimarucut mentioned that they haven't had a career development call recently, and Nikita Gorshkov recalled giving feedback on areas for them to work on, specifically how to shore up work with Yuri in a more long-term thinking perspective, especially with Dio leaving (00:16:33). Nikita Gorshkov confirmed that adding headcount is proceeding with alignment across multiple VPs. They plan to open a CS5 role that Beatrice Dimarucut will start mentoring, which will establish a \"brilliant setup\" (00:17:37).\n\n* Discussing Potential Resistance from Annie Bea\n\n\n\ngoing to be a uh uh CS5\n\nBeatrice Dimarucut: Yeah.\n\nNikita Gorshkov: live uh so that you also start mentoring more junior members of the team uh going forward.\n\n \n\n \n\n00:18:52\n\n \n\nBeatrice Dimarucut: Okay, sounds good.\n\nNikita Gorshkov: And then we have a brilliant setup.\n\nBeatrice Dimarucut: Okay, nice. Um, do you think like I mean I don't have like any touch points with Annie or so like do you think she might be like difficult to Okay.\n\nNikita Gorshkov: It shouldn't be the case. Um, I mean it's worthwhile. Is it worthwhile?\n\nBeatrice Dimarucut: Yeah. You tell me. I don't know as in like I mean I don't have any natural touch points with her so I just don't know if there's going to be any like resistance or so like if in the end I guess her\n\nNikita Gorshkov: Sorry, it say no.\n\nBeatrice Dimarucut: approval is needed. I don't know.\n\nNikita Gorshkov: No. Uh look, at the end of the day, you're going to have uh John, myself, Yuri, Seb, uh Alex, uh DA, and we'll take a bunch of uh folks uh external that you've been interacting with. So, off of payments, uh um customer care here, we'll think about who else to bring onto the board uh uh onto this discussion.\n\nBeatrice Dimarucut: Yeah.\n\n \n\n \n\n00:20:04\n\n \n\nBeatrice Dimarucut: Okay. Yeah.\n\nNikita Gorshkov: It's really yeah should be fine.\n\nBeatrice Dimarucut: Yeah. That's okay. Mhm. All right. Sounds good. Cool. Then\n\nNikita Gorshkov: Like I'm not going to say no but I agree that there are no natural touch points. Moreover, you're working on the main objective uh document that's reporting into Dominic outside of like her structure. Your headcounts is also defined outside of her structure. Um, well, because it's New Ventures, it it's tough to find like an artificial, \"Oh, Annie, let's go for a coffee.\"\n\nBeatrice Dimarucut: Yeah.\n\nNikita Gorshkov: Like, sure, but also I I don't think it's like if we figure out what if there's a big dependency, but for Q1, we don't have any big dependencies, honestly.\n\nBeatrice Dimarucut: Yeah. Yeah, I mean intentionally so as well I think. But um no, I mean I don't need to like force it. It's more just so like I don't know if if we think it's going to be a risk that it might be a blocker then Yeah. Okay. Okay. Cool.\n\n \n\n \n\nTranscription ended after 00:21:25\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-.md",
      "source_date": "2025-12-09",
      "doc_type": "one_on_one",
      "matched_topics": [
        "new ventures"
      ],
      "matched_people": [
        "beatrice",
        "alex",
        "nikita"
      ],
      "filter_score": 4
    },
    {
      "title": "Beatrice:Nikita 1:1 - 2025/12/09 10:01 CET - Notes by Gemini",
      "doc_id": "1miytgRj_nag608K_j0drdP8EtnupQxpfpBqQTVD2_Rw",
      "link": "https://docs.google.com/document/d/1miytgRj_nag608K_j0drdP8EtnupQxpfpBqQTVD2_Rw/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 9, 2025\n\nBeatrice:Nikita 1:1\n\nInvited Beatrice Dimarucut Nikita Gorshkov\n\nAttachments Beatrice:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nNikita Gorshkov and Beatrice Dimarucut discussed \"charge at checkout\" refunds, noting that a week is too long for the process and that tracking refunded customers separately may be necessary, and they agreed to consult with Kag to clarify how refunds and cancellations are individually tracked in the AL system for paid orders. Nikita Gorshkov is introducing Beatrice Dimarucut to the Spur founders, whose competitive analysis tool addresses tracking and comparing flows to an ideal state, and they have financial approval to procure them as a supplier. Furthermore, Nikita Gorshkov is opening a CS5 role for Beatrice Dimarucut to mentor, providing career development and shoring up work with Yuri following Dio's departure, and assured Beatrice Dimarucut that potential resistance from Annie would be minimal due to the defined headcount structure and involvement of key people like John, Yuri, Seb, Alex, DA, and external folks from payments and customer care.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Discussion on Charge at Checkout Refunds Nikita Gorshkov and Beatrice Dimarucut discussed the issue with refunds for customers who use \"charge at checkout.\" Nikita Gorshkov expressed concern that a week is too long for a refund process (00:01:00), and they explored the possibility of tracking customers who ask for refunds separately on their end (00:01:56). Beatrice Dimarucut confirmed that refunds work via AL (a system) for charged at checkout customers, but the problem arises when non-charged at checkout customers call to cancel their first box before the cut-off (00:03:25).\n\n* Clarification of Refund and Cancellation Process in AL Nikita Gorshkov questioned whether a paid order via charge at checkout should ever be in the status \"canceled\" in AL. Beatrice Dimarucut thought it should be possible to cancel a paid box if it is not yet in shipping status, but they were unsure if the status would be \"canceled and refunded\" (00:07:54). They agreed that they need to ask Kag if refunds and cancellations are tracked individually (00:11:48), and they discussed the need for a mechanism to check for paid \"charge at checkout\" orders that are merely in the \"canceled\" status to ensure a refund is processed and avoid customer complaints (00:09:54).\n\n* Spur Call and Competitive Analysis Tool Nikita Gorshkov explained that the \"spur call\" is to introduce Beatrice Dimarucut to the Spur founders, who have developed a new agent for competitive analysis. This new tool, developed after they proposed the use case to Spur, addresses how to track and compare different flows to an ideal state, which was a challenge Nikita Gorshkov faced with a previous personal project (00:13:56). The tool is an external service for internal workflows, and the team has received financial approval to procure them as a supplier (00:15:18).\n\n* Career Development and Team Structure Beatrice Dimarucut mentioned that they haven't had a career development call recently, and Nikita Gorshkov recalled giving feedback on areas for them to work on, specifically how to shore up work with Yuri in a more long-term thinking perspective, especially with Dio leaving (00:16:33). Nikita Gorshkov confirmed that adding headcount is proceeding with alignment across multiple VPs. They plan to open a CS5 role that Beatrice Dimarucut will start mentoring, which will establish a \"brilliant setup\" (00:17:37).\n\n* Discussing Potential Resistance from Annie Bea\n\n\n\ngoing to be a uh uh CS5\n\nBeatrice Dimarucut: Yeah.\n\nNikita Gorshkov: live uh so that you also start mentoring more junior members of the team uh going forward.\n\n \n\n \n\n00:18:52\n\n \n\nBeatrice Dimarucut: Okay, sounds good.\n\nNikita Gorshkov: And then we have a brilliant setup.\n\nBeatrice Dimarucut: Okay, nice. Um, do you think like I mean I don't have like any touch points with Annie or so like do you think she might be like difficult to Okay.\n\nNikita Gorshkov: It shouldn't be the case. Um, I mean it's worthwhile. Is it worthwhile?\n\nBeatrice Dimarucut: Yeah. You tell me. I don't know as in like I mean I don't have any natural touch points with her so I just don't know if there's going to be any like resistance or so like if in the end I guess her\n\nNikita Gorshkov: Sorry, it say no.\n\nBeatrice Dimarucut: approval is needed. I don't know.\n\nNikita Gorshkov: No. Uh look, at the end of the day, you're going to have uh John, myself, Yuri, Seb, uh Alex, uh DA, and we'll take a bunch of uh folks uh external that you've been interacting with. So, off of payments, uh um customer care here, we'll think about who else to bring onto the board uh uh onto this discussion.\n\nBeatrice Dimarucut: Yeah.\n\n \n\n \n\n00:20:04\n\n \n\nBeatrice Dimarucut: Okay. Yeah.\n\nNikita Gorshkov: It's really yeah should be fine.\n\nBeatrice Dimarucut: Yeah. That's okay. Mhm. All right. Sounds good. Cool. Then\n\nNikita Gorshkov: Like I'm not going to say no but I agree that there are no natural touch points. Moreover, you're working on the main objective uh document that's reporting into Dominic outside of like her structure. Your headcounts is also defined outside of her structure. Um, well, because it's New Ventures, it it's tough to find like an artificial, \"Oh, Annie, let's go for a coffee.\"\n\nBeatrice Dimarucut: Yeah.\n\nNikita Gorshkov: Like, sure, but also I I don't think it's like if we figure out what if there's a big dependency, but for Q1, we don't have any big dependencies, honestly.\n\nBeatrice Dimarucut: Yeah. Yeah, I mean intentionally so as well I think. But um no, I mean I don't need to like force it. It's more just so like I don't know if if we think it's going to be a risk that it might be a blocker then Yeah. Okay. Okay. Cool.\n\n \n\n \n\nTranscription ended after 00:21:25\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-02.md",
      "source_date": "2025-12-09",
      "doc_type": "one_on_one",
      "matched_topics": [
        "new ventures"
      ],
      "matched_people": [
        "beatrice",
        "alex",
        "nikita"
      ],
      "filter_score": 4
    },
    {
      "title": "Prateek:Nikita 1:1 - 2025/12/09 10:45 CET - Notes by Gemini",
      "doc_id": "1cIVE2-Q7g2G28iQYEWZsJvnCa4gfFEeqwWeSyomyOf8",
      "link": "https://docs.google.com/document/d/1cIVE2-Q7g2G28iQYEWZsJvnCa4gfFEeqwWeSyomyOf8/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 9, 2025\n\nPrateek:Nikita 1:1\n\nInvited Nikita Gorshkov Prateek Jajoo\n\nAttachments Prateek:Nikita 1:1 \n\nMeeting records Transcript File \n\n\n\n\n\nSummary\n\nPrateek Jajoo experienced a Confluence page access issue, which was resolved by Nikita Gorshkov granting access to anonymous users, who also clarified the meeting's purpose is for Prateek Jajoo’s personal development, unblocking, and issue escalation, asking them to manage ETAs for the login page and app documentation. Prateek Jajoo updated on prioritizing login page features like text box visibility and language enhancement for conversion before Katrina's absence, seeking reviews from Nikita Gorshkov and Laura Doas this week, and also discussed deprioritizing social logins while raising concerns about the lack of recipe selection transparency on the checkout page, which Nikita Gorshkov agreed to test if inexpensive. Additionally, Prateek Jajoo sought clarity on the design review process with Laura Doas, with Nikita Gorshkov advising to consult Maria about the TPT experience preview or set up a separate small design review.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Access to Confluence Page Prateek Jajoo reported difficulty accessing the new tribe in Slide page on Confluence despite receiving an email confirming access (00:00:00). Nikita Gorshkov resolved the issue by granting access to anonymous users, which Prateek Jajoo found to be a \"big relief\" (00:01:13).\n\n* Personal Development and Project Management Nikita Gorshkov clarified that the purpose of their standing meeting is to discuss Prateek Jajoo’s personal development, unblock them, and escalate issues. They requested Prateek Jajoo to manage expectations regarding the ETA for work on the login page and the app documentation and plan (00:03:09).\n\n* Login Page Feature Prioritization and Review Prateek Jajoo provided an update on the login page work, focusing on frontloaded efforts due to Katrina's upcoming absence, which involved creating and prioritizing a list of features to improve conversion rates (00:04:25). The primary features prioritized for one sprint's work include improving the text box's visibility and making it more action-oriented, as well as enhancing the language's intent with emotional appeal and social proof (00:05:52). Prateek Jajoo intends to secure reviews from Nikita Gorshkov and Laura Doas this week to finalize designs before Katrina's departure, aiming for development in the second sprint (00:04:25).\n\n* Deprioritization of Social Login and Recipe Transparency Prateek Jajoo mentioned the deprioritization of social logins, citing data from other brands and the older demographic of their customer base as factors. They are, however, deep-diving into more data and plan to detail the rationale in a one-pager. Additionally, Prateek Jajoo raised a concern about the lack of recipe selection display on the checkout or payment page, proposing that adding transparency might improve completion rates (00:09:19). Nikita Gorshkov suggested the lack of display may have been due to complexity, but agreed that testing the feature, if inexpensive, would be worthwhile, as displaying the recipes could build additional confidence for customers at the point of highest commitment (00:10:29) (00:13:43).\n\n* Process for Design Review Prateek Jajoo sought clarity on the process for reviewing designs with the broader team, specifically requesting feedback from Laura Doas while Katrina is still available. Nikita Gorshkov advised checking with Maria about the TPT experience preview or setting up an independent small design review \n\n\n\ne customer or reduces the transparency or creates doubt kind of can lead the customer to uh not make the purchase but also we don't want to overload the customer as well. So that was a bit surprising but again I just wanted to understand the reasoning of it. So if you're right uh if it's in inexpensive maybe we can try to see if we can do right.\n\nNikita Gorshkov: I agree and honestly like you can display it in the sidebar and it's a feature that doesn't necessarily distract but essentially like I know the distraction argument but in this case I don't think it's necessarily applicable.\n\n \n\n \n\n00:15:08\n\n \n\nPrateek Jajoo: I think some things are expected and that expectation not meeting could lead to drop off.\n\nNikita Gorshkov: Yeah, exactly.\n\nPrateek Jajoo: Right. Uh okay cool. Uh I'll look into it uh get more transparent in into that argument. And uh the my question is look Katrina is going I think we are already to something and I want to make sure that uh she's able to provide us her time uh this week before going but I want\n\nNikita Gorshkov: H. Yep.\n\nPrateek Jajoo: to uh understand the process of how do we review or bring it to the broader team right I want uh Laura Das to give us the feedback so that any feedback could be actioned on before she goes so that we can we are good to go. Even if she doesn't have the time, we'll know what need what's the feedback.\n\nNikita Gorshkov: So we should be having uh so check with Maria regarding the TPT uh experience preview. Else you can set it up with Laurand Dovas etc. just on your own uh for a small design review. In some cases like in this case like it might be sufficient to have this async. So basically provide them give a justification and get their feedback that way. But if you want to do it live feel free. You also need to establish those relationships. So it's worth it uh doing it live.\n\nPrateek Jajoo: Perfect. I'm I'm I'm anyway meeting with Doas today.\n\nNikita Gorshkov: Nice.\n\nPrateek Jajoo: So I'll get some feedback and then share it with the based on uh his viewpoint either if it's very concrete and we are all aligned. Uh I can just put 30 minutes to just socialize it. It would be my first so it would be great. So yeah. Cool. Awesome.\n\n \n\n \n\nTranscription ended after 00:17:20\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-03.md",
      "source_date": "2025-12-09",
      "doc_type": "one_on_one",
      "matched_topics": [
        "tpt"
      ],
      "matched_people": [
        "maria",
        "prateek",
        "nikita"
      ],
      "filter_score": 4
    },
    {
      "title": "1:1s: Jama-Nikita - 2025/12/09 17:02 CET - Notes by Gemini",
      "doc_id": "1HdOw9rINeOtx0sRUXorhqP9PwW5siAcGepbfK7k2C7U",
      "link": "https://docs.google.com/document/d/1HdOw9rINeOtx0sRUXorhqP9PwW5siAcGepbfK7k2C7U/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 9, 2025\n\n1:1s: Jama-Nikita\n\nInvited Jama Musse Nikita Gorshkov\n\nAttachments 1:1s: Jama-Nikita \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nNikita Gorshkov and Jama Musse discussed several key organizational and project updates, including Tishia’s secured budget approval and Jama Musse's approval for an 18-month analytics support contract role, separate from a permanent product role, while also addressing Alexia's contract inquiry and the unexpected termination of Sharief following a mistake by his manager, Assaf. Discussions also covered David's anticipated departure during the reorg, concerns about Katrina's aggressive pursuit of a VP promotion, and the January 5th launch of the OTP plus subscribe and save feature for factor 4, along with vendor management issues regarding Anata attempting to offload subscription setup work onto Samir. Other topics included the prioritization of the Ed roadmap, where Jama Musse explained Ed's escalating pressure to meet market demands, and the critical need for B2B product support to address HIPPA compliance issues related to \"factor food as medicine stuff.\"\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Staffing and Contract Roles Nikita Gorshkov confirmed that budget approvals for Tishia were secured from Lauron and Yuri. Following this, Nikita Gorshkov asked Jama Musse if they could proceed with an 18-month contract, similar to Yara's, for an analytics support role, which Jama Musse approved, stating \"Let's do it\". Jama Musse clarified that two separate roles are opening: a contract role and a permanent, full-time product role, emphasizing they are different functions and everyone needs to be aware (00:01:07).\n\n* Follow-up with Alexia and Sharief's Departure Jama Musse instructed Nikita Gorshkov to close the loop with Alexia regarding the contract role, as themself had sent an inquiry while Jama Musse was on vacation. The speakers then discussed Sharief's unexpected departure, with Jama Musse explaining that Sharief’s manager, Assaf, was unhappy with Sharief and subsequently made a mistake that created an issue for the organization, which led to Sharief's termination to \"solve the trouble problem\" (00:02:02). Jama Musse suggested that Sharief was likely okay with the outcome, preferring to be \"paid to leave versus to just quit,\" given the difficult relationship with Assaf (00:04:25).\n\n* David's Departure and Reorganization The conversation shifted to David, with Jama Musse noting that David had slowed down over the last year, particularly after having a baby, but still expected top performer treatment during the reorg (00:05:57). Nikita Gorshkov noted that it was understandable if it was time for David to part ways after five and a half years (00:06:43). The speakers also addressed the \"problem with Marlene\" that Katrina was causing, with Jama Musse warning Nikita Gorshkov to watch out for Katrina, who is aggressively seeking a VP promotion and causing \"spin\" for the team by trying to reinstitute Dominic reviews for more FaceTime with Dominic (00:07:37).\n\n* Product Launch and Vendor Management Nikita Gorshkov provided an update that the OTP plus subscribe and save feature for factor 4 is scheduled to launch on January 5th (calendar week two) to align with the expected pickup in peak traffic (00:09:35). Jama Musse and Nikita Gorshkov discussed the Shopify project, where Nikita Gorshkov expressed satisfaction with Allison's performance but noted that Anata, the consultancy being paid $400,000, was attempting to offload some of the subscription setup work onto Samir, which Nikita Gorshkov insis\n\n\n\nn org to be like, \"Guys, we yeah, we understand it's Christmas, but not only do we not we want you to work, we also want your weekends over these holidays,\n\nNikita Gorshkov: 996.\n\nJama Musse: too.\" There\n\nNikita Gorshkov: Yes. 996. Uh, shareholder f****** value. Um, this is what I wish for Christmas.\n\nJama Musse: you go.\n\nNikita Gorshkov: Um, cool.\n\nJama Musse: Yeah.\n\nNikita Gorshkov: You had the last topic for one minute. I have my next Mhm.\n\nJama Musse: Yeah. So, so I don't know how to handle this.\n\n \n\n \n\n00:18:38\n\n \n\nJama Musse: I'm just bringing it to your radar, but um they want some product support from us on the B2B side. they are running into some hiccups in like with things like HIPPA compliance and things of that nature with the work that they're trying to do on the the factor food as medicine stuff and like the the selling the food into like the old age homes and things that they're trying to do in the B2B space.\n\nNikita Gorshkov: Yes. Yep.\n\nJama Musse: And so apparently because our products don't have we don't we're not listing the right type of information in order to meet HIPPA compliance.\n\nNikita Gorshkov: Yeah.\n\nJama Musse: We have to do something about it. They don't know what they have to do yet and they don't know the how. But like they're now panicking and they reached out to me and they're like HIPPA compliance like so we need I think we just need to sit down with them and understand what they need. I'm not saying we deliver it because we don't have a team to deliver it. But like the first step is like figure out what's going on, which I don't think they they know.\n\nNikita Gorshkov: But okay, sounds good. That's what she was referring to. Okay. Um, my question is, can't they consolidate this?\n\nJama Musse: Who's she? Who's she? Who's the she when you said that?\n\nNikita Gorshkov: Elena. Elena.\n\nJama Musse: No. No. This is a completely different. So this is on the other side with Adam Park and um Kieran.\n\nNikita Gorshkov: Oh, okay.\n\nJama Musse: Yeah.\n\nNikita Gorshkov: Okay.\n\nJama Musse: Anyway, I gota I gotta jump.\n\nNikita Gorshkov: Okay. Okay. So, just FYI, uh, in regards to that, don't they have Shopify? So, can't we modify the PDP so it it does include all the s***?\n\n \n\n \n\nTranscription ended after 00:20:40\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-09-05.md",
      "source_date": "2025-12-09",
      "doc_type": "one_on_one",
      "matched_topics": [
        "otp"
      ],
      "matched_people": [
        "jama",
        "allison",
        "nikita"
      ],
      "filter_score": 4
    },
    {
      "title": "1:1s: Jama-Nikita - 2025/12/09 17:02 CET - Notes by Gemini",
      "doc_id": "1HdOw9rINeOtx0sRUXorhqP9PwW5siAcGepbfK7k2C7U",
      "link": "https://docs.google.com/document/d/1HdOw9rINeOtx0sRUXorhqP9PwW5siAcGepbfK7k2C7U/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 9, 2025\n\n1:1s: Jama-Nikita\n\nInvited Jama Musse Nikita Gorshkov\n\nAttachments 1:1s: Jama-Nikita \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nNikita Gorshkov and Jama Musse discussed several key organizational and project updates, including Tishia’s secured budget approval and Jama Musse's approval for an 18-month analytics support contract role, separate from a permanent product role, while also addressing Alexia's contract inquiry and the unexpected termination of Sharief following a mistake by his manager, Assaf. Discussions also covered David's anticipated departure during the reorg, concerns about Katrina's aggressive pursuit of a VP promotion, and the January 5th launch of the OTP plus subscribe and save feature for factor 4, along with vendor management issues regarding Anata attempting to offload subscription setup work onto Samir. Other topics included the prioritization of the Ed roadmap, where Jama Musse explained Ed's escalating pressure to meet market demands, and the critical need for B2B product support to address HIPPA compliance issues related to \"factor food as medicine stuff.\"\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Staffing and Contract Roles Nikita Gorshkov confirmed that budget approvals for Tishia were secured from Lauron and Yuri. Following this, Nikita Gorshkov asked Jama Musse if they could proceed with an 18-month contract, similar to Yara's, for an analytics support role, which Jama Musse approved, stating \"Let's do it\". Jama Musse clarified that two separate roles are opening: a contract role and a permanent, full-time product role, emphasizing they are different functions and everyone needs to be aware (00:01:07).\n\n* Follow-up with Alexia and Sharief's Departure Jama Musse instructed Nikita Gorshkov to close the loop with Alexia regarding the contract role, as themself had sent an inquiry while Jama Musse was on vacation. The speakers then discussed Sharief's unexpected departure, with Jama Musse explaining that Sharief’s manager, Assaf, was unhappy with Sharief and subsequently made a mistake that created an issue for the organization, which led to Sharief's termination to \"solve the trouble problem\" (00:02:02). Jama Musse suggested that Sharief was likely okay with the outcome, preferring to be \"paid to leave versus to just quit,\" given the difficult relationship with Assaf (00:04:25).\n\n* David's Departure and Reorganization The conversation shifted to David, with Jama Musse noting that David had slowed down over the last year, particularly after having a baby, but still expected top performer treatment during the reorg (00:05:57). Nikita Gorshkov noted that it was understandable if it was time for David to part ways after five and a half years (00:06:43). The speakers also addressed the \"problem with Marlene\" that Katrina was causing, with Jama Musse warning Nikita Gorshkov to watch out for Katrina, who is aggressively seeking a VP promotion and causing \"spin\" for the team by trying to reinstitute Dominic reviews for more FaceTime with Dominic (00:07:37).\n\n* Product Launch and Vendor Management Nikita Gorshkov provided an update that the OTP plus subscribe and save feature for factor 4 is scheduled to launch on January 5th (calendar week two) to align with the expected pickup in peak traffic (00:09:35). Jama Musse and Nikita Gorshkov discussed the Shopify project, where Nikita Gorshkov expressed satisfaction with Allison's performance but noted that Anata, the consultancy being paid $400,000, was attempting to offload some of the subscription setup work onto Samir, which Nikita Gorshkov insis\n\n\n\nn org to be like, \"Guys, we yeah, we understand it's Christmas, but not only do we not we want you to work, we also want your weekends over these holidays,\n\nNikita Gorshkov: 996.\n\nJama Musse: too.\" There\n\nNikita Gorshkov: Yes. 996. Uh, shareholder f****** value. Um, this is what I wish for Christmas.\n\nJama Musse: you go.\n\nNikita Gorshkov: Um, cool.\n\nJama Musse: Yeah.\n\nNikita Gorshkov: You had the last topic for one minute. I have my next Mhm.\n\nJama Musse: Yeah. So, so I don't know how to handle this.\n\n \n\n \n\n00:18:38\n\n \n\nJama Musse: I'm just bringing it to your radar, but um they want some product support from us on the B2B side. they are running into some hiccups in like with things like HIPPA compliance and things of that nature with the work that they're trying to do on the the factor food as medicine stuff and like the the selling the food into like the old age homes and things that they're trying to do in the B2B space.\n\nNikita Gorshkov: Yes. Yep.\n\nJama Musse: And so apparently because our products don't have we don't we're not listing the right type of information in order to meet HIPPA compliance.\n\nNikita Gorshkov: Yeah.\n\nJama Musse: We have to do something about it. They don't know what they have to do yet and they don't know the how. But like they're now panicking and they reached out to me and they're like HIPPA compliance like so we need I think we just need to sit down with them and understand what they need. I'm not saying we deliver it because we don't have a team to deliver it. But like the first step is like figure out what's going on, which I don't think they they know.\n\nNikita Gorshkov: But okay, sounds good. That's what she was referring to. Okay. Um, my question is, can't they consolidate this?\n\nJama Musse: Who's she? Who's she? Who's the she when you said that?\n\nNikita Gorshkov: Elena. Elena.\n\nJama Musse: No. No. This is a completely different. So this is on the other side with Adam Park and um Kieran.\n\nNikita Gorshkov: Oh, okay.\n\nJama Musse: Yeah.\n\nNikita Gorshkov: Okay.\n\nJama Musse: Anyway, I gota I gotta jump.\n\nNikita Gorshkov: Okay. Okay. So, just FYI, uh, in regards to that, don't they have Shopify? So, can't we modify the PDP so it it does include all the s***?\n\n \n\n \n\nTranscription ended after 00:20:40\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-10-.md",
      "source_date": "2025-12-10",
      "doc_type": "one_on_one",
      "matched_topics": [
        "otp"
      ],
      "matched_people": [
        "jama",
        "allison",
        "nikita"
      ],
      "filter_score": 4
    },
    {
      "title": "Eva:Nikita 1:1 - 2025/12/09 15:02 CET - Notes by Gemini",
      "doc_id": "1dIYA2ZM1iGCIjJ4fgQfAwn4SPGAOUoA4Fdbvgi0cu6k",
      "link": "https://docs.google.com/document/d/1dIYA2ZM1iGCIjJ4fgQfAwn4SPGAOUoA4Fdbvgi0cu6k/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 9, 2025\n\nEva:Nikita 1:1\n\nInvited Nikita Gorshkov Eva Martínez Romero\n\nAttachments Eva:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nNikita Gorshkov updated Eva Martínez Romero on the functioning AI-generated documentation system, which automatically updates and sets the next agenda, granting Eva Martínez Romero access. Eva Martínez Romero informed Nikita Gorshkov about an upcoming meeting with Tisha to discuss role expectations and salary, confirming a 12 to 18-month contract, with Nikita Gorshkov noting 18 months would require Jamba's support due to budget constraints involving Lauran and Yuri, and confirmed a salary range of plus minus 100k for the contract employee role. Eva Martínez Romero also detailed current team assignments and scope expansion, with Simon standardizing across brands, driving strategy for new ventures, and consolidating data, while Eva Martínez Romero serves as the team lead, allowing Alexia to focus on market innovations, and Eva Martínez Romero will share this summary with Nikita Gorshkov to ensure Lauron is informed.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* AI-Generated Documentation and Meeting Access Nikita Gorshkov mentioned that they are building an AI-generated documentation system that is working well, as all of the current documentation was generated automatically from the gathered context. Nikita Gorshkov granted Eva Martínez Romero access to this system, noting that it will update documentation on a meeting-by-meeting basis and set the next agenda. Eva Martínez Romero thanked them for the access (00:00:00).\n\n* Upcoming Meeting with Tisha and Role Expectations Eva Martínez Romero informed Nikita Gorshkov about a meeting with Tisha the next morning at 9:30 AM to collect information on Tisha's expectations, as Tisha confirmed interest in reviewing potential specs for a role. Nikita Gorshkov declined to join due to their night shift schedule, which means they start work around 10 to 10:30 AM (00:01:15). Eva Martínez Romero sought alignment on the contract length for the role, confirming the discussion around 12 to 18 months, with Nikita Gorshkov clarifying that 12 months is fine but 18 months would require support from Jamba due to next year's budgets, which affect Lauran and Yuri's ability to commit (00:02:18).\n\n* Budget and Contract Details for Tisha's Role Eva Martínez Romero planned to mention the 12-month contract option to Tisha and collect their salary expectations. Nikita Gorshkov stated that a salary range of plus minus 100k is acceptable, which corresponds to 100% base pay with no equity component for a contract employee, similar to Yara's arrangement (00:03:20). They confirmed that taxes and related calculations would be similar to normal contracts and that the start date is ideally as early as possible but realistically not before January. The headcount for this role will be assigned directly to Eva Martínez Romero's team (00:04:38).\n\n* Team Assignments and Simon's Role Expansion Eva Martínez Romero explained that the meeting with Tisha will focus on the role and Tisha's motivations, as they are already familiar with the context (00:05:49). Eva Martínez Romero then outlined the current plan for team assignments, stating that Simon, as a staff analyst, should be able to standardize things across brands, drive the long-term strategy for new ventures, and consolidate data from different domains, including Shopify and non-HelloFresh products. Simon will be the new ventures contact, while Eva Martínez Romero will serve as the team lead, which allows Alexia to step into shopp\n\n\n\n middle ground which is the market innovations which is going to be a little bit in between worlds right because there's this aspect that in the future we're going to be experimenting with pricing that it's something that\n\n \n\n \n\n00:08:12\n\n \n\nNikita Gorshkov: Yep.\n\nEva Martínez Romero: maybe probably Alexa will be very very keen on driving. We have the current iteration of the content for the content creators uh where I think Simon can be a good uh a good component.\n\nNikita Gorshkov: Huh?\n\nEva Martínez Romero: He has been on boarding in very different ecosystems and it's good to have uh somebody to drive the long-term strategy on how we're going to be consolidating this data from different domains because we are working on Shopify and and this data that it's not coming from the HelloFresh products directly. So that's more or less my thought in terms of how are we coordinating at the moment the the assignments but yeah he has been a little bit protected during the on boarding pro uh period so that he could\n\nNikita Gorshkov: Okay. Understood. Okay. Okay. Cool.\n\nEva Martínez Romero: on board and and ramp up with the with focusing on on VMS but I want him to span his scope already from the start of the year and in in in fact is starting already because he's taking over the perfect order of the rate for me already.\n\nNikita Gorshkov: Mhm. Oh, nice.\n\nEva Martínez Romero: So we are we are starting to board him on the new ventures as well.\n\nNikita Gorshkov: Perfect. Cool. I'll then uh or feel free to also reach out to Lauron if you want because then he he'd have a bit more um confidence that things are moving in the in the right direction. Um because that that's what he's been pummeling me and Addy about for some time and we're trying to like it's moving.\n\nEva Martínez Romero: Yeah, perfect. But I'll I'll write I'll write a summary of what I just shared with you in Slack because you're being also a Matt so that I can I can give that written form.\n\nNikita Gorshkov: Cool. Oh yeah, perfect.\n\nEva Martínez Romero: Uh I don't have time. It's a backto-back meetings, but I'll I'll make sure I capture that also in that thread.\n\nNikita Gorshkov: Nice. I hope the system will capture it, but yeah, we'll see.\n\n \n\n \n\nTranscription ended after 00:10:45\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/Archive/INBOX_2025-12-10-.md",
      "source_date": "2025-12-10",
      "doc_type": "one_on_one",
      "matched_topics": [
        "new ventures",
        "vms",
        "market innovation"
      ],
      "matched_people": [
        "nikita"
      ],
      "filter_score": 4
    },
    {
      "title": "Prateek:Nikita 1:1 - 2025/12/16 15:41 CET - Notes by Gemini",
      "doc_id": "1iLk0McQ23AHcVDLH0u1FhWSlJFOD-SzgcasejNL9xXE",
      "link": "https://docs.google.com/document/d/1iLk0McQ23AHcVDLH0u1FhWSlJFOD-SzgcasejNL9xXE/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 16, 2025\n\nPrateek:Nikita 1:1\n\nInvited Nikita Gorshkov Prateek Jajoo\n\nAttachments Prateek:Nikita 1:1 \n\nMeeting records Recording \n\n\n\n\n\nSummary\n\nNikita Gorshkov and Prateek Jajoo discussed two app development options: a full web view, estimated at 2 to 4 weeks for one engineer but with risks including Apple App Store issues, and a mixed approach of web view and React Native for prioritized, high-usage quick actions, estimated at four months for one engineer. Prateek Jajoo, who also discussed the CV program with Maria regarding its structure and ownership, agreed to formalize the app strategy into a decision tree with three options—Web View first, Mixed approach, and React Native from the start—detailing costs and risks, as requested by Nikita Gorshkov. Nikita Gorshkov confirmed the CV program is intended as a time-boxed initiative and that they are looking for Prateek Jajoo to take ownership, working with Maria and a team.\n\n\n\n\n\nDetails\n\nNotes Length: Standard\n\n* Personal Updates and Experience Nikita Gorshkov and Prateek Jajoo greeted each other and shared personal updates, with Prateek Jajoo mentioning a deep dive conversation with Ahmed about app features. Nikita Gorshkov mentioned having a rough night and reflected on the emotional and tiring experience of having children and working, emphasizing a new appreciation for people like Anessa and Samir who manage this. Prateek Jajoo also shared a related anecdote from when they were on a trading desk in New York.\n\n* App Development Strategy and Options Prateek Jajoo updated Nikita Gorshkov on discussions with Ahmed regarding two app development options. The first option is a fully web view with header and navigation bar customization, which has risks due to variable effort—partially because of shared code with HelloFresh—and potential issues with the Apple App Store, although Nikita Gorshkov noted that being a large company generally allows them some leeway with Apple. The estimated effort for the full web view is 2 to 4 weeks for one engineer, but if it exceeds 2 months, a direct move to React Native would be considered to avoid wasted effort.\n\n* React Native Integration and Prioritization The second option involves a mixed approach of web view and React Native for specific features in the v0 app, focusing on high-usage quick actions like reschedule and pause, which Nikita Gorshkov noted are more important than the dashboard for improving estimations. Prateek Jajoo confirmed they had prioritized key features for React Native development, such as the dashboard, seeing the digital guide, and managing/selecting meals, which are frequently used by retained customers. Full React Native implementation for the HelloFresh app is expected in Quarter 2, with the infrastructure possibly ready sooner. The estimation for the mixed approach (select features in React Native, the rest in web view) is 4 months for one engineer.\n\n* Next Steps for App Strategy and Cost Focus Nikita Gorshkov outlined the need for Prateek Jajoo to formalize the discussion into a decision tree with three options: Option 1 (Web View first), Option 2 (Mixed approach), and Option 3 (React Native from the start using new infrastructure), detailing associated costs and risks for each. Nikita Gorshkov stressed that the current focus should be on these options and their costs, considering any revenue predictions (like the 5% AOR and $2 AOE calculated by AI) as arbitrary due to evolving functionality. Prateek Jajoo agreed to structure and share the options.\n\n* CV Program Discussion and Ownership Prateek Jajoo also discussed the CV program with Maria and sought clarity on whether it is a time-boxed project or a split between conversion, growth, and retention efforts. Nikita Gorshkov confirmed they want a time box for the initiative and have been angling towards Prateek Jajoo taking ownership of the initiative, working with Maria and a team to drive outcomes. Prateek Jajoo expressed interest, viewing it as a good opportunity to understand the customer experience and funnel. They plan to discuss bandwidth with Maria and agreed that an answer on the decision should be given by the pet staple weekly tomorrow.\n\n\n\n\n\nSuggested next steps\n\n* Prateek Jajoo will talk to Maria tomorrow to discuss their bandwidth regarding the CV program and provide an answer by the pet staple weekly tomorrow.\n\n* Prateek Jajoo will chase the web view idea with Emma at the start of the new year to discuss required customizations.\n\n* Prateek Jajoo will formalize discussions and create a decision tree outlining three options for the app development, including costs and risks for each, to be presented to Laurel.\n\n* Prateek Jajoo will create reasonable assumptions around the AI-calculated impact numbers to come up with a revenue estimate.\n\n* Nikita Gorshkov will ask about a time box around the CV program initiative.\n\n\n\n\n\nYou should review Gemini's notes to make sure they're accurate. Get tips and learn how Gemini takes notes\n\nPlease provide feedback about using Gemini to take notes in a short survey.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-17-.md",
      "source_date": "2025-12-17",
      "doc_type": "one_on_one",
      "matched_topics": [],
      "matched_people": [
        "maria",
        "prateek",
        "ahmed",
        "nikita"
      ],
      "filter_score": 4
    },
    {
      "title": "Sameer:Nikita 1:1 - 2025/12/22 15:31 CET - Notes by Gemini",
      "doc_id": "19OHKfUxQa7FqqAvHDU5pD_MptZK9reL6edv6U89KIYM",
      "link": "https://docs.google.com/document/d/19OHKfUxQa7FqqAvHDU5pD_MptZK9reL6edv6U89KIYM/edit?usp=drivesdk",
      "content": "﻿📝 Notes\n\nDec 22, 2025\n\nSameer:Nikita 1:1\n\nInvited Nikita Gorshkov Sameer Doda\n\nAttachments Sameer:Nikita 1:1 \n\nMeeting records Transcript \n\n\n\n\n\nSummary\n\nSameer Doda congratulated Nikita Gorshkov on their promotion, which led to a discussion on making the B2B setup for the Canadian store simple and cheap, including options for product upload and maintenance involving Ian's team, Leman, or leveraging US automation, which Sameer Doda recommended replicating. Regarding GCNL, Sameer Doda provided an update on resolving daily issues to ensure week three production testing goes as planned, which required manual menu creation with Catherine due to technical difficulties, and noted account migration/plan migration and payments as future blockers that Mori and Ryan will help Leman manage. Sameer Doda is preparing for an influencer marketplace presentation with Ed by working with Lineia, Alice Kanty, and Jordan Stennison on the customer journey and with Shay on designs, with a key decision being whether to launch the customer-facing and creator portals together; they will create a document on possible approaches and costs for discussion with Ed, Ian, and Jamba.\n\n\n\n\n\nDetails\n\n* Congratulations on Promotion Sameer Doda began the meeting by enthusiastically congratulating Nikita Gorshkov on their promotion, noting it was incredible news and well-deserved. Nikita Gorshkov thanked Sameer Doda, confirming the timing made their Christmas \"really special,\" although the promotion and another event were originally planned for November 11th (00:00:00). Nikita Gorshkov also acknowledged that many promotions, specifically from director to senior director, were within the TAM organization, viewing this as a positive reflection of the team's ability to deliver results (00:00:57).\n\n* B2B Strategy and Shopify Store Setup The meeting was a general check-in, prompted by the completion of the Shopify project, leading to a discussion about the B2B question. Sameer Doda and Nikita Gorshkov discussed the objective of making the B2B setup as simple, \"dumb,\" and cheap as possible, suggesting using Ellie for support alongside Ian since Sameer Doda would be busy with other tasks (00:02:06). A crucial step is setting up the Canadian store, which requires technical inputs and someone to manage the menu page, products, and catalog, with catalog maintenance involving prices, noting the difficulty of setting prices individually on Shopify's front end (00:03:04).\n\n* Product Upload and Maintenance for B2B Nikita Gorshkov suggested uploading approximately 200 recipes once and then maintaining the menus on a weekly basis. Sameer Doda pointed out that manually uploading 200 recipes would be a major task, suggesting it could be done via code by an engineering team member, possibly Leman if it can be tied to the MIOS score (00:04:07). Alternatively, using Hello Connect could upload the products, potentially taking about a week, after which Sameer Doda or Allison could review the setup. Since orders placed through Shopify won't automatically tie into downstream services, someone will have to manually generate and fulfill those orders, though Ian only requires a spreadsheet of orders (00:05:02).\n\n* Leveraging US Automation for Canadian B2B Sameer Doda introduced an alternative approach by potentially replicating the automation used for the US B2B business, which includes building a menu off of CCM and using tags to pull only the recipes that are in the classic box menu for a given week (00:05:55). This automation automatically writes the menus and catalogs every week, including associ\n\n\n\nI will probably spend time tomorrow and day after doing\n\nNikita Gorshkov: Okay. I mean, okay,\n\nSameer Doda: that.\n\nNikita Gorshkov: I was about to say like at the end of the day, um, like with the good stuff, you could pawn this off even more over to our friend's Ally and she can take it from there. Don't think that's would not be okay.\n\nSameer Doda: I I thought about it but then there is one key difference which is in the business stakeholder in both cases. So Laura is a very different personality from Yuri and S. And so you with Laura the one of the things that we were able to do with Laura was that we were able to actually just mark some things off for Laura and be like Laura you got to go and take care of these right with Yuri.\n\n \n\n \n\n00:25:47\n\n \n\nNikita Gorshkov: H\n\nSameer Doda: I think that I don't know if you'll probably have the same flexibility. We'll probably obviously have to find the PC's in Yuri's team to take care of a bunch of things uh that that Laura did for\n\nNikita Gorshkov: I'm Yeah, exactly.\n\nSameer Doda: us.\n\nNikita Gorshkov: There there's people and you can always ask your support for honestly anything.\n\nSameer Doda: Yeah.\n\nNikita Gorshkov: Like I wouldn't worry about that piece too much,\n\nSameer Doda: So what I my my intent with this initiative is that only for the initial pieces for the strategy doc\n\nNikita Gorshkov: man.\n\nSameer Doda: for the setup of uh you know work requirements with anara is where I'll be\n\nNikita Gorshkov: H Okay.\n\nSameer Doda: involved more than I was involved for factor form but then once once we are more into an implementation pace where it's just get this in integrated get this done get this done that is where I just leave it to Alli a little bit more than I did for factor form and\n\nNikita Gorshkov: Okay. Okay.\n\nSameer Doda: yeah at that point because it'll anyways be I'm assuming that by that point in\n\nNikita Gorshkov: Sounds good.\n\nSameer Doda: time I'll be a lot more involved with the cream chef stuff the premium subscription and the influencer so they'll already be four things that I'll be managing so I will definitely need some mind\n\nNikita Gorshkov: Exactly.\n\nSameer Doda: space yeah sounds good sir thank you for the connects see you\n\n \n\n \n\nTranscription ended after 00:27:08\n\n\n\n\n\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created.",
      "source_file": "AI_Guidance/Brain/Inbox/INBOX_2025-12-23-.md",
      "source_date": "2025-12-23",
      "doc_type": "one_on_one",
      "matched_topics": [
        "factor form"
      ],
      "matched_people": [
        "sameer",
        "allison",
        "nikita"
      ],
      "filter_score": 4
    }
  ],
  "doc_count": 8,
  "total_chars": 47103
}