{
  "batch_id": "C06CT0185T3_1765368418.388899",
  "channel_name": "tribe-new-ventures-leads-internal",
  "channel_id": "C06CT0185T3",
  "message_count": 10,
  "analyzed_at": "2026-01-02T13:03:10.325684",
  "decisions": [
    {
      "what": "Automate sprint reporting process instead of manual updates",
      "who": [
        "U03TY4YJU4X",
        "U027201FQSV",
        "U087178ACSD",
        "UEZ4PRFKM"
      ],
      "date": "First thread discussion",
      "context": "Required to fill out sprint reports every sprint per company mandate. Team decided to automate KPI tracking, deliverables capture, learnings extraction, and sprint planning rather than manual updates",
      "confidence": "high"
    },
    {
      "what": "Company-wide sprint alignment starting Jan 5 (Monday) instead of team preference for Tuesday",
      "who": [
        "U03TY4YJU4X",
        "U027201FQSV"
      ],
      "date": "Jan 5 discussion",
      "context": "Company guidance mandates all sprints start Jan 5, overriding team's preference to maintain Tuesday sprint starts for office alignment",
      "confidence": "high"
    },
    {
      "what": "Use event-driven Jira webhooks for sprint completion tracking",
      "who": [
        "U08E2S3V5D1",
        "U03TY4YJU4X"
      ],
      "date": "Automation discussion thread",
      "context": "Event-driven approach preferred over time-based scripts to handle different timezones and varying sprint completion times",
      "confidence": "medium"
    },
    {
      "what": "VMS mobile app development delayed to Q2, starting February",
      "who": [
        "U09D8BZ9891",
        "U03TY4YJU4X"
      ],
      "date": "Q1 OKR discussion",
      "context": "January will focus on 2 new physical products and OTP iteration, pushing mobile app work to February",
      "confidence": "high"
    },
    {
      "what": "Price Sets experimentation feasible for single product family brands",
      "who": [
        "U027201FQSV",
        "U8F7ZDAPM",
        "U03TY4YJU4X"
      ],
      "date": "Price experimentation discussion",
      "context": "Good Chop can use Price Sets for classic-box product family, excluding trial boxes and OTP from experiments",
      "confidence": "high"
    }
  ],
  "entities": [
    {
      "name": "U03TY4YJU4X",
      "type": "person",
      "context": "Lead coordinator driving automation initiatives, AHM presentation, and Q1 planning",
      "relationships": [
        "U027201FQSV",
        "U087178ACSD",
        "UEZ4PRFKM",
        "U01BT6RE4JG"
      ]
    },
    {
      "name": "U027201FQSV (Alex)",
      "type": "person",
      "context": "Leading automation for sprint deliverables and planning, working on Good Chop price experimentation",
      "relationships": [
        "U03TY4YJU4X",
        "U8F7ZDAPM"
      ]
    },
    {
      "name": "Good Chop (GoC)",
      "type": "brand",
      "context": "Brand experiencing issues, working on price experimentation, achieved free cuts on reactivation success",
      "relationships": [
        "TPT",
        "VMS",
        "MIO",
        "Wallet Migration"
      ]
    },
    {
      "name": "The Pets Table (TPT)",
      "type": "brand",
      "context": "Team scaled from 5 to 14 contributors in Q4, achieved 25% gross CVR improvement with Free Items launch",
      "relationships": [
        "GoC",
        "VMS",
        "/web repo"
      ]
    },
    {
      "name": "VMS (Virtual Multi-Service)",
      "type": "project",
      "context": "Tracks Factor penetration KPI (baseline 0.32%), planning mobile app launch in Q2",
      "relationships": [
        "Factor",
        "shared-mobile-modules",
        "/web repo"
      ]
    },
    {
      "name": "MIO (Market Innovation and Optimization)",
      "type": "squad",
      "context": "Private Jira project tracking confirmed orders KPI, team doesn't use traditional sprints/retros",
      "relationships": [
        "U01BT6RE4JG",
        "UEZ4PRFKM"
      ]
    },
    {
      "name": "Wallet Migration",
      "type": "project",
      "context": "Consumed ~30% of engineering capacity in 2025 to fit Good Chop requirements, identified as biggest learning",
      "relationships": [
        "GoC"
      ]
    },
    {
      "name": "PM-OS",
      "type": "system",
      "context": "System proposed for automating learning extraction from discussions and updates",
      "relationships": [
        "U03TY4YJU4X",
        "sprint automation"
      ]
    },
    {
      "name": "Christmas Box",
      "type": "project",
      "context": "Launched for AU, NZ, CA as one-time box without subscription, new seasonal revenue stream",
      "relationships": [
        "U02CRDYF2NL"
      ]
    },
    {
      "name": "Price Sets",
      "type": "system",
      "context": "Price experimentation tool, currently supports single product family, planned for Feb implementation",
      "relationships": [
        "GoC",
        "U8F7ZDAPM"
      ]
    },
    {
      "name": "U087178ACSD",
      "type": "person",
      "context": "Responsible for automating KPI movement tracking as part of 2026 P0 work",
      "relationships": [
        "U03TY4YJU4X",
        "PA-25652"
      ]
    },
    {
      "name": "U01BT6RE4JG (Wander)",
      "type": "person",
      "context": "MIO team member, manages on-call schedule, doesn't use Miro/Sprints/Retros",
      "relationships": [
        "MIO",
        "UEZ4PRFKM"
      ]
    },
    {
      "name": "U09D8BZ9891",
      "type": "person",
      "context": "VMS lead tracking Factor penetration, planning mobile app and physical products",
      "relationships": [
        "VMS",
        "U03TY4YJU4X"
      ]
    }
  ],
  "blockers": [
    {
      "description": "Backend work required for Price Sets to support multiple product families",
      "owner": "U8F7ZDAPM",
      "status": "active",
      "impact": "Delays price experimentation for brands with multiple product families until Feb"
    },
    {
      "description": "VMS Factor penetration OKR unlikely to change in Q1 due to mobile app delay",
      "owner": "U09D8BZ9891",
      "status": "active",
      "impact": "Q1 OKR targets may not be achievable, need alternative quick wins"
    },
    {
      "description": "Automation of 'Key Learnings' section is tricky due to unclear definition",
      "owner": "U03TY4YJU4X",
      "status": "active",
      "impact": "May require manual curation or AI summarization from retros/meeting notes"
    },
    {
      "description": "Video requirement for sprint reports with no clear automation path",
      "owner": "Team",
      "status": "active",
      "impact": "May need to rely on internal demo recordings or PR/ticket attachments"
    },
    {
      "description": "MIO Jira project access restricted by default",
      "owner": "U01BT6RE4JG",
      "status": "resolved",
      "impact": "Blocked automation access, resolved by adding team members"
    }
  ],
  "action_items": [
    {
      "task": "Automate KPI movement tracking based on north star KPIs",
      "owner": "U087178ACSD",
      "due": "Part of 2026 P0 work",
      "status": "pending"
    },
    {
      "task": "Lead automation for sprint deliverables capture (Epic level + improvements)",
      "owner": "U027201FQSV",
      "due": "Ongoing",
      "status": "pending"
    },
    {
      "task": "Automate planned deliverables for next sprint",
      "owner": "U027201FQSV",
      "due": "Ongoing",
      "status": "pending"
    },
    {
      "task": "Submit candidates for AHM presentation (biggest win, learning, unexpected moment)",
      "owner": "Team",
      "due": "14:00 next day",
      "status": "done"
    },
    {
      "task": "Fill out AHM presentation with numbers, screenshots, and content",
      "owner": "U01AKGWGLC8, U03UMPD2NNS, U08AXBW1CAZ, UE4HG114J, UEZ4PRFKM",
      "due": "Before AHM",
      "status": "done"
    },
    {
      "task": "Check New Year's Dinner invite for Berlin team members",
      "owner": "U03UMPD2NNS, U01AKGWGLC8, U027201FQSV",
      "due": "ASAP",
      "status": "pending"
    },
    {
      "task": "Create Q1 OKR calculations ticket PA-25652",
      "owner": "U03TY4YJU4X",
      "due": "Q1 planning",
      "status": "done"
    },
    {
      "task": "Identify quick win opportunities for VMS Factor penetration in Q1",
      "owner": "U09D8BZ9891",
      "due": "Before Q1 starts",
      "status": "pending"
    },
    {
      "task": "Add team members to MIO Jira project",
      "owner": "U01BT6RE4JG",
      "due": "Immediate",
      "status": "done"
    }
  ],
  "key_context": [
    {
      "topic": "Sprint Reporting Automation",
      "summary": "Company mandates bi-weekly sprint reports via Google Sheets. Team is building comprehensive automation using Jira webhooks, Gemini AI for retro notes, and PM-OS for learning extraction to eliminate manual effort.",
      "relevance": "Critical for reducing team overhead and maintaining compliance with company reporting requirements"
    },
    {
      "topic": "2025 Year in Review Highlights",
      "summary": "Major wins include 25% CVR improvement from Free Items (TPT), free cuts on reactivation doubling conversion (GoC), Christmas box launch (AU/NZ/CA), and AI workflow embedding. Key learning was Wallet Migration consuming 30% eng capacity.",
      "relevance": "Demonstrates team impact and informs strategic priorities for 2026"
    },
    {
      "topic": "Q1 2026 OKR Planning",
      "summary": "Squad KPIs mapped: GoC/TPT track Net Revenue, VMS tracks Factor penetration (0.32% baseline), MIO tracks confirmed orders. VMS mobile app delayed to Q2, requiring alternative quick wins for Q1.",
      "relevance": "Sets performance targets and identifies resource allocation needs for upcoming quarter"
    },
    {
      "topic": "Price Experimentation Infrastructure",
      "summary": "Price Sets system available for single product family brands. Good Chop can experiment on classic-box family. Multi-family support requires backend work planned for February.",
      "relevance": "Enables revenue optimization experiments while clarifying technical constraints"
    },
    {
      "topic": "Team Structure and Processes",
      "summary": "TPT scaled from 5 to 14 contributors. MIO operates without traditional sprints/retros. Company mandating sprint alignment to Jan 5 start date across all teams despite local preferences.",
      "relevance": "Highlights growth trajectory and need for flexible automation to accommodate diverse team workflows"
    }
  ],
  "summary": "New Ventures team is automating mandatory bi-weekly sprint reporting using Jira webhooks and AI while preparing Q1 2026 OKRs and reflecting on 2025 achievements including major conversion improvements and infrastructure migrations."
}