{
  "batch_id": "C06CT0185T3_1763997054.960619",
  "channel_name": "tribe-new-ventures-leads-internal",
  "channel_id": "C06CT0185T3",
  "message_count": 8,
  "analyzed_at": "2026-01-02T13:02:22.853873",
  "decisions": [
    {
      "what": "No code merges allowed during Nov 26-28 (Black Friday/Cyber Monday) and Dec 24-Jan 4 (Christmas & New Year) for web repo",
      "who": [
        "UEZ4PRFKM",
        "U2D54V0UV"
      ],
      "date": "Discussion date not specified, applies to Nov-Jan period",
      "context": "Web repo is not opted out for No Deployment Days, so squads must respect these blackout periods and schedule deployments around them",
      "confidence": "high"
    },
    {
      "what": "UEZ4PRFKM will approve PRs for Approved Deployment Days during peak",
      "who": [
        "UEZ4PRFKM",
        "U027201FQSV"
      ],
      "date": "For Monday deployment (context suggests peak period)",
      "context": "Approved Deployment Days require Tribe Lead approval and 'peak-approved' label for services not using Progressive Delivery or on Opt-In list",
      "confidence": "high"
    },
    {
      "what": "Use ACT-A-8 (Subscription flexibility) KR for BNL migration IT Cap reporting",
      "who": [
        "U03TY4YJU4X",
        "U01BT6RE4JG",
        "UEZ4PRFKM"
      ],
      "date": "During IT Cap reporting discussion",
      "context": "No specific KR existed for BNL migration work, needed generic enough KR that isn't cancelled or done for capitalization purposes",
      "confidence": "high"
    },
    {
      "what": "Continue using TAM-A-14-VMS for Factor Form Shopify initiative IT Cap reporting",
      "who": [
        "U01BT6RE4JG",
        "U02CRDYF2NL"
      ],
      "date": "Monthly IT Cap reporting period",
      "context": "Consistent with previous month's reporting approach",
      "confidence": "high"
    },
    {
      "what": "Defer Zest UI2 adoption completion until brand refresh in second half of 2026",
      "who": [
        "UEZ4PRFKM",
        "U01AKGWGLC8"
      ],
      "date": "2026 planning discussion",
      "context": "~60 files still need updates per brand; external agency brand refresh won't kick off until second part of 2026, so Zest migration should align with that effort",
      "confidence": "medium"
    },
    {
      "what": "WoCo team legally requires secure, private rooms; no quick solution to meeting space shortage",
      "who": [
        "U03TY4YJU4X"
      ],
      "date": "Office space discussion",
      "context": "Ground floor quiet area being subleased for cost-saving; smart building limitations prevent quick creation of additional meeting rooms",
      "confidence": "high"
    }
  ],
  "entities": [
    {
      "name": "UEZ4PRFKM",
      "type": "person",
      "context": "Tribe Lead (Engineering), approves peak deployments, manages peak readiness",
      "relationships": [
        "New Ventures Tribe",
        "U027201FQSV",
        "U03TY4YJU4X"
      ]
    },
    {
      "name": "U027201FQSV",
      "type": "person",
      "context": "Engineering lead for Good Chop squad, manages PRs and peak readiness",
      "relationships": [
        "Good Chop Squad",
        "UEZ4PRFKM",
        "U01AKGWGLC8"
      ]
    },
    {
      "name": "U03TY4YJU4X",
      "type": "person",
      "context": "Tribe Lead (Product), handles office space issues and KR assignments",
      "relationships": [
        "New Ventures Tribe",
        "UEZ4PRFKM"
      ]
    },
    {
      "name": "Good Chop Squad",
      "type": "squad",
      "context": "Squad working on Good Chop brand, completed peak readiness documentation",
      "relationships": [
        "U027201FQSV",
        "U01AKGWGLC8",
        "Zest",
        "Good Chop brand"
      ]
    },
    {
      "name": "The Pets Table Squad",
      "type": "squad",
      "context": "Squad working on TPT brand, no concrete rebranding plans yet",
      "relationships": [
        "U03UMPD2NNS",
        "U8F7ZDAPM",
        "TPT brand"
      ]
    },
    {
      "name": "Market Innovation & Optimization Squad",
      "type": "squad",
      "context": "MIO squad working on BNL migration and IT Cap reporting",
      "relationships": [
        "U01BT6RE4JG",
        "U02CRDYF2NL",
        "BNL migration"
      ]
    },
    {
      "name": "Factor Form Squad",
      "type": "squad",
      "context": "Squad working on Factor Form Shopify initiative and OTP handoff",
      "relationships": [
        "U09D8BZ9891",
        "U01V9SX5NG5",
        "U02CRDYF2NL",
        "TAM-A-14-VMS"
      ]
    },
    {
      "name": "Zest",
      "type": "system",
      "context": "UI component system with ~60 files per brand still needing migration to UI2",
      "relationships": [
        "Good Chop brand",
        "TPT brand",
        "UI2"
      ]
    },
    {
      "name": "BNL migration",
      "type": "project",
      "context": "Migration project attributed to ACT-A-8 KR for IT capitalization",
      "relationships": [
        "Market Innovation & Optimization Squad",
        "ACT-A-8"
      ]
    },
    {
      "name": "WoCo",
      "type": "squad",
      "context": "Works Council team of <6 people with legal requirement for secure rooms, occupying Panna Cotta and Gulab Jamun on 3rd floor",
      "relationships": [
        "Office Management",
        "3rd floor meeting rooms"
      ]
    },
    {
      "name": "U08E2S3V5D1",
      "type": "person",
      "context": "New team member welcomed to New Ventures tribe",
      "relationships": [
        "New Ventures Tribe"
      ]
    },
    {
      "name": "Good Chop brand",
      "type": "brand",
      "context": "Brand planning external agency refresh in second half of 2026",
      "relationships": [
        "Good Chop Squad",
        "Zest",
        "U01AKGWGLC8"
      ]
    },
    {
      "name": "TPT brand",
      "type": "brand",
      "context": "The Pets Table brand with no concrete rebranding plans yet",
      "relationships": [
        "The Pets Table Squad",
        "U03UMPD2NNS"
      ]
    }
  ],
  "blockers": [
    {
      "description": "Meeting room shortage on 3rd floor due to WoCo occupying Panna Cotta and Gulab Jamun; finding standup space is challenging",
      "owner": "UEZ4PRFKM, U03TY4YJU4X",
      "status": "active",
      "impact": "New Ventures tribe and AX teams on 3rd floor cannot find meeting space; will worsen when everyone returns in 2026"
    },
    {
      "description": "Permission issues editing peak readiness documentation",
      "owner": "U01BT6RE4JG",
      "status": "resolved",
      "impact": "Workaround: add links as comments instead of direct edits"
    },
    {
      "description": "~60 files per brand still need Zest UI2 migration",
      "owner": "Good Chop Squad, The Pets Table Squad",
      "status": "active",
      "impact": "Cannot fully leverage UI2 on Zest; deferred until brand refresh in H2 2026"
    }
  ],
  "action_items": [
    {
      "task": "Fill out peak readiness spreadsheet with alerts and monitoring dashboards per squad",
      "owner": "U8F7ZDAPM, U01BT6RE4JG, U01V9SX5NG5",
      "due": "Dec 5th",
      "status": "done (U027201FQSV completed for Good Chop, U01V9SX5NG5 working on it)"
    },
    {
      "task": "Send list of PRs requiring peak-approved label for Monday Approved Deployment Day",
      "owner": "U027201FQSV",
      "due": "Before Monday deployment",
      "status": "pending"
    },
    {
      "task": "Raise office meeting space issue with Nikita and escalate to Office Management",
      "owner": "UEZ4PRFKM",
      "due": "When Nikita returns next week",
      "status": "pending"
    },
    {
      "task": "Complete monthly IT Cap Report for respective squads",
      "owner": "All squad leads (U03TY4YJU4X, UEZ4PRFKM, U03UMPD2NNS, U8F7ZDAPM, U01AKGWGLC8, U027201FQSV, U02CRDYF2NL, U01BT6RE4JG, U09D8BZ9891, U01V9SX5NG5)",
      "due": "End of month",
      "status": "pending"
    },
    {
      "task": "Provide feedback on GenAI usage survey before sharing with tribe",
      "owner": "Tribe members",
      "due": "Not specified",
      "status": "pending"
    },
    {
      "task": "Consider Zest UI2 migration effort when brand refresh comes onto 2026 roadmap",
      "owner": "U01AKGWGLC8, UEZ4PRFKM",
      "due": "H2 2026",
      "status": "pending"
    }
  ],
  "key_context": [
    {
      "topic": "Peak Season Deployment Restrictions",
      "summary": "No code merges allowed during Black Friday/Cyber Monday (Nov 26-28) and Christmas/New Year (Dec 24-Jan 4). Approved Deployment Days during peak require Tribe Lead approval with 'peak-approved' label and updated PR templates including risk assessments.",
      "relevance": "Critical for ensuring system stability during high-traffic periods; affects all squad deployment planning"
    },
    {
      "topic": "Peak Readiness Documentation",
      "summary": "Platform team requires all squads to document alerts and monitoring dashboards in peak readiness spreadsheet by Dec 5th. This ensures adequate observability during peak traffic periods.",
      "relevance": "Mandatory compliance requirement; helps validate system stability monitoring capabilities"
    },
    {
      "topic": "Office Space Crisis",
      "summary": "3rd floor meeting room shortage due to WoCo occupying two large rooms (Panna Cotta, Gulab Jamun) while ground floor being subleased. Immediate solution is increased Mezzanine usage; mid-term solution involves Mezzanine improvements and additional phonebooths.",
      "relevance": "Impacts daily operations and team collaboration; will worsen significantly when full team returns in 2026"
    },
    {
      "topic": "IT Capitalization KR Mapping",
      "summary": "Teams need to map work to active KRs for IT Cap reporting. BNL migration mapped to ACT-A-8 (Subscription flexibility), Factor Form Shopify to TAM-A-14-VMS. Cannot use DONE or CANCELLED KRs for capitalization.",
      "relevance": "Required for monthly financial reporting and proper cost capitalization of development work"
    },
    {
      "topic": "Zest UI2 Migration Deferral",
      "summary": "~60 files per brand still need Zest UI2 updates. Migration deferred until brand refresh with external agency in H2 2026. New components use Zest, but legacy components remain unmigrated.",
      "relevance": "Technical debt that will need addressing during rebranding; affects UI consistency and maintainability"
    },
    {
      "topic": "GenAI Usage Survey",
      "summary": "Tribe leadership creating survey to understand how members use GenAI and how to better support them. Feedback requested on survey length and question framing before broader distribution.",
      "relevance": "Helps identify opportunities to improve developer productivity and AI tool adoption"
    }
  ],
  "summary": "New Ventures tribe coordinating peak season deployment restrictions, completing mandatory peak readiness documentation by Dec 5th, addressing critical 3rd floor meeting room shortage, managing IT Cap reporting with proper KR attribution, and deferring Zest UI2 migration until H2 2026 brand refresh."
}