{
  "batch_id": "C09NKC5J2GL_1765537895.951779",
  "channel_name": "squad-market-io",
  "channel_id": "C09NKC5J2GL",
  "message_count": 10,
  "analyzed_at": "2026-01-02T13:07:22.287819",
  "decisions": [
    {
      "what": "Both old (BFF) and new (NV-CRM) event systems will coexist during migration without interfering with each other",
      "who": [
        "U047SAC2PPV"
      ],
      "date": "thread discussion",
      "context": "To avoid migrating multiple clients simultaneously and allow gradual rollout of the new NV-CRM approach for subscribable addon email notifications",
      "confidence": "high"
    },
    {
      "what": "CRM team completely migrated Factor emails to NV-CRM events, no longer using BFF events",
      "who": [
        "U047SAC2PPV",
        "CRM team"
      ],
      "date": "current status",
      "context": "Part of phased migration from old BFF-based email triggering to new NV-CRM event system",
      "confidence": "high"
    },
    {
      "what": "TPT started using NV-CRM events in live environment",
      "who": [
        "U2D54V0UV",
        "US74TEQ3E"
      ],
      "date": "yesterday (referenced)",
      "context": "Continuing migration of brands from BFF to NV-CRM event system",
      "confidence": "medium"
    },
    {
      "what": "Programs feature is being killed and customers are being migrated",
      "who": [
        "U2D54V0UV"
      ],
      "date": "current",
      "context": "Topic is on hold for now during customer migration",
      "confidence": "high"
    }
  ],
  "entities": [
    {
      "name": "Factor",
      "type": "brand",
      "context": "Brand providing subscribable add-ons, fully migrated to NV-CRM events",
      "relationships": [
        "NV-CRM",
        "subscribable-addons-bff",
        "Salesforce"
      ]
    },
    {
      "name": "ThePetsTable (TPT)",
      "type": "brand",
      "context": "Brand providing subscribable add-ons, migrated to NV-CRM events in staging and live",
      "relationships": [
        "NV-CRM",
        "subscribable-addons-bff",
        "Salesforce",
        "TPT-2336"
      ]
    },
    {
      "name": "GoodChop (GoC)",
      "type": "brand",
      "context": "Brand using subscribable-addons-bff on frontend but never configured Salesforce integration",
      "relationships": [
        "subscribable-addons-bff",
        "White Label"
      ]
    },
    {
      "name": "HelloFresh US",
      "type": "brand",
      "context": "Enabled on NV-CRM but events are not actually used",
      "relationships": [
        "NV-CRM"
      ]
    },
    {
      "name": "YouFoodz",
      "type": "brand",
      "context": "In process of migrating to new app",
      "relationships": []
    },
    {
      "name": "subscribable-addons-bff",
      "type": "system",
      "context": "Legacy BFF service for generating addon subscription events, being deprecated",
      "relationships": [
        "Factor",
        "TPT",
        "GoodChop",
        "Salesforce",
        "MSS"
      ]
    },
    {
      "name": "NV-CRM",
      "type": "system",
      "context": "New event service generating addon subscription change events without web client involvement",
      "relationships": [
        "MSS",
        "Kafka",
        "Salesforce",
        "Factor",
        "TPT",
        "HelloFresh US"
      ]
    },
    {
      "name": "new-ventures-bff",
      "type": "project",
      "context": "New BFF architecture project with tickets in TPT board",
      "relationships": [
        "TPT-2336"
      ]
    },
    {
      "name": "U047SAC2PPV",
      "type": "person",
      "context": "Developer explaining subscribable addon migration, created TPT tickets",
      "relationships": [
        "NV-CRM",
        "TPT-2336"
      ]
    },
    {
      "name": "U2D54V0UV",
      "type": "person",
      "context": "Following up on GoodChop and YouFoodz migrations",
      "relationships": [
        "GoodChop",
        "YouFoodz"
      ]
    },
    {
      "name": "U8F7ZDAPM",
      "type": "person",
      "context": "Clarifying GoodChop's use of subscribable-addons-bff on frontend",
      "relationships": [
        "GoodChop"
      ]
    },
    {
      "name": "squad-market-io",
      "type": "squad",
      "context": "Channel renamed from market-innovation to squad-market-io",
      "relationships": [
        "MIO-59",
        "MIO-60"
      ]
    }
  ],
  "blockers": [
    {
      "description": "subscribable-addons-bff service cannot be deprecated until all clients (including GoodChop) stop calling it",
      "owner": "U2D54V0UV",
      "status": "active",
      "impact": "Service deprecation timeline blocked; affects Factor, TPT, GoodChop, and potentially other White Label brands",
      "confidence": "high"
    },
    {
      "description": "Uncertainty about whether GoodChop frontend changes are covered by shared White Label code or require separate work",
      "owner": "U8F7ZDAPM",
      "status": "active",
      "impact": "GoodChop migration planning and effort estimation",
      "confidence": "medium"
    }
  ],
  "action_items": [
    {
      "task": "Follow up with GoodChop about next steps for migrating away from subscribable-addons-bff",
      "owner": "U2D54V0UV",
      "due": "not specified",
      "status": "pending"
    },
    {
      "task": "Follow up on YouFoodz migration to new app status",
      "owner": "U2D54V0UV",
      "due": "not specified",
      "status": "pending"
    },
    {
      "task": "Verify all clients have stopped calling subscribable-addons-bff before sunsetting the service",
      "owner": "U2D54V0UV",
      "due": "not specified",
      "status": "pending"
    },
    {
      "task": "Create Phase 2 tickets for new-ventures-bff based on Phase 1 outcomes",
      "owner": "unassigned",
      "due": "after Phase 1 completion",
      "status": "pending"
    },
    {
      "task": "Add translations for dropdown to Lokalize (MIO-59)",
      "owner": "Ameek",
      "due": "not specified",
      "status": "pending"
    }
  ],
  "key_context": [
    {
      "topic": "Subscribable Add-ons Email Event Migration",
      "summary": "Two-phase migration from legacy BFF-based email triggering to new NV-CRM event system. Factor fully migrated, TPT in production, GoodChop and other clients need to stop using old BFF before deprecation.",
      "relevance": "Critical for service deprecation timeline and affects multiple brands (Factor, TPT, GoodChop, HelloFresh US)"
    },
    {
      "topic": "Dual Event System Architecture",
      "summary": "Old system (Web → BFF → Salesforce) and new system (Web → MSS → Kafka → NV-CRM → Salesforce) coexist during migration. CRM team controls which events trigger emails.",
      "relevance": "Enables gradual migration without breaking existing functionality across multiple brands"
    },
    {
      "topic": "GoodChop Special Case",
      "summary": "GoodChop uses subscribable-addons-bff on frontend but never configured Salesforce integration, so doesn't need NV-CRM onboarding but must stop calling BFF.",
      "relevance": "Blocks BFF deprecation; unclear if shared White Label code changes will cover GoodChop automatically"
    },
    {
      "topic": "New Ventures BFF Project",
      "summary": "Phase 1 tickets created in TPT board (TPT-2336) with labels for tracking (nv-bff, mio-dep, not-blocker). Phase 2 tickets to be created based on Phase 1 outcomes.",
      "relevance": "Defines implementation strategy and work breakdown for Pet Food BFF architecture"
    }
  ],
  "summary": "Discussion covers migration from legacy subscribable-addons-bff to NV-CRM event system for addon subscription emails across multiple brands (Factor complete, TPT live, GoodChop pending), with service deprecation blocked until all clients stop using old BFF. New ventures BFF project tickets created for Phase 1 implementation."
}